{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of Report (Date of earliest event reported): March 18, 2024",
              "class": "predicted header"
            },
            "8": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "9": {
              "title": "(Exact name of registrant as specified in its charter)",
              "class": "predicted header",
              "contents": {
                "10": {
                  "table": [
                    [
                      "Delaware",
                      "001-40289",
                      "46-4707224"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "11": {
                  "table": [
                    [
                      "Address Not Applicable(1)",
                      "Address Not Applicable(1)"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                },
                "12": {
                  "title": "Not Applicable",
                  "class": "predicted header",
                  "contents": {
                    "13": {
                      "textsmall": "(1)"
                    },
                    "14": {
                      "textsmall": "(Registrant’s telephone number, including area code)"
                    }
                  }
                },
                "15": {
                  "title": "Not Applicable",
                  "class": "predicted header",
                  "contents": {
                    "16": {
                      "textsmall": "(Former name or former address, if changed since last report)"
                    },
                    "17": {
                      "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instructions A.2. below):",
                      "class": "predicted header"
                    },
                    "18": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "19": {
                      "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                      "class": "predicted header"
                    },
                    "20": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "21": {
                      "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                      "class": "predicted header"
                    },
                    "22": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "23": {
                      "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                      "class": "predicted header"
                    },
                    "24": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "25": {
                      "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                      "class": "predicted header"
                    },
                    "26": {
                      "title": "Securities registered pursuant to Section 12(b) of the Act:",
                      "class": "predicted header",
                      "contents": {
                        "27": {
                          "table": [
                            [
                              "Title of each class",
                              "Trading\nSymbol(s)",
                              "Name of each exchange\n on which registered"
                            ],
                            [
                              "Class A common stock, $0.00001 par value",
                              "COIN",
                              "The Nasdaq Stock Market LLC"
                            ]
                          ]
                        }
                      }
                    },
                    "28": {
                      "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).",
                      "class": "predicted header"
                    },
                    "29": {
                      "title": "Emerging growth company ☐",
                      "class": "predicted header"
                    },
                    "30": {
                      "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐",
                      "class": "predicted header"
                    },
                    "31": {
                      "title": "(1)",
                      "class": "predicted header"
                    },
                    "32": {
                      "title": "We are a remote-first company. Accordingly, we do not maintain a headquarters. For purposes of compliance with applicable requirements of the Securities Act of 1933, as amended, and the Securities Exchange Act of 1934, as amended, stockholder communications required to be sent to our principal executive offices may be directed to the email address: secretary@coinbase.com, or to our agent for service of process at Corporation Service Company, 251 Little Falls Drive, Wilmington, Delaware 19808.",
                      "class": "predicted header"
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "33": {
      "title": "Item 1.01.",
      "standardized_title": "item1.01",
      "class": "item",
      "contents": {
        "34": {
          "title": "Entry into a Material Definitive Agreement.",
          "class": "predicted header",
          "contents": {
            "35": {
              "title": "Convertible Notes and the Indenture",
              "class": "predicted header"
            },
            "36": {
              "title": "On March 18, 2024, Coinbase Global, Inc. (the “Company”) completed its previously announced private offering of $1.265 billion aggregate principal amount of 0.25% Convertible Senior Notes due 2030 (the “Notes”), which includes the full exercise by the Initial Purchasers (as defined below) of their option to purchase up to an additional $165.0 million aggregate principal amount of Notes. The Notes are senior unsecured obligations of the Company. The Notes were issued pursuant to an Indenture, dated March 18, 2024 (the “Indenture”), between the Company and U.S. Bank Trust Company, National Association, as trustee (the “Trustee”). The Indenture includes customary covenants and sets forth certain events of default upon which the Notes may be declared immediately due and payable and sets forth certain types of bankruptcy or insolvency events of default involving the Company upon which the Notes become automatically due and payable.",
              "class": "predicted header"
            },
            "37": {
              "title": "The Notes will mature on April 1, 2030, unless earlier repurchased, redeemed or converted. The Notes accrue interest of 0.25% per year payable semi-annually in arrears on April 1 and October 1 of each year, beginning on October 1, 2024. The Notes will be convertible at the option of the holders at any time prior to the close of business on the business day immediately preceding October 1, 2029, only under the following circumstances: (1) during any calendar quarter commencing after the calendar quarter ending on June 30, 2024, if the last reported sale price of the Company’s Class A common stock, par value $0.00001 per share (the “Class A Common Stock”) exceeds 130% of the conversion price for each of at least 20 trading days during a period of 30 consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter; (2) during the five consecutive business day period immediately after any ten consecutive trading day period (the “measurement period”) in which the trading price (as defined in the Indenture) per $1,000 principal amount of Notes for each trading day of the measurement period was less than 98% of the product of the last reported sale price per share of the Class A Common Stock and the conversion rate on each such trading day; (3) if the Company calls such Notes for redemption; and (4) upon the occurrence of specified corporate events or distributions on the Class A Common Stock. On or after October 1, 2029, until the close of business on the second scheduled trading day immediately preceding the maturity date, holders may convert all or any portion of their Notes, in multiples of $1,000 principal amount, at the option of the holder regardless of the foregoing circumstances. Upon conversion, the Company may satisfy its conversion obligation by paying and/or delivering, as the case may be, cash, shares of the Class A Common Stock or a combination of cash and shares of the Class A Common Stock, at the Company’s election, in the manner and subject to the terms and conditions provided in the Indenture. The conversion rate for the Notes will initially be 2.9981 shares of the Class A Common Stock per $1,000 principal amount of the Notes, which is equivalent to an initial conversion price of approximately $333.54 per share of the Class A Common Stock. The initial conversion price of the Notes represents a premium of approximately 32.5% to the $251.73 per share last reported sale price of the Class A Common Stock on March 13, 2024. The conversion rate is subject to customary adjustments under certain circumstances in accordance with the terms of the Indenture. In addition, if certain corporate events that constitute a “Make-Whole Fundamental Change” (as defined in the Indenture) occur, then the conversion rate will, in certain circumstances, be increased for a specified period of time.",
              "class": "predicted header"
            },
            "38": {
              "title": "The Company may not redeem the Notes prior to April 1, 2027. The Company may redeem all or any portion of the Notes (subject to certain limitations), at its option, on or after April 1, 2027, and on or before the 20th scheduled trading day immediately before the maturity date, if the last reported sale price per share of the Class A Common Stock exceeds 130% of the conversion price then in effect on (1) each of at least 20 trading days (whether or not consecutive) during the 30 consecutive trading days ending on, and including, the trading day immediately before the date the Company sends the related redemption notice and (2) the trading day immediately before the date the Company sends such notice, at a redemption price equal to 100% of the principal amount of the Notes to be redeemed, plus any accrued and unpaid interest, to, but excluding, the redemption date. No sinking fund is provided for the Notes, which means that the Company is not required to redeem or retire the Notes periodically.",
              "class": "predicted header"
            },
            "39": {
              "title": "Subject to a limited exception, holders will have the right to require the Company to repurchase for cash all or a portion of the Notes upon the occurrence of a fundamental change (as defined in the Indenture) at a purchase price of 100% of their principal amount plus any accrued and unpaid interest.",
              "class": "predicted header"
            },
            "40": {
              "title": "The Notes will be the Company’s senior, unsecured obligations and will be equal in right of payment with the Company’s existing and future senior, unsecured indebtedness, senior in right of payment to the Company’s existing and future indebtedness that is expressly subordinated to the Notes and effectively subordinated to the Company’s existing and future secured indebtedness, to the extent of the value of the collateral securing that indebtedness. The Notes will be structurally subordinated to all existing and future indebtedness and other liabilities, including trade payables, and (to the extent we are not a holder thereof) preferred equity, if any, of the Company’s subsidiaries.",
              "class": "predicted header"
            },
            "41": {
              "title": "The following events are considered “events of default” with respect to the Notes, which may result in the acceleration of the maturity of the Notes:",
              "class": "predicted header"
            },
            "42": {
              "title": "(1) a default by the Company in the payment when due (whether at maturity, upon redemption or repurchase upon fundamental change or otherwise) of the principal of, or the redemption price or fundamental change repurchase price for, any Note;",
              "class": "predicted header"
            },
            "43": {
              "title": "(2) a default by the Company for 30 days in the payment when due of interest on any Note;",
              "class": "predicted header"
            },
            "44": {
              "title": "(3) failure by the Company to deliver, when required by the Indenture, a fundamental change notice or a notice of specified corporate events with respect to the Notes, in each case when due, and such failure continues for one business day;",
              "class": "predicted header"
            },
            "45": {
              "title": "(4) a default by the Company in its obligation to convert a Note in accordance with the Indenture upon the exercise of the conversion right with respect thereto, if such default is not cured within three business days after its occurrence;",
              "class": "predicted header"
            },
            "46": {
              "title": "(5) a default by the Company of any of its obligations with respect to consolidation, merger, sale, lease, and transfer, in one transaction or a series of transactions, of all or substantially all of the assets of the Company and its subsidiaries, taken as a whole;",
              "class": "predicted header"
            },
            "47": {
              "title": "(6) a default by the Company in any of its obligations or agreements under the Indenture or the Notes (other than a default set forth in paragraphs (1), (2), (3), (4) or (5) above) where such default is not cured or waived within 60 days after notice to the Company by the Trustee, or to the Company and the Trustee by holders of at least 25% of the aggregate principal amount of the Notes then outstanding, which notice must specify such default, demand that it be remedied and state that such notice is a “notice of default”",
              "class": "predicted header"
            },
            "48": {
              "title": "(7) a default by the Company or any of its significant subsidiaries (as defined in the Indenture) with respect to any one or more mortgages, agreements or other instruments under which there is outstanding, or by which there is secured or evidenced, any indebtedness for money borrowed (other than non-recourse indebtedness) of at least $150.0 million (or its foreign currency equivalent) in the aggregate of the Company or any of subsidiaries, whether such indebtedness exists as of the date the Company first issued the Notes or is thereafter created, where such default (i) constitutes a failure to pay the principal of, or premium or interest on, any of such indebtedness when due and payable at its stated maturity, upon required repurchase, upon declaration of acceleration or otherwise or (ii) results in such indebtedness becoming or being declared due and payable before its stated maturity; and in each case of either clause (i) or (ii) above, where such default is not cured or waived within 30 days after notice to the Company by the Trustee or to the Company and the Trustee by holders of at least 25% of the aggregate principal amount of the Notes then outstanding; and",
              "class": "predicted header"
            },
            "49": {
              "title": "(8) certain events of bankruptcy, insolvency and reorganization with respect to the Company or any significant subsidiary.",
              "class": "predicted header"
            },
            "50": {
              "title": "If an event of default (other than an event of default described in paragraph (8) above with respect to the Company and not solely with respect to a significant subsidiary of the Company) occurs and is continuing, then, except with respect to situations involving special interest as the sole remedy for certain reporting defaults, the Trustee, by notice to the Company, or holders of at least 25% of the aggregate principal amount of notes then outstanding, by notice to the Company and the Trustee, may declare the principal amount of, and all accrued and unpaid interest, on, all of the Notes then outstanding to become due and payable immediately. If an event of default described in paragraph (8) above occurs with respect to the Company (and not solely with respect to a significant subsidiary of the Company), then the principal amount of, and all accrued and unpaid interest, on, all of the Notes then outstanding will immediately become due and payable without any further action or notice by any person.",
              "class": "predicted header"
            },
            "51": {
              "title": "Copies of the Indenture and the form of Note are attached as Exhibits 4.1 and 4.2, respectively, to this Current Report on Form 8-K and are incorporated herein by reference. The foregoing description of the Indenture and Notes do not purport to be complete and is qualified in its entirety by reference to the full text in such exhibits.",
              "class": "predicted header"
            },
            "52": {
              "title": "The net proceeds from this offering were approximately $1.24 billion, after deducting the Initial Purchasers’ discounts and commissions and the Company’s estimated offering expenses. The Company used approximately $104.1 million of the net proceeds from the offering to pay the cost of the Capped Call Transactions (as defined below). The Company intends to use the remainder of the net proceeds from the offering to repay at maturity, or repurchase or redeem prior to maturity, from time to time and subject to market conditions, its outstanding 0.50% Convertible Senior Notes due 2026, 3.375% Senior Notes due 2028, and 3.625% Senior Notes due 2031 and for other general corporate purposes, which may include working capital and capital expenditures. The Company may also use a portion of the net proceeds to make investments in and acquisitions of other companies, products or technologies that it may identify from time to time.",
              "class": "predicted header",
              "contents": {
                "53": {
                  "title": "Capped Call Transactions",
                  "class": "predicted header"
                }
              }
            },
            "54": {
              "title": "On March 13, 2024, in connection with the pricing of the Notes, and on March 14, 2024, in connection with the full exercise by the Initial Purchasers of their option to purchase additional Notes pursuant to the Purchase Agreement, the Company entered into privately negotiated capped call transactions (the “Capped Call Transactions”) with certain financial institutions (the “Option Counterparties”). The Capped Call Transactions have an initial strike price of approximately $333.54 per share, subject to adjustments, which corresponds to the approximate initial conversion price of the Notes. The Capped Call Transactions cover, subject to customary adjustments, the number of shares of Class A Common Stock that initially underlie the Notes. The Capped Call Transactions are expected generally to reduce the potential dilution to the Class A Common Stock upon any conversion of Notes and/or offset any potential cash payments the Company would be required to make in excess of the principal amount of converted Notes, as the case may be, with such reduction and/or offset subject to a cap. If, however, the market price per share of Class A Common Stock, as measured under the terms of the Capped Call Transactions, exceeds the cap price of the Capped Call Transactions, there would nevertheless be dilution and/or there would not be an offset of such potential cash payments, in each case, to the extent that the then-market price per share of the Class A Common Stock exceeds the cap price of the Capped Call Transactions. The cap price of the Capped Call Transactions is initially approximately $503.46 per share, which represents a premium of approximately 100% over the last reported sale price of the Class A Common Stock of $251.73 per share on March 13, 2024, and is subject to certain adjustments under the terms of the Capped Call Transactions. The Capped Call Transactions are subject to either adjustment or termination upon the occurrence of specified extraordinary events affecting the Company, including a merger; a tender offer; and a nationalization, insolvency, or delisting involving the Company. In addition, the Capped Call Transactions are subject to certain specified additional disruption events that may give rise to a termination of the Capped Call Transactions, including changes in law; insolvency filings and hedging disruptions.",
              "class": "predicted header"
            },
            "55": {
              "title": "The Capped Call Transactions are separate transactions entered into by the Company with the Option Counterparties and are not part of the terms of the Notes and will not affect any holder’s rights under the Notes. Holders of the Notes will not have any rights with respect to the Capped Call Transactions.",
              "class": "predicted header"
            },
            "56": {
              "title": "A copy of the form of the Capped Call Transaction confirmation is attached as Exhibit 10.1 to this Current Report on Form 8-K and is incorporated herein by reference. The foregoing description of the Capped Call Transaction confirmation does not purport to be complete and is qualified in its entirety by reference to the full text in such exhibit.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "57": {
      "title": "Item 2.03.",
      "standardized_title": "item2.03",
      "class": "item",
      "contents": {
        "58": {
          "title": "Creation of a Direct Financial Obligation or an Obligation under an Off-Balance Sheet Arrangement of a Registrant.",
          "class": "predicted header",
          "contents": {
            "59": {
              "title": "The information set forth under Item 1.01 of this Current Report on Form 8-K is incorporated herein by reference.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "60": {
      "title": "Item 3.02.",
      "standardized_title": "item3.02",
      "class": "item",
      "contents": {
        "61": {
          "title": "Unregistered Sales of Equity Securities.",
          "class": "predicted header",
          "contents": {
            "62": {
              "title": "The information set forth under Items 1.01 and 8.01 of this Current Report on Form 8-K is incorporated herein by reference.",
              "class": "predicted header"
            },
            "63": {
              "title": "The Company offered and sold the Notes to the Initial Purchasers in reliance on the exemption from the registration requirements provided by Section 4(a)(2) of the Securities Act of 1933, as amended (the “Securities Act”), and for resale by the Initial Purchasers to persons reasonably believed to be “qualified institutional buyers,” as defined in and pursuant to the exemption from registration requirements provided by Rule 144A under the Securities Act. The Company relied on these exemptions from registration based in part on representations made by the Initial Purchasers in the Purchase Agreement (as defined below) pursuant to which the Company sold the Notes to the Initial Purchasers. The shares of the Class A Common Stock issuable upon conversion of the Notes, if any, have not been registered under the Securities Act and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements.",
              "class": "predicted header"
            },
            "64": {
              "title": "Initially, a maximum of 5,025,212 shares of the Class A common stock may be issued upon conversion of the Notes, based on the initial maximum conversion rate of 3.9725 shares of Class A common stock per $1,000 principal amount of Notes, which is subject to customary anti-dilution adjustment provisions.",
              "class": "predicted header"
            },
            "65": {
              "title": "To the extent that any shares of the Class A Common Stock are issued upon conversion of the Notes, they will be issued in transactions anticipated to be exempt from registration under the Securities Act by virtue of Section 3(a)(9) thereof, because no commission or other remuneration is expected to be paid in connection with conversion of the Notes and any resulting issuance of shares of the Class A Common Stock.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "66": {
      "title": "Item 8.01.",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "67": {
          "title": "Other Events",
          "class": "predicted header",
          "contents": {
            "68": {
              "title": "Purchase Agreement",
              "class": "predicted header",
              "contents": {
                "69": {
                  "title": "On March 13, 2024, the Company entered into a purchase agreement (the “Purchase Agreement”) with Citigroup Global Markets Inc., as representative of the several initial purchasers named therein (collectively, the “Initial Purchasers”), to issue and sell the Notes. The Initial Purchasers exercised their option under the Purchase Agreement to purchase up to an additional $165.0 million principal amount of Notes in full on March 14, 2024. The Purchase Agreement includes customary representations, warranties, and covenants by the Company and customary closing conditions. Under the terms of the Purchase Agreement, the Company has agreed to indemnify the Initial Purchasers against certain liabilities.",
                  "class": "predicted header"
                }
              }
            }
          }
        }
      }
    },
    "70": {
      "title": "Item 9.01.",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "71": {
          "title": "Financial Statements and Exhibits.",
          "class": "predicted header",
          "contents": {
            "72": {
              "title": "(d) Exhibits",
              "class": "predicted header",
              "contents": {
                "73": {
                  "table": [
                    [
                      "Exhibit",
                      "Description"
                    ],
                    [
                      " 4.1",
                      "Indenture, dated as of March 18, 2024, between Coinbase Global, Inc. and U.S. Bank Trust Company, National Association, as trustee."
                    ],
                    [
                      " 4.2",
                      "Form of 0.25% Convertible Senior Notes due 2030 (included in Exhibit 4.1)."
                    ],
                    [
                      "10.1",
                      "Form of Capped Call Transaction Confirmation."
                    ],
                    [
                      "104",
                      "The cover page from this Current Report on Form 8-K, formatted in Inline XBRL."
                    ]
                  ]
                }
              }
            }
          }
        }
      }
    },
    "74": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "75": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "76": {
              "table": [
                [
                  "",
                  "COINBASE GLOBAL, INC.",
                  "COINBASE GLOBAL, INC."
                ],
                [
                  "Dated: March 18, 2024",
                  "By:",
                  "/s/ Alesia J. Haas"
                ],
                [
                  "",
                  "",
                  "Alesia J. Haas"
                ],
                [
                  "",
                  "",
                  "Chief Financial Officer"
                ]
              ]
            }
          }
        }
      }
    }
  }
}