{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "table": []
        },
        "1": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "2": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header",
          "contents": {
            "3": {
              "title": "Washington, D.C. 20549",
              "class": "predicted header"
            }
          }
        },
        "4": {
          "title": "FORM 10-Q",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "(Mark One)",
              "class": "predicted header",
              "contents": {
                "6": {
                  "table": [
                    [
                      "☒",
                      "QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934"
                    ],
                    [
                      "",
                      "For the quarterly period ended March 31, 2025"
                    ],
                    [
                      "OR",
                      "OR"
                    ],
                    [
                      "☐",
                      "TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934"
                    ],
                    [
                      "",
                      "For the transition period from      to     ."
                    ]
                  ]
                }
              }
            },
            "7": {
              "title": "Commission file number 001-40289",
              "class": "predicted header"
            },
            "8": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "9": {
                  "title": "(Exact name of registrant as specified in its charter)",
                  "class": "predicted header",
                  "contents": {
                    "10": {
                      "table": [
                        [
                          "Delaware",
                          "46-4707224"
                        ],
                        [
                          "(State or other jurisdiction of incorporation or organization)",
                          "(I.R.S. Employer Identification No.)"
                        ],
                        [
                          "One Madison Avenue\nSuite 2400\nNew York, NY",
                          "10010"
                        ],
                        [
                          "(Address of Principal Executive Offices)1",
                          "(Zip Code)1"
                        ]
                      ]
                    },
                    "11": {
                      "table": []
                    },
                    "12": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading Symbol(s)",
                          "Name of each exchange on which registered"
                        ],
                        [
                          "Class A common stock, $0.00001 par value per share",
                          "COIN",
                          "The Nasdaq Stock Market LLC"
                        ]
                      ]
                    },
                    "13": {
                      "textsmall": "Indicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports); and (2) has been subject to such filing requirements for the past 90 days.    Yes  ☒   No   ☐  "
                    },
                    "14": {
                      "textsmall": "Indicate by check mark whether the registrant has submitted electronically every Interactive Data File required to be submitted pursuant to Rule 405 of Regulation S-T (§232.405 of this chapter) during the preceding 12 months (or for such shorter period that the registrant was required to submit such files).     Yes  ☒   No   ☐ "
                    },
                    "15": {
                      "textsmall": "Indicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller reporting company, or an emerging growth company. See the definitions of “large accelerated filer,” “accelerated filer,” “smaller reporting company” and “emerging growth company” in Rule 12b-2 of the Exchange Act."
                    },
                    "16": {
                      "table": [
                        [
                          "Large accelerated filer",
                          "☒",
                          "Accelerated filer",
                          "☐"
                        ],
                        [
                          "Non-accelerated filer",
                          "☐",
                          "Smaller reporting company",
                          "☐"
                        ],
                        [
                          "",
                          "",
                          "Emerging growth company",
                          "☐"
                        ]
                      ]
                    },
                    "17": {
                      "textsmall": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                    },
                    "18": {
                      "textsmall": "Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Act).     Yes   ☐     No   ☒"
                    },
                    "19": {
                      "textsmall": "As of May 1, 2025, the number of shares of the registrant's Class A common stock outstanding was 211,407,406 and the number of shares of the registrant's Class B common stock outstanding was 43,297,558."
                    },
                    "20": {
                      "table": []
                    },
                    "21": {
                      "textsmall": "1 We are a remote-first company. Accordingly, we do not maintain a headquarters. We are including this address solely for the purpose of satisfying the Securities and Exchange Commission’s request. Stockholder communications may also be sent to the email address: secretary@coinbase.com."
                    },
                    "22": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            }
          }
        },
        "23": {
          "title": "TABLE OF CONTENTS",
          "class": "predicted header",
          "contents": {
            "24": {
              "table": [
                [
                  "",
                  "Page"
                ],
                [
                  "Part I - Financial Information",
                  ""
                ],
                [
                  "Item 1. Financial Statements (Unaudited)",
                  "5"
                ],
                [
                  "Condensed Consolidated Balance Sheets",
                  "5"
                ],
                [
                  "Condensed Consolidated Statements of Operations",
                  "6"
                ],
                [
                  "Condensed Consolidated Statements of Comprehensive Income",
                  "7"
                ],
                [
                  "Condensed Consolidated Statements of Changes in Stockholders' Equity",
                  "8"
                ],
                [
                  "Condensed Consolidated Statements of Cash Flows",
                  "9"
                ],
                [
                  "Notes to Condensed Consolidated Financial Statements",
                  "10"
                ],
                [
                  "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations",
                  "26"
                ],
                [
                  "Item 3. Quantitative and Qualitative Disclosures About Market Risk",
                  "41"
                ],
                [
                  "Item 4. Controls and Procedures",
                  "41"
                ],
                [
                  "Part II - Other Information",
                  ""
                ],
                [
                  "Item 1. Legal Proceedings",
                  "42"
                ],
                [
                  "Item 1A. Risk Factors",
                  "42"
                ],
                [
                  "Item 2. Unregistered Sales of Equity Securities, Use of Proceeds, and Issuer Purchases of Equity Securities",
                  "105"
                ],
                [
                  "Item 3. Defaults Upon Senior Securities",
                  "105"
                ],
                [
                  "Item 4. Mine Safety Disclosures",
                  "105"
                ],
                [
                  "Item 5. Other Information",
                  "105"
                ],
                [
                  "Item 6. Exhibits",
                  "106"
                ],
                [
                  "Signatures",
                  "107"
                ]
              ]
            },
            "25": {
              "title": "1",
              "class": "predicted header",
              "contents": {
                "26": {
                  "title": "Table of Contents",
                  "class": "predicted header"
                }
              }
            }
          }
        },
        "27": {
          "title": "SPECIAL NOTE ABOUT FORWARD-LOOKING STATEMENTS",
          "class": "predicted header",
          "contents": {
            "28": {
              "text": "This Quarterly Report on Form 10-Q contains forward-looking statements. All statements contained in this Quarterly Report on Form 10-Q other than statements of historical fact, including statements regarding our future operating results and financial position, our business strategy and plans, market growth, and our objectives for future operations, are forward-looking statements. In some cases, forward-looking statements may be identified by words such as “believe,” “may,” “will,” “estimate,” “potential,” “continue,” “anticipate,” “intend,” “expect,” “could,” “would,” “project,” “plan,” “target,” or the negative of these terms or other similar expressions."
            },
            "29": {
              "text": "Forward-looking statements contained in this Quarterly Report on Form 10-Q include, but are not limited to, statements about:"
            },
            "30": {
              "text": "•our future financial performance, including our expectations regarding our net revenue, operating expenses, and our ability to achieve and maintain future profitability;"
            },
            "31": {
              "text": "•our business plan and our ability to effectively manage any growth;"
            },
            "32": {
              "text": "•anticipated trends, growth rates, and challenges in our business, the cryptoeconomy, the price, and market capitalization of crypto assets and in the markets in which we operate;"
            },
            "33": {
              "text": "•market acceptance of our products and services;"
            },
            "34": {
              "text": "•beliefs and objectives for future operations;"
            },
            "35": {
              "text": "•our ability to maintain, expand, and further penetrate our existing customer base;"
            },
            "36": {
              "text": "•our ability to develop new products and services and grow our business in response to changing technologies, customer demand, and competitive pressures;"
            },
            "37": {
              "text": "•our expectations concerning relationships with third parties;"
            },
            "38": {
              "text": "•our ability to maintain, protect, and enhance our intellectual property;"
            },
            "39": {
              "text": "•our ability to continue to expand internationally;"
            },
            "40": {
              "text": "•the effects of increased competition in our markets and our ability to compete effectively;"
            },
            "41": {
              "text": "•future acquisitions of or investments in complementary companies, products, services, or technologies and our ability to successfully integrate such companies or assets;"
            },
            "42": {
              "text": "•our ability to stay in compliance with laws and regulations that currently apply or become applicable to our business both in the United States and internationally given the highly evolving and uncertain regulatory landscape;"
            },
            "43": {
              "text": "•general macroeconomic conditions, including interest rates, inflation, changes in tariffs and trade restrictions, instability in the global banking system, economic downturns, and other global events, including regional wars and conflicts and government shutdowns;"
            },
            "44": {
              "text": "•economic and industry trends, projected growth, or trend analysis;"
            },
            "45": {
              "text": "•trends in revenue;"
            },
            "46": {
              "text": "•trends in operating expenses, including technology and development expenses, sales and marketing expenses, and general and administrative expenses, as well as certain variable expenses, and expectations regarding these expenses as a percentage of revenue;"
            },
            "47": {
              "text": "•our key business metrics used to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions;"
            },
            "48": {
              "text": "•our plans with respect to the Share Repurchase Program; and"
            },
            "49": {
              "text": "•other statements regarding our future operations, financial condition, and prospects and business strategies."
            },
            "50": {
              "text": "We caution you that the foregoing list may not contain all of the forward-looking statements made in this Quarterly Report on Form 10-Q."
            },
            "51": {
              "title": "2",
              "class": "predicted header",
              "contents": {
                "52": {
                  "title": "Table of Contents",
                  "class": "predicted header",
                  "contents": {
                    "53": {
                      "text": "You should not rely upon forward-looking statements as predictions of future events. We have based the forward-looking statements contained in this Quarterly Report on Form 10-Q on our current expectations and projections about future events and trends that we believe may affect our business, financial condition, results of operations, and prospects. The outcome of the events described in these forward-looking statements is subject to risks, uncertainties, and other factors, including those described in the section titled “Risk Factors” in Part II, Item 1A of this Quarterly Report on Form 10-Q and elsewhere in this Quarterly Report on Form 10-Q. Moreover, we operate in a very competitive and rapidly changing environment. New risks and uncertainties emerge from time to time and it is not possible for us to predict all risks and uncertainties that could have an impact on any forward-looking statements contained in this Quarterly Report on Form 10-Q. We cannot assure you that the results, events, and circumstances reflected in the forward-looking statements will be achieved or occur, and actual results, events, or circumstances could differ materially from those described in such forward-looking statements."
                    },
                    "54": {
                      "text": "Neither we nor any other person assume responsibility for the accuracy and completeness of any of these forward-looking statements. Moreover, the forward-looking statements made in this Quarterly Report on Form 10-Q relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this Quarterly Report on Form 10-Q to reflect events or circumstances after the date of this Quarterly Report on Form 10-Q or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions or expectations disclosed in our forward-looking statements and you should not place undue reliance on our forward-looking statements. Our forward-looking statements do not reflect the potential impact of any future acquisitions, mergers, dispositions, restructurings, joint ventures, partnerships, or investments we may make."
                    },
                    "55": {
                      "text": "In addition, statements that “we believe” and similar statements reflect our beliefs and opinions on the relevant subject. These statements are based upon information available to us as of the date of this Quarterly Report on Form 10-Q, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain, and investors are cautioned not to unduly rely upon these statements."
                    }
                  }
                }
              }
            }
          }
        },
        "56": {
          "title": "RISK FACTORS SUMMARY",
          "class": "predicted header",
          "contents": {
            "57": {
              "text": "Consistent with the foregoing, our business is subject to a number of risks and uncertainties, including those risks discussed at length below. These risks include, among others, the following, which we consider our most material risks:"
            },
            "58": {
              "text": "•Our operating results have and will significantly fluctuate, including due to the highly volatile nature of crypto;"
            },
            "59": {
              "text": "•Our total revenue is substantially dependent on the prices of crypto assets and volume of transactions conducted on our platform. If such price or volume declines, our business, operating results, and financial condition would be adversely affected and the price of our Class A common stock could decline;"
            },
            "60": {
              "text": "•Our net revenue may be concentrated in a limited number of areas. Within transaction revenue and subscription and services revenue, a meaningful concentration is from transactions in Bitcoin and Ethereum and stablecoin revenue in connection with USDC, respectively. If revenue from these areas declines and is not replaced by new demand for crypto assets or other products and services, our business, operating results, and financial condition could be adversely affected;"
            },
            "61": {
              "text": "•We have in the past, and may in the future, enter into partnerships, collaborations, joint ventures, or strategic alliances with third parties. If we are unsuccessful in establishing or maintaining strategic relationships with these third parties or if these third parties fail to deliver certain operational services, our business, operating results, and financial condition could be adversely affected;"
            },
            "62": {
              "text": "•Interest rate fluctuations could negatively impact us;"
            },
            "63": {
              "title": "3",
              "class": "predicted header",
              "contents": {
                "64": {
                  "title": "Table of Contents",
                  "class": "predicted header",
                  "contents": {
                    "65": {
                      "text": "•Adverse economic conditions could adversely affect our business;"
                    },
                    "66": {
                      "text": "•The future development and growth of crypto is subject to a variety of factors that are difficult to predict and evaluate. If crypto does not grow as we expect, our business, operating results, and financial condition could be adversely affected;"
                    },
                    "67": {
                      "text": "•Cyberattacks and security breaches of our platform, or those impacting our customers or third parties, could adversely affect our brand, reputation, business, operating results, and financial condition;"
                    },
                    "68": {
                      "text": "•We are subject to an extensive, highly-evolving and uncertain regulatory landscape and any adverse changes to, or our failure to comply with, any laws and regulations could adversely affect our brand, reputation, business, operating results, and financial condition;"
                    },
                    "69": {
                      "text": "•We operate in a highly competitive industry and we compete against unregulated or less regulated companies and companies with greater financial and other resources, and our business, operating results, and financial condition could be adversely affected if we are unable to compete effectively;"
                    },
                    "70": {
                      "text": "•We compete against a growing number of decentralized and noncustodial platforms and our business, operating results, and financial condition could be adversely affected if we fail to compete effectively;"
                    },
                    "71": {
                      "text": "•As we continue to expand and localize our international activities, our obligations to comply with the laws, rules, regulations, and policies of a variety of jurisdictions will increase and we may be subject to inquiries, investigations, and enforcement actions by U.S. and non-U.S. regulators and governmental authorities, including those related to sanctions, export control, and anti-money laundering;"
                    },
                    "72": {
                      "text": "•We are, and may continue to be, subject to material litigation, including individual and class action lawsuits, as well as investigations and enforcement actions by regulators and governmental authorities. These matters are often expensive and time consuming, and, if resolved adversely, could adversely affect our business, operating results, and financial condition;"
                    },
                    "73": {
                      "text": "•If we cannot keep pace with rapid industry changes to provide new and innovative products and services, the use of our products and services, and consequently our net revenue, could decline, which could adversely affect our business, operating results, and financial condition;"
                    },
                    "74": {
                      "text": "•A particular crypto asset, product or service’s status as a “security” in any relevant jurisdiction is subject to a high degree of uncertainty and if we are unable to properly characterize a crypto asset or product offering, we may be subject to regulatory scrutiny, inquiries, investigations, fines, and other penalties, which could adversely affect our business, operating results, and financial condition;"
                    },
                    "75": {
                      "text": "•We currently rely on third-party service providers for certain aspects of our operations, and any interruptions in services provided by these third parties may impair our ability to support our customers;"
                    },
                    "76": {
                      "text": "•Loss of a critical financial institution or insurance relationship could adversely affect our business, operating results, and financial condition;"
                    },
                    "77": {
                      "text": "•Any significant disruption in our products and services, in our information technology systems, or in any of the blockchain networks we support, could result in a loss of customers or funds and adversely affect our brand, reputation, business, operating results, and financial condition;"
                    },
                    "78": {
                      "text": "•Our failure to securely store and manage our and our customers’ fiat currencies and crypto assets could adversely affect our business, operating results, and financial condition; and"
                    },
                    "79": {
                      "text": "•The theft, loss, or destruction of private keys required to access any crypto assets held in custody for our own account or for our customers may be irreversible. If we are unable to access our private keys or if we experience a hack or other data loss relating to our ability to access any crypto assets, it could cause regulatory scrutiny, reputational harm, and other losses."
                    }
                  }
                }
              }
            },
            "80": {
              "title": "4",
              "class": "predicted header",
              "contents": {
                "81": {
                  "title": "Table of Contents",
                  "class": "predicted header"
                }
              }
            }
          }
        },
        "82": {
          "title": "PART I. FINANCIAL INFORMATION",
          "class": "predicted header"
        },
        "83": {
          "title": "ITEM 1. FINANCIAL STATEMENTS",
          "standardized_title": "item1",
          "class": "item",
          "contents": {
            "84": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "85": {
                  "title": "Condensed Consolidated Balance Sheets",
                  "class": "predicted header"
                }
              }
            },
            "86": {
              "title": "(In thousands, except per share data)",
              "class": "predicted header"
            },
            "87": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "88": {
                  "table": [
                    [
                      "",
                      "March 31,",
                      "December 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Assets",
                      "",
                      ""
                    ],
                    [
                      "Current assets:",
                      "",
                      ""
                    ],
                    [
                      "Cash and cash equivalents",
                      "$8,051,169",
                      "$8,543,903"
                    ],
                    [
                      "Restricted cash and cash equivalents",
                      "55,672",
                      "38,519"
                    ],
                    [
                      "USDC",
                      "2,225,054",
                      "1,241,808"
                    ],
                    [
                      "Customer custodial funds",
                      "5,369,865",
                      "6,158,949"
                    ],
                    [
                      "Crypto assets held for operations",
                      "67,485",
                      "82,781"
                    ],
                    [
                      "Loan receivables",
                      "454,473",
                      "475,370"
                    ],
                    [
                      "Crypto assets held as collateral",
                      "597,548",
                      "767,484"
                    ],
                    [
                      "Crypto assets borrowed",
                      "235,433",
                      "261,052"
                    ],
                    [
                      "Accounts receivable, net",
                      "245,112",
                      "265,251"
                    ],
                    [
                      "Other current assets",
                      "151,977",
                      "277,536"
                    ],
                    [
                      "Total current assets",
                      "17,453,788",
                      "18,112,653"
                    ],
                    [
                      "Crypto assets held for investment",
                      "1,268,001",
                      "1,552,995"
                    ],
                    [
                      "Deferred tax assets",
                      "995,529",
                      "941,298"
                    ],
                    [
                      "Goodwill",
                      "1,153,621",
                      "1,139,670"
                    ],
                    [
                      "Other non-current assets",
                      "860,067",
                      "795,335"
                    ],
                    [
                      "Total assets",
                      "$21,731,006",
                      "$22,541,951"
                    ],
                    [
                      "Liabilities and Stockholders’ Equity",
                      "",
                      ""
                    ],
                    [
                      "Current liabilities:",
                      "",
                      ""
                    ],
                    [
                      "Customer custodial fund liabilities",
                      "$5,369,865",
                      "$6,158,949"
                    ],
                    [
                      "Crypto asset borrowings",
                      "272,608",
                      "300,110"
                    ],
                    [
                      "Obligation to return collateral",
                      "628,854",
                      "792,125"
                    ],
                    [
                      "Accrued expenses and other current liabilities",
                      "662,042",
                      "690,136"
                    ],
                    [
                      "Total current liabilities",
                      "6,933,369",
                      "7,941,320"
                    ],
                    [
                      "Long-term debt",
                      "4,237,090",
                      "4,234,081"
                    ],
                    [
                      "Other non-current liabilities",
                      "92,307",
                      "89,708"
                    ],
                    [
                      "Total liabilities",
                      "11,262,766",
                      "12,265,109"
                    ],
                    [
                      "Commitments and contingencies (Note 16)",
                      "",
                      ""
                    ],
                    [
                      "Stockholders’ equity:",
                      "",
                      ""
                    ],
                    [
                      "Preferred stock, $0.00001 par value; 500,000 shares authorized and zero shares issued and outstanding at each of March 31, 2025 and December 31, 2024",
                      "—",
                      "—"
                    ],
                    [
                      "Class A common stock, $0.00001 par value; 10,000,000 shares authorized at March 31, 2025 and December 31, 2024; 210,960 and 209,762 shares issued and outstanding at March 31, 2025 and December 31, 2024, respectively",
                      "2",
                      "2"
                    ],
                    [
                      "Class B common stock, $0.00001 par value; 500,000 shares authorized at March 31, 2025 and December 31, 2024; 43,630 and 43,878 shares issued and outstanding at March 31, 2025 and December 31, 2024, respectively",
                      "—",
                      "—"
                    ],
                    [
                      "Additional paid-in capital",
                      "5,483,821",
                      "5,365,990"
                    ],
                    [
                      "Accumulated other comprehensive loss",
                      "(42,092)",
                      "(50,051)"
                    ],
                    [
                      "Retained earnings",
                      "5,026,509",
                      "4,960,901"
                    ],
                    [
                      "Total stockholders’ equity",
                      "10,468,240",
                      "10,276,842"
                    ],
                    [
                      "Total liabilities and stockholders’ equity",
                      "$21,731,006",
                      "$22,541,951"
                    ]
                  ]
                },
                "89": {
                  "title": "The accompanying notes are an integral part of these Condensed Consolidated Financial Statements.",
                  "class": "predicted header"
                },
                "90": {
                  "title": "5",
                  "class": "predicted header",
                  "contents": {
                    "91": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "92": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "93": {
                  "title": "Condensed Consolidated Statements of Operations",
                  "class": "predicted header"
                }
              }
            },
            "94": {
              "title": "(In thousands, except per share data)",
              "class": "predicted header"
            },
            "95": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "96": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Revenue:",
                      "",
                      ""
                    ],
                    [
                      "Net revenue",
                      "$1,960,319",
                      "$1,587,677"
                    ],
                    [
                      "Other revenue",
                      "73,976",
                      "49,893"
                    ],
                    [
                      "Total revenue",
                      "2,034,295",
                      "1,637,570"
                    ],
                    [
                      "Operating expenses:",
                      "",
                      ""
                    ],
                    [
                      "Transaction expense",
                      "303,026",
                      "217,407"
                    ],
                    [
                      "Technology and development",
                      "355,368",
                      "357,863"
                    ],
                    [
                      "Sales and marketing",
                      "247,283",
                      "98,585"
                    ],
                    [
                      "General and administrative",
                      "394,346",
                      "287,236"
                    ],
                    [
                      "Losses (gains) on crypto assets held for operations, net",
                      "34,365",
                      "(86,358)"
                    ],
                    [
                      "Other operating (income) expense, net",
                      "(5,899)",
                      "2,376"
                    ],
                    [
                      "Total operating expenses",
                      "1,328,489",
                      "877,109"
                    ],
                    [
                      "Operating income",
                      "705,806",
                      "760,461"
                    ],
                    [
                      "Interest expense",
                      "20,511",
                      "19,071"
                    ],
                    [
                      "Losses (gains) on crypto assets held for investment, net",
                      "596,651",
                      "(650,429)"
                    ],
                    [
                      "Other expense (income), net",
                      "6,188",
                      "(45,605)"
                    ],
                    [
                      "Income before income taxes",
                      "82,456",
                      "1,437,424"
                    ],
                    [
                      "Provision for income taxes",
                      "16,848",
                      "261,179"
                    ],
                    [
                      "Net income",
                      "$65,608",
                      "$1,176,245"
                    ],
                    [
                      "Net income attributable to common stockholders:",
                      "",
                      ""
                    ],
                    [
                      "Basic",
                      "$65,608",
                      "$1,175,479"
                    ],
                    [
                      "Diluted",
                      "$65,608",
                      "$1,178,079"
                    ],
                    [
                      "Net income per share:",
                      "",
                      ""
                    ],
                    [
                      "Basic",
                      "$0.26",
                      "$4.84"
                    ],
                    [
                      "Diluted",
                      "$0.24",
                      "$4.40"
                    ],
                    [
                      "Weighted-average shares of common stock used to compute net income per share:",
                      "",
                      ""
                    ],
                    [
                      "Basic",
                      "253,878",
                      "242,793"
                    ],
                    [
                      "Diluted",
                      "271,251",
                      "267,945"
                    ]
                  ]
                },
                "97": {
                  "title": "The accompanying notes are an integral part of these Condensed Consolidated Financial Statements.",
                  "class": "predicted header"
                },
                "98": {
                  "title": "6",
                  "class": "predicted header",
                  "contents": {
                    "99": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "100": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "101": {
                  "title": "Condensed Consolidated Statements of Comprehensive Income",
                  "class": "predicted header"
                }
              }
            },
            "102": {
              "title": "(In thousands)",
              "class": "predicted header"
            },
            "103": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "104": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Net income",
                      "$65,608",
                      "$1,176,245"
                    ],
                    [
                      "Other comprehensive income (loss):",
                      "",
                      ""
                    ],
                    [
                      "Translation adjustment",
                      "8,018",
                      "(6,898)"
                    ],
                    [
                      "Income tax effect",
                      "(59)",
                      "(328)"
                    ],
                    [
                      "Translation adjustment, net of tax",
                      "7,959",
                      "(7,226)"
                    ],
                    [
                      "Comprehensive income",
                      "$73,567",
                      "$1,169,019"
                    ]
                  ]
                },
                "105": {
                  "title": "The accompanying notes are an integral part of these Condensed Consolidated Financial Statements.",
                  "class": "predicted header"
                },
                "106": {
                  "title": "7",
                  "class": "predicted header",
                  "contents": {
                    "107": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "108": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "109": {
              "title": "Condensed Consolidated Statements of Changes in Stockholders' Equity",
              "class": "predicted header"
            },
            "110": {
              "title": "(In thousands)",
              "class": "predicted header"
            },
            "111": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "112": {
                  "table": [
                    [
                      "",
                      "Common Stock",
                      "Common Stock",
                      "Additional Paid-In Capital",
                      "Accumulated Other Comprehensive Loss",
                      "Retained Earnings",
                      ""
                    ],
                    [
                      "",
                      "Shares",
                      "Amount",
                      "Additional Paid-In Capital",
                      "Accumulated Other Comprehensive Loss",
                      "Retained Earnings",
                      "Total"
                    ],
                    [
                      "Balance at January 1, 2025",
                      "253,640",
                      "$2",
                      "$5,365,990",
                      "$(50,051)",
                      "$4,960,901",
                      "$10,276,842"
                    ],
                    [
                      "Issuance of common stock upon settlement of stock awards, net of shares withheld",
                      "554",
                      "—",
                      "(100,303)",
                      "—",
                      "—",
                      "(100,303)"
                    ],
                    [
                      "Issuance of common stock upon exercise of stock options",
                      "396",
                      "—",
                      "10,840",
                      "—",
                      "—",
                      "10,840"
                    ],
                    [
                      "Stock-based compensation (inclusive of capitalized stock-based compensation)",
                      "—",
                      "—",
                      "207,294",
                      "—",
                      "—",
                      "207,294"
                    ],
                    [
                      "Other comprehensive income",
                      "—",
                      "—",
                      "—",
                      "7,959",
                      "—",
                      "7,959"
                    ],
                    [
                      "Net income",
                      "—",
                      "—",
                      "—",
                      "—",
                      "65,608",
                      "65,608"
                    ],
                    [
                      "Balance at March 31, 2025",
                      "254,590",
                      "$2",
                      "$5,483,821",
                      "$(42,092)",
                      "$5,026,509",
                      "$10,468,240"
                    ],
                    [
                      "Balance at January 1, 2024",
                      "242,048",
                      "$2",
                      "$4,491,571",
                      "$(30,270)",
                      "$1,820,346",
                      "$6,281,649"
                    ],
                    [
                      "Cumulative-effect adjustment due to the adoption of Accounting Standards Update 2023-08, net of tax",
                      "—",
                      "—",
                      "—",
                      "—",
                      "561,489",
                      "561,489"
                    ],
                    [
                      "Issuance of common stock upon settlement of stock awards, net of shares withheld",
                      "999",
                      "—",
                      "(117,225)",
                      "—",
                      "—",
                      "(117,225)"
                    ],
                    [
                      "Issuance of common stock upon exercise of stock options, net of repurchases",
                      "2,324",
                      "—",
                      "44,603",
                      "—",
                      "—",
                      "44,603"
                    ],
                    [
                      "Stock-based compensation (inclusive of capitalized stock-based compensation)",
                      "—",
                      "—",
                      "235,569",
                      "—",
                      "—",
                      "235,569"
                    ],
                    [
                      "Purchases of capped calls",
                      "—",
                      "—",
                      "(104,110)",
                      "—",
                      "—",
                      "(104,110)"
                    ],
                    [
                      "Other comprehensive loss",
                      "—",
                      "—",
                      "—",
                      "(7,226)",
                      "—",
                      "(7,226)"
                    ],
                    [
                      "Net income",
                      "—",
                      "—",
                      "—",
                      "—",
                      "1,176,245",
                      "1,176,245"
                    ],
                    [
                      "Balance at March 31, 2024",
                      "245,371",
                      "$2",
                      "$4,550,408",
                      "$(37,496)",
                      "$3,558,080",
                      "$8,070,994"
                    ]
                  ]
                },
                "113": {
                  "title": "The accompanying notes are an integral part of these Condensed Consolidated Financial Statements.",
                  "class": "predicted header"
                },
                "114": {
                  "title": "8",
                  "class": "predicted header",
                  "contents": {
                    "115": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "116": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "117": {
                  "title": "Condensed Consolidated Statements of Cash Flows",
                  "class": "predicted header"
                }
              }
            },
            "118": {
              "title": "(In thousands)",
              "class": "predicted header"
            },
            "119": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "120": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Cash flows from operating activities",
                      "",
                      ""
                    ],
                    [
                      "Net income",
                      "$65,608",
                      "$1,176,245"
                    ],
                    [
                      "Adjustments to reconcile net income to net cash (used in) provided by operating activities:",
                      "",
                      ""
                    ],
                    [
                      "Depreciation and amortization",
                      "33,333",
                      "29,327"
                    ],
                    [
                      "Stock-based compensation expense",
                      "190,729",
                      "224,504"
                    ],
                    [
                      "Deferred income taxes",
                      "(54,540)",
                      "214,361"
                    ],
                    [
                      "Losses (gains) on crypto assets held for operations, net",
                      "34,365",
                      "(86,358)"
                    ],
                    [
                      "Losses (gains) on crypto assets held for investment, net",
                      "596,651",
                      "(650,429)"
                    ],
                    [
                      "Other operating activities, net",
                      "77,629",
                      "(22,163)"
                    ],
                    [
                      "Net changes in operating assets and liabilities",
                      "(1,126,502)",
                      "(474,002)"
                    ],
                    [
                      "Net cash (used in) provided by operating activities",
                      "(182,727)",
                      "411,485"
                    ],
                    [
                      "Cash flows from investing activities",
                      "",
                      ""
                    ],
                    [
                      "Fiat loans originated",
                      "(277,922)",
                      "(416,405)"
                    ],
                    [
                      "Proceeds from repayment of fiat loans",
                      "248,055",
                      "254,600"
                    ],
                    [
                      "Purchase of crypto assets held for investment",
                      "(148,083)",
                      "(135)"
                    ],
                    [
                      "Dispositions of crypto assets held for investment",
                      "10,622",
                      "51,659"
                    ],
                    [
                      "Other investing activities, net",
                      "(64,325)",
                      "(15,400)"
                    ],
                    [
                      "Net cash used in investing activities",
                      "(231,653)",
                      "(125,681)"
                    ],
                    [
                      "Cash flows from financing activities",
                      "",
                      ""
                    ],
                    [
                      "Taxes paid related to net share settlement of equity awards",
                      "(100,303)",
                      "(117,225)"
                    ],
                    [
                      "Customer custodial fund liabilities",
                      "(818,487)",
                      "645,938"
                    ],
                    [
                      "Issuance of convertible senior notes, net",
                      "—",
                      "1,246,025"
                    ],
                    [
                      "Purchases of capped calls",
                      "—",
                      "(104,110)"
                    ],
                    [
                      "Fiat received as collateral",
                      "231,895",
                      "340,296"
                    ],
                    [
                      "Fiat received as collateral returned",
                      "(225,230)",
                      "(132,879)"
                    ],
                    [
                      "Other financing activities, net",
                      "18,323",
                      "49,676"
                    ],
                    [
                      "Net cash (used in) provided by financing activities",
                      "(893,802)",
                      "1,927,721"
                    ],
                    [
                      "Net (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents",
                      "(1,308,182)",
                      "2,213,525"
                    ],
                    [
                      "Effect of exchange rates on cash, cash equivalents, and restricted cash and cash equivalents",
                      "1,655",
                      "(21,186)"
                    ],
                    [
                      "Cash, cash equivalents, and restricted cash and cash equivalents, beginning of period",
                      "14,610,442",
                      "9,555,448"
                    ],
                    [
                      "Cash, cash equivalents, and restricted cash and cash equivalents, end of period",
                      "$13,303,915",
                      "$11,747,787"
                    ]
                  ]
                },
                "121": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Net revenue",
                      "",
                      ""
                    ],
                    [
                      "Transaction revenue",
                      "",
                      ""
                    ],
                    [
                      "Consumer, net",
                      "$1,095,506",
                      "$935,212"
                    ],
                    [
                      "Institutional, net",
                      "98,888",
                      "85,392"
                    ],
                    [
                      "Other transaction revenue, net",
                      "67,814",
                      "56,137"
                    ],
                    [
                      "Total transaction revenue",
                      "1,262,208",
                      "1,076,741"
                    ],
                    [
                      "Subscription and services revenue",
                      "",
                      ""
                    ],
                    [
                      "Stablecoin revenue(1)",
                      "297,535",
                      "197,317"
                    ],
                    [
                      "Blockchain rewards",
                      "196,592",
                      "150,929"
                    ],
                    [
                      "Interest and finance fee income(2)",
                      "63,086",
                      "66,663"
                    ],
                    [
                      "Other subscription and services revenue",
                      "140,898",
                      "96,027"
                    ],
                    [
                      "Total subscription and services revenue",
                      "698,111",
                      "510,936"
                    ],
                    [
                      "Total net revenue",
                      "1,960,319",
                      "1,587,677"
                    ],
                    [
                      "Other revenue",
                      "",
                      ""
                    ],
                    [
                      "Corporate interest and other income(1)",
                      "73,976",
                      "49,893"
                    ],
                    [
                      "Total other revenue",
                      "73,976",
                      "49,893"
                    ],
                    [
                      "Total revenue",
                      "$2,034,295",
                      "$1,637,570"
                    ]
                  ]
                },
                "122": {
                  "textsmall": "__________________"
                },
                "123": {
                  "textsmall": "(1)Amounts represent revenue that is not accounted for as revenue from contracts with customers, as defined in Accounting Standards Codification (“ASC”) 606, Revenue from Contracts with Customers (“ASC 606”)."
                },
                "124": {
                  "textsmall": "(2)Amounts primarily represent revenue that is not accounted for as revenue from contracts with customers, as well as an immaterial amount of finance fee income in all periods presented that is accounted for as revenue from contracts with customers."
                },
                "125": {
                  "title": "11",
                  "class": "predicted header",
                  "contents": {
                    "126": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "127": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "128": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "129": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "130": {
                  "text": "During the three months ended March 31, 2025 and 2024, one counterparty accounted for more than 10% of total revenue in each period."
                },
                "131": {
                  "title": "Revenue by geographic location",
                  "class": "predicted header",
                  "contents": {
                    "132": {
                      "text": "The following table presents revenue disaggregated by geography based on domiciles of the customer or other counterparty (in thousands):"
                    },
                    "133": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "U.S.(1)",
                          "$1,705,652",
                          "$1,353,450"
                        ],
                        [
                          "International(2)",
                          "328,643",
                          "284,120"
                        ],
                        [
                          "Total revenue",
                          "$2,034,295",
                          "$1,637,570"
                        ]
                      ]
                    },
                    "134": {
                      "textsmall": "__________________"
                    },
                    "135": {
                      "textsmall": "(1)Nearly all revenue that is not accounted for as revenue from contracts with customers, as defined in ASC 606, is with counterparties in the U.S."
                    },
                    "136": {
                      "textsmall": "(2)No country accounted for more than 10% of Total revenue."
                    },
                    "137": {
                      "title": "4.          COLLATERALIZED ARRANGEMENTS AND FINANCING",
                      "class": "predicted header"
                    }
                  }
                },
                "138": {
                  "title": "Loans and related collateral",
                  "class": "predicted header",
                  "contents": {
                    "139": {
                      "text": "The following table summarizes the Company’s Prime Financing lending arrangements (in thousands):"
                    },
                    "140": {
                      "table": [
                        [
                          "",
                          "March 31,",
                          "December 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Loan receivables",
                          "",
                          ""
                        ],
                        [
                          "Fiat loan receivables",
                          "$393,046",
                          "$382,751"
                        ],
                        [
                          "Crypto asset loan receivables",
                          "41,853",
                          "92,619"
                        ],
                        [
                          "Fiat trade finance receivables",
                          "19,574",
                          "—"
                        ],
                        [
                          "Total loan receivables",
                          "$454,473",
                          "$475,370"
                        ],
                        [
                          "Customer loans not meeting recognition criteria",
                          "",
                          ""
                        ],
                        [
                          "USDC",
                          "$62,732",
                          "$168,795"
                        ]
                      ]
                    },
                    "141": {
                      "text": "As of March 31, 2025 and December 31, 2024, the Company had two counterparties each, who accounted for more than 10% of the Company’s recognized Loan receivables. As of both of these dates, the Company also had three counterparties each, who accounted for more than 10% of the Company’s customer loans that did not meet the recognition criteria."
                    },
                    "142": {
                      "text": "As of March 31, 2025 and December 31, 2024, the collateral requirements for all loans outstanding, including customer loans not meeting recognition criteria, ranged from 100% to 300% of the fair value of the loan. No allowance, write-offs, or recoveries were recognized against loan receivables or customer loans not meeting recognition criteria during the periods presented, and none of these loans were past due."
                    }
                  }
                },
                "143": {
                  "title": "12",
                  "class": "predicted header",
                  "contents": {
                    "144": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "145": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "146": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "147": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "148": {
                  "text": "The following table summarizes assets the Company holds and has recognized as collateral with a corresponding obligation to return the collateral to the borrower (in thousands, except units):"
                },
                "149": {
                  "table": [
                    [
                      "",
                      "March 31, 2025",
                      "March 31, 2025",
                      "March 31, 2025",
                      "December 31, 2024",
                      "December 31, 2024",
                      "December 31, 2024"
                    ],
                    [
                      "",
                      "Units",
                      "Cost Basis",
                      "Fair Value",
                      "Units",
                      "Cost Basis",
                      "Fair Value"
                    ],
                    [
                      "Fiat(1)",
                      "N/A",
                      "N/A",
                      "$31,306",
                      "N/A",
                      "N/A",
                      "$24,641"
                    ],
                    [
                      "Bitcoin",
                      "6,587",
                      "$419,448",
                      "542,555",
                      "6,918",
                      "$414,745",
                      "647,568"
                    ],
                    [
                      "Ethereum",
                      "30,280",
                      "89,060",
                      "54,993",
                      "33,130",
                      "98,787",
                      "111,445"
                    ],
                    [
                      "Other crypto assets(2)",
                      "—",
                      "—",
                      "—",
                      "nm",
                      "8,065",
                      "8,471"
                    ],
                    [
                      "Crypto assets held as collateral",
                      "",
                      "$508,508",
                      "597,548",
                      "",
                      "$521,597",
                      "767,484"
                    ],
                    [
                      "Total recognized held as collateral",
                      "",
                      "",
                      "$628,854",
                      "",
                      "",
                      "$792,125"
                    ]
                  ]
                },
                "150": {
                  "textsmall": "__________________"
                },
                "151": {
                  "textsmall": "nm - not meaningful"
                },
                "152": {
                  "textsmall": "(1)Fiat collateral held is recognized within Cash and cash equivalents in the Condensed Consolidated Balance Sheets. Cost basis and units are not required disclosure and are therefore labeled N/A."
                },
                "153": {
                  "textsmall": "(2)Includes various other crypto asset balances, none of which individually represented more than 5% of the fair value of total Crypto assets held as collateral."
                },
                "154": {
                  "text": "The following table summarizes assets the Company holds as collateral that it has not recognized as collateral nor as an obligation to return the collateral to the borrower (in thousands):"
                },
                "155": {
                  "table": [
                    [
                      "",
                      "March 31,",
                      "December 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Fiat",
                      "$43,397",
                      "$64,760"
                    ],
                    [
                      "USDC",
                      "55,151",
                      "45,222"
                    ],
                    [
                      "Crypto assets",
                      "146,200",
                      "178,619"
                    ],
                    [
                      "Total customer collateral not recognized as collateral",
                      "$244,748",
                      "$288,601"
                    ]
                  ]
                },
                "156": {
                  "title": "Borrowings and related collateral",
                  "class": "predicted header",
                  "contents": {
                    "157": {
                      "text": "The following table summarizes the units, cost basis, and fair value of Crypto assets borrowed and the associated Crypto asset borrowings (in thousands, except units):"
                    },
                    "158": {
                      "table": [
                        [
                          "",
                          "March 31, 2025",
                          "March 31, 2025",
                          "March 31, 2025",
                          "December 31, 2024",
                          "December 31, 2024",
                          "December 31, 2024"
                        ],
                        [
                          "",
                          "Units",
                          "Cost Basis",
                          "Fair Value",
                          "Units",
                          "Cost Basis",
                          "Fair Value"
                        ],
                        [
                          "Crypto assets borrowed",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Bitcoin",
                          "2,130",
                          "$196,907",
                          "$175,789",
                          "1,923",
                          "$191,986",
                          "$179,480"
                        ],
                        [
                          "Ethereum",
                          "22,725",
                          "74,058",
                          "41,405",
                          "17,413",
                          "65,213",
                          "57,989"
                        ],
                        [
                          "Other crypto assets(1)",
                          "nm",
                          "26,126",
                          "18,239",
                          "nm",
                          "18,701",
                          "23,583"
                        ],
                        [
                          "Total borrowed",
                          "",
                          "$297,091",
                          "$235,433",
                          "",
                          "$275,900",
                          "$261,052"
                        ],
                        [
                          "Crypto asset borrowings",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Bitcoin",
                          "2,200",
                          "$202,963",
                          "$181,538",
                          "2,178",
                          "$213,096",
                          "$203,370"
                        ],
                        [
                          "Ethereum",
                          "28,937",
                          "85,149",
                          "52,725",
                          "19,133",
                          "68,803",
                          "63,720"
                        ],
                        [
                          "Other crypto assets(1)",
                          "nm",
                          "46,393",
                          "38,345",
                          "nm",
                          "28,141",
                          "33,020"
                        ],
                        [
                          "Total borrowings",
                          "",
                          "$334,505",
                          "$272,608",
                          "",
                          "$310,040",
                          "$300,110"
                        ]
                      ]
                    },
                    "159": {
                      "textsmall": "__________________"
                    },
                    "160": {
                      "textsmall": "nm - not meaningful"
                    },
                    "161": {
                      "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 5% of the fair value of total Crypto assets borrowed or total Crypto asset borrowings, as applicable."
                    }
                  }
                },
                "162": {
                  "title": "13",
                  "class": "predicted header",
                  "contents": {
                    "163": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "164": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "165": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "166": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "167": {
                  "text": "As of March 31, 2025 and December 31, 2024, the weighted average annual fees on these borrowings were 2.6% and 2.4%, respectively."
                },
                "168": {
                  "text": "The fair value of the Company’s corporate assets pledged as collateral against Crypto asset borrowings consisted of the following (in thousands):"
                },
                "169": {
                  "table": [
                    [
                      "",
                      "March 31,",
                      "December 31,"
                    ],
                    [
                      "",
                      "2025",
                      "2024"
                    ],
                    [
                      "Assets pledged as collateral",
                      "Assets pledged as collateral",
                      "Assets pledged as collateral"
                    ],
                    [
                      "USDC",
                      "$—",
                      "$4,009"
                    ],
                    [
                      "Assets pledged as collateral not meeting derecognition criteria",
                      "Assets pledged as collateral not meeting derecognition criteria",
                      "Assets pledged as collateral not meeting derecognition criteria"
                    ],
                    [
                      "USDC",
                      "$300,897",
                      "$329,832"
                    ]
                  ]
                },
                "170": {
                  "title": "5.          CRYPTO ASSETS HELD FOR OPERATIONS",
                  "class": "predicted header",
                  "contents": {
                    "171": {
                      "text": "The following table summarizes Crypto assets held for operations (in thousands, except units):"
                    },
                    "172": {
                      "table": [
                        [
                          "",
                          "March 31, 2025",
                          "March 31, 2025",
                          "March 31, 2025",
                          "December 31, 2024",
                          "December 31, 2024",
                          "December 31, 2024"
                        ],
                        [
                          "",
                          "Units",
                          "Cost Basis",
                          "Fair Value",
                          "Units",
                          "Cost Basis",
                          "Fair Value"
                        ],
                        [
                          "Bitcoin",
                          "302",
                          "$28,280",
                          "$24,993",
                          "57",
                          "$7,814",
                          "$5,473"
                        ],
                        [
                          "Ethereum",
                          "9,058",
                          "15,186",
                          "16,518",
                          "8,142",
                          "21,843",
                          "27,122"
                        ],
                        [
                          "Solana",
                          "31,910",
                          "4,768",
                          "3,990",
                          "69,280",
                          "14,526",
                          "13,245"
                        ],
                        [
                          "Other crypto assets(1)",
                          "nm",
                          "31,657",
                          "21,984",
                          "nm",
                          "51,871",
                          "36,941"
                        ],
                        [
                          "Total held for operations",
                          "",
                          "$79,891",
                          "$67,485",
                          "",
                          "$96,054",
                          "$82,781"
                        ]
                      ]
                    },
                    "173": {
                      "textsmall": "__________________"
                    },
                    "174": {
                      "textsmall": "nm - not meaningful"
                    },
                    "175": {
                      "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 5% of the fair value of total Crypto assets held for operations."
                    }
                  }
                },
                "176": {
                  "title": "6.          ACCOUNTS RECEIVABLE, NET",
                  "class": "predicted header",
                  "contents": {
                    "177": {
                      "text": "Accounts receivable, net consisted of the following (in thousands):"
                    },
                    "178": {
                      "table": [
                        [
                          "",
                          "March 31,",
                          "December 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Stablecoin revenue receivable",
                          "$112,876",
                          "$85,983"
                        ],
                        [
                          "Customer fee revenue receivable",
                          "34,038",
                          "39,317"
                        ],
                        [
                          "Other accounts receivable",
                          "125,525",
                          "169,380"
                        ],
                        [
                          "Gross accounts receivable",
                          "272,439",
                          "294,680"
                        ],
                        [
                          "Less: allowance for doubtful accounts",
                          "(27,327)",
                          "(29,429)"
                        ],
                        [
                          "Total accounts receivable, net",
                          "$245,112",
                          "$265,251"
                        ]
                      ]
                    },
                    "179": {
                      "text": "As of both March 31, 2025 and December 31, 2024, one counterparty accounted for more than 10% of Accounts receivable, net."
                    }
                  }
                },
                "180": {
                  "title": "14",
                  "class": "predicted header",
                  "contents": {
                    "181": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "182": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "183": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "184": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "185": {
                  "title": "7.          CRYPTO ASSETS HELD FOR INVESTMENT",
                  "class": "predicted header",
                  "contents": {
                    "186": {
                      "text": "The following table summarizes Crypto assets held for investment (in thousands, except units):"
                    },
                    "187": {
                      "table": [
                        [
                          "",
                          "March 31, 2025",
                          "March 31, 2025",
                          "March 31, 2025",
                          "December 31, 2024",
                          "December 31, 2024",
                          "December 31, 2024"
                        ],
                        [
                          "",
                          "Units",
                          "Cost Basis",
                          "Fair Value",
                          "Units",
                          "Cost Basis",
                          "Fair Value"
                        ],
                        [
                          "Bitcoin",
                          "9,267",
                          "$518,365",
                          "$765,034",
                          "6,885",
                          "$272,164",
                          "$642,738"
                        ],
                        [
                          "Ethereum",
                          "137,334",
                          "314,167",
                          "250,229",
                          "115,700",
                          "260,674",
                          "385,314"
                        ],
                        [
                          "Other crypto assets(1)",
                          "nm",
                          "406,727",
                          "252,738",
                          "nm",
                          "347,827",
                          "524,943"
                        ],
                        [
                          "Total held for investment",
                          "",
                          "$1,239,259",
                          "$1,268,001",
                          "",
                          "$880,665",
                          "$1,552,995"
                        ]
                      ]
                    },
                    "188": {
                      "textsmall": "__________________"
                    },
                    "189": {
                      "textsmall": "nm - not meaningful"
                    },
                    "190": {
                      "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 5% of the fair value of total Crypto assets held for investment."
                    },
                    "191": {
                      "text": "As of March 31, 2025, the Company had $47.7 million of Crypto assets held for investment subject to selling restrictions that are time-based and lift between 2025 and 2029."
                    }
                  }
                },
                "192": {
                  "title": "8.        LONG-TERM DEBT",
                  "class": "predicted header",
                  "contents": {
                    "193": {
                      "text": "The components of Long-term debt were as follows (in thousands, except percentages):"
                    },
                    "194": {
                      "table": [
                        [
                          "",
                          "Effective Interest Rate",
                          "Effective Interest Rate",
                          "Principal Amount",
                          "Unamortized  Debt Discount and Issuance Costs",
                          "Net Carrying Amount",
                          "Fair Value(1)"
                        ],
                        [
                          "March 31, 2025",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "0.50% 2026 Convertible Notes due June 1, 2026",
                          "0.98",
                          "0.98%",
                          "$1,273,013",
                          "$(7,924)",
                          "$1,265,089",
                          "$1,248,189"
                        ],
                        [
                          "3.38% 2028 Senior Notes due October 1, 2028",
                          "3.57",
                          "3.57%",
                          "1,000,000",
                          "(6,138)",
                          "993,862",
                          "906,300"
                        ],
                        [
                          "0.25% 2030 Convertible Notes due April 1, 2030",
                          "0.55",
                          "0.55%",
                          "1,265,000",
                          "(18,415)",
                          "1,246,585",
                          "1,170,252"
                        ],
                        [
                          "3.63% 2031 Senior Notes due October 1, 2031",
                          "3.77",
                          "3.77%",
                          "737,457",
                          "(5,903)",
                          "731,554",
                          "623,151"
                        ],
                        [
                          "Total",
                          "",
                          "",
                          "$4,275,470",
                          "$(38,380)",
                          "$4,237,090",
                          "$3,947,892"
                        ],
                        [
                          "December 31, 2024",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "0.50% 2026 Convertible Notes due June 1, 2026",
                          "0.98",
                          "0.98%",
                          "$1,273,013",
                          "$(9,395)",
                          "$1,263,618",
                          "$1,331,062"
                        ],
                        [
                          "3.38% 2028 Senior Notes due October 1, 2028",
                          "3.57",
                          "3.57%",
                          "1,000,000",
                          "(6,562)",
                          "993,438",
                          "901,250"
                        ],
                        [
                          "0.25% 2030 Convertible Notes due April 1, 2030",
                          "0.55",
                          "0.55%",
                          "1,265,000",
                          "(19,322)",
                          "1,245,678",
                          "1,353,044"
                        ],
                        [
                          "3.63% 2031 Senior Notes due October 1, 2031",
                          "3.77",
                          "3.77%",
                          "737,457",
                          "(6,110)",
                          "731,347",
                          "624,995"
                        ],
                        [
                          "Total",
                          "",
                          "",
                          "$4,275,470",
                          "$(41,389)",
                          "$4,234,081",
                          "$4,210,351"
                        ]
                      ]
                    },
                    "195": {
                      "textsmall": "__________________"
                    },
                    "196": {
                      "textsmall": "(1)Fair values are based on quoted prices for these instruments in markets that are not active and other market observable inputs, which are considered Level 2 valuation inputs."
                    }
                  }
                },
                "197": {
                  "title": "9.        DERIVATIVES",
                  "class": "predicted header",
                  "contents": {
                    "198": {
                      "text": "During the periods presented, the Company’s derivatives were all embedded forward contracts to receive or deliver a fixed amount of crypto assets in the future and none were designated as hedging instruments."
                    }
                  }
                },
                "199": {
                  "title": "15",
                  "class": "predicted header",
                  "contents": {
                    "200": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "201": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "202": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "203": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "204": {
                  "title": "Impact of derivatives on the Condensed Consolidated Balance Sheets",
                  "class": "predicted header",
                  "contents": {
                    "205": {
                      "text": "The following table summarizes information on derivative instruments by their location in the Condensed Consolidated Balance Sheets, as measured in U.S. dollar equivalents (in thousands):"
                    },
                    "206": {
                      "table": [
                        [
                          "",
                          "",
                          "Embedded Derivative",
                          "Embedded Derivative",
                          ""
                        ],
                        [
                          "",
                          "Host",
                          "Gross Derivative Assets",
                          "Gross Derivative Liabilities",
                          "Aggregate Carrying Value"
                        ],
                        [
                          "March 31, 2025",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Accounts receivable, net(1)",
                          "$28,814",
                          "$38,984",
                          "$4,299",
                          "$63,499"
                        ],
                        [
                          "Crypto asset borrowings",
                          "334,506",
                          "63,552",
                          "1,654",
                          "272,608"
                        ],
                        [
                          "Obligation to return collateral(1)",
                          "508,508",
                          "48,856",
                          "137,896",
                          "597,548"
                        ],
                        [
                          "Accrued expenses and other current liabilities(1)",
                          "25,100",
                          "7,652",
                          "2,312",
                          "19,760"
                        ],
                        [
                          "Total fair value of derivatives",
                          "",
                          "$159,044",
                          "$146,161",
                          ""
                        ],
                        [
                          "December 31, 2024",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Accounts receivable, net(1)",
                          "$16,264",
                          "$20,368",
                          "$1,811",
                          "$34,821"
                        ],
                        [
                          "Other current assets(1)",
                          "99,265",
                          "61,304",
                          "—",
                          "160,569"
                        ],
                        [
                          "Crypto asset borrowings",
                          "310,040",
                          "18,030",
                          "8,100",
                          "300,110"
                        ],
                        [
                          "Obligation to return collateral(1)",
                          "526,337",
                          "2,149",
                          "243,296",
                          "767,484"
                        ],
                        [
                          "Accrued expenses and other current liabilities(1)",
                          "37,428",
                          "6,814",
                          "2,708",
                          "33,322"
                        ],
                        [
                          "Total fair value of derivatives",
                          "",
                          "$108,665",
                          "$255,915",
                          ""
                        ]
                      ]
                    },
                    "207": {
                      "textsmall": "__________________"
                    },
                    "208": {
                      "textsmall": "(1)Represents the portion of the Condensed Consolidated Balance Sheets line item that is denominated in crypto assets."
                    }
                  }
                },
                "209": {
                  "title": "Impact of derivatives on the Condensed Consolidated Statements of Operations",
                  "class": "predicted header",
                  "contents": {
                    "210": {
                      "text": "Gains (losses) on derivative instruments recognized in the Condensed Consolidated Statements of Operations were as follows (in thousands):"
                    },
                    "211": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Crypto asset borrowings(1)",
                          "$51,968",
                          "$(95,914)"
                        ],
                        [
                          "Obligation to return collateral(1)",
                          "152,106",
                          "(117,266)"
                        ],
                        [
                          "Other(2)",
                          "(15,249)",
                          "12,074"
                        ],
                        [
                          "Total",
                          "$188,825",
                          "$(201,106)"
                        ]
                      ]
                    },
                    "212": {
                      "textsmall": "__________________"
                    },
                    "213": {
                      "textsmall": "(1)Changes in fair value are recognized in Transaction expense in the Condensed Consolidated Statements of Operations. The impact of changes in fair value of Crypto asset borrowings and Obligation to return collateral derivatives is naturally offset, at least in part, by the impact of changes in fair value of the associated naturally offsetting positions, which are also recognized in Transaction expense."
                    },
                    "214": {
                      "textsmall": "(2)Changes in fair value are recognized in Other operating (income) expense, net or Other expense (income), net in the Condensed Consolidated Statements of Operations depending on the nature of the derivative."
                    }
                  }
                },
                "215": {
                  "title": "16",
                  "class": "predicted header",
                  "contents": {
                    "216": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "217": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "218": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "219": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "220": {
                  "title": "10.        OTHER CONDENSED CONSOLIDATED BALANCE SHEETS DETAILS",
                  "class": "predicted header",
                  "contents": {
                    "221": {
                      "text": "The following table presents certain other details of the Condensed Consolidated Balance Sheets (in thousands):"
                    },
                    "222": {
                      "table": [
                        [
                          "",
                          "March 31,",
                          "December 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Other current assets",
                          "",
                          ""
                        ],
                        [
                          "Prepaid expenses",
                          "$109,562",
                          "$88,500"
                        ],
                        [
                          "Income taxes receivable",
                          "5,762",
                          "5,530"
                        ],
                        [
                          "Other",
                          "36,653",
                          "183,506"
                        ],
                        [
                          "Total other current assets",
                          "$151,977",
                          "$277,536"
                        ],
                        [
                          "Other non-current assets",
                          "",
                          ""
                        ],
                        [
                          "Strategic investments",
                          "$417,259",
                          "$374,161"
                        ],
                        [
                          "Software and equipment, net",
                          "218,445",
                          "200,080"
                        ],
                        [
                          "Intangible assets, net",
                          "46,599",
                          "46,804"
                        ],
                        [
                          "Income taxes receivable",
                          "60,554",
                          "60,004"
                        ],
                        [
                          "Lease right-of-use (“ROU”) assets",
                          "83,660",
                          "81,151"
                        ],
                        [
                          "Other",
                          "33,550",
                          "33,135"
                        ],
                        [
                          "Total other non-current assets",
                          "$860,067",
                          "$795,335"
                        ],
                        [
                          "Accrued expenses and other current liabilities",
                          "",
                          ""
                        ],
                        [
                          "Accrued payroll and payroll related expenses",
                          "$98,635",
                          "$186,151"
                        ],
                        [
                          "Other accrued expenses",
                          "223,019",
                          "145,369"
                        ],
                        [
                          "Accounts payable",
                          "62,515",
                          "63,316"
                        ],
                        [
                          "Income taxes payable",
                          "127,597",
                          "90,910"
                        ],
                        [
                          "Other payables",
                          "150,276",
                          "204,390"
                        ],
                        [
                          "Total accrued expenses and other current liabilities",
                          "$662,042",
                          "$690,136"
                        ],
                        [
                          "Other non-current liabilities",
                          "",
                          ""
                        ],
                        [
                          "Lease liabilities",
                          "$85,050",
                          "$85,789"
                        ],
                        [
                          "Other",
                          "7,257",
                          "3,919"
                        ],
                        [
                          "Total other non-current liabilities",
                          "$92,307",
                          "$89,708"
                        ]
                      ]
                    }
                  }
                },
                "223": {
                  "title": "17",
                  "class": "predicted header",
                  "contents": {
                    "224": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "225": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "226": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "227": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "228": {
                  "title": "11.        FAIR VALUE MEASUREMENTS",
                  "class": "predicted header",
                  "contents": {
                    "229": {
                      "text": "The following table sets forth by level within the fair value hierarchy, the Company’s assets and liabilities measured and recorded at fair value on a recurring basis (in thousands):"
                    },
                    "230": {
                      "table": [
                        [
                          "",
                          "March 31, 2025",
                          "March 31, 2025",
                          "December 31, 2024",
                          "December 31, 2024"
                        ],
                        [
                          "",
                          "Level 1",
                          "Level 2",
                          "Level 1",
                          "Level 2"
                        ],
                        [
                          "Assets",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Cash equivalents(1)",
                          "$6,153,826",
                          "$—",
                          "$6,607,023",
                          "$—"
                        ],
                        [
                          "Restricted cash equivalents(2)",
                          "2,802",
                          "—",
                          "1,415",
                          "—"
                        ],
                        [
                          "Customer custodial funds(3)",
                          "3,359,413",
                          "—",
                          "4,269,410",
                          "—"
                        ],
                        [
                          "Crypto assets held for operations",
                          "67,485",
                          "—",
                          "82,781",
                          "—"
                        ],
                        [
                          "Crypto asset loan receivables",
                          "—",
                          "41,853",
                          "—",
                          "92,619"
                        ],
                        [
                          "Crypto assets held as collateral",
                          "597,548",
                          "—",
                          "767,484",
                          "—"
                        ],
                        [
                          "Crypto assets borrowed",
                          "235,433",
                          "—",
                          "261,052",
                          "—"
                        ],
                        [
                          "Crypto assets held for investment",
                          "1,268,001",
                          "—",
                          "1,552,995",
                          "—"
                        ],
                        [
                          "Derivative assets(4)",
                          "—",
                          "159,044",
                          "—",
                          "108,665"
                        ],
                        [
                          "Total assets",
                          "$11,684,508",
                          "$200,897",
                          "$13,542,160",
                          "$201,284"
                        ],
                        [
                          "Liabilities",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Derivative liabilities(4)",
                          "$—",
                          "$146,161",
                          "$—",
                          "$255,915"
                        ]
                      ]
                    },
                    "231": {
                      "table": [
                        [
                          "",
                          "",
                          "Weighted-Average",
                          "Weighted-Average",
                          ""
                        ],
                        [
                          "",
                          "Options Outstanding",
                          "Exercise Price Per Share",
                          "Remaining Contractual Life (Years)",
                          "Aggregate Intrinsic Value"
                        ],
                        [
                          "Balance at January 1, 2025",
                          "22,929",
                          "$25.59",
                          "5.2",
                          "$5,106,538"
                        ],
                        [
                          "Exercised",
                          "(396)",
                          "26.57",
                          "",
                          ""
                        ],
                        [
                          "Forfeited and cancelled",
                          "(34)",
                          "113.11",
                          "",
                          ""
                        ],
                        [
                          "Balance at March 31, 2025",
                          "22,499",
                          "$25.44",
                          "5.0",
                          "$3,320,324"
                        ],
                        [
                          "Exercisable at March 31, 2025",
                          "17,592",
                          "$25.99",
                          "4.9",
                          "$2,590,282"
                        ],
                        [
                          "Vested and expected to vest at March 31, 2025",
                          "17,592",
                          "$25.99",
                          "4.9",
                          "$2,590,282"
                        ]
                      ]
                    },
                    "232": {
                      "text": "As of March 31, 2025, there was total unrecognized compensation cost of $17.3 million related to unvested stock options, which cost is expected to be recognized over a weighted-average period of 2.6 years."
                    },
                    "233": {
                      "title": "Other awards",
                      "class": "predicted header",
                      "contents": {
                        "234": {
                          "text": "A summary of restricted stock units, performance restricted stock units, and restricted stock (“Other Awards”) activity is as follows (in thousands, except per share data):"
                        },
                        "235": {
                          "table": [
                            [
                              "",
                              "Restricted Stock Units",
                              "Restricted Stock Units",
                              "Performance Restricted Stock Units",
                              "Performance Restricted Stock Units",
                              "Restricted Stock",
                              "Restricted Stock"
                            ],
                            [
                              "",
                              "Number of Shares",
                              "Fair Value(1)",
                              "Number of Shares",
                              "Fair Value(1)",
                              "Number of Shares",
                              "Fair Value(1)"
                            ],
                            [
                              "Balance at January 1, 2025",
                              "2,350",
                              "$163.82",
                              "724",
                              "$55.42",
                              "340",
                              "$98.49"
                            ],
                            [
                              "Granted",
                              "3,062",
                              "268.16",
                              "—",
                              "—",
                              "—",
                              "—"
                            ],
                            [
                              "Vested",
                              "(847)",
                              "201.77",
                              "(81)",
                              "55.42",
                              "(235)",
                              "113.75"
                            ],
                            [
                              "Forfeited and cancelled",
                              "(166)",
                              "205.56",
                              "—",
                              "—",
                              "—",
                              "—"
                            ],
                            [
                              "Balance at March 31, 2025",
                              "4,399",
                              "$227.56",
                              "643",
                              "$55.42",
                              "105",
                              "$64.51"
                            ]
                          ]
                        },
                        "236": {
                          "textsmall": "__________________"
                        },
                        "237": {
                          "textsmall": "(1)Represents the weighted-average grant date fair value per share."
                        }
                      }
                    }
                  }
                },
                "238": {
                  "title": "19",
                  "class": "predicted header",
                  "contents": {
                    "239": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "240": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "241": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "242": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "243": {
                  "text": "As of March 31, 2025, there was unrecognized compensation cost related to Other Awards as follows (in thousands, except years data):"
                },
                "244": {
                  "table": [
                    [
                      "",
                      "Unrecognized Compensation",
                      "Weighted-Average Recognition Period (Years)"
                    ],
                    [
                      "Restricted stock units",
                      "$905,359",
                      "1.5"
                    ],
                    [
                      "Performance restricted stock units",
                      "$6,572",
                      "0.8"
                    ],
                    [
                      "Restricted stock",
                      "$5,219",
                      "0.9"
                    ]
                  ]
                },
                "245": {
                  "title": "Stock-based compensation",
                  "class": "predicted header",
                  "contents": {
                    "246": {
                      "text": "The effects of stock-based compensation on the Condensed Consolidated Statements of Operations and Condensed Consolidated Balance Sheets are as follows (in thousands):"
                    },
                    "247": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Statements of Operations",
                          "",
                          ""
                        ],
                        [
                          "Technology and development",
                          "$108,092",
                          "$139,830"
                        ],
                        [
                          "Sales and marketing",
                          "14,905",
                          "16,623"
                        ],
                        [
                          "General and administrative",
                          "67,732",
                          "68,051"
                        ],
                        [
                          "Total stock-based compensation expense",
                          "$190,729",
                          "$224,504"
                        ],
                        [
                          "Balance Sheets",
                          "",
                          ""
                        ],
                        [
                          "Other non-current assets(1)",
                          "$16,565",
                          "$11,065"
                        ]
                      ]
                    },
                    "248": {
                      "textsmall": "_______________"
                    },
                    "249": {
                      "textsmall": "(1)Represents capitalized stock-based compensation that is recognized in Software and equipment, net and presented within this financial statement line item. See Note 10. Other Condensed Consolidated Balance Sheets Details for additional details."
                    },
                    "250": {
                      "title": "13.        OTHER EXPENSE (INCOME), NET",
                      "class": "predicted header",
                      "contents": {
                        "251": {
                          "text": "Other expense (income), net consisted of the following (in thousands):"
                        },
                        "252": {
                          "table": [
                            [
                              "",
                              "Three Months Ended March 31,",
                              "Three Months Ended March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "Losses (gains) on other financial instruments, net",
                              "21,683",
                              "(13,186)"
                            ],
                            [
                              "Losses (gains) on crypto asset loan receivables, net",
                              "2,853",
                              "(25,526)"
                            ],
                            [
                              "Other",
                              "(18,348)",
                              "(6,893)"
                            ],
                            [
                              "Total other expense (income), net",
                              "$6,188",
                              "$(45,605)"
                            ]
                          ]
                        }
                      }
                    },
                    "253": {
                      "title": "14.        INCOME TAXES",
                      "class": "predicted header",
                      "contents": {
                        "254": {
                          "text": "For the three months ended March 31, 2025 and 2024, the Company calculated the tax provision using a discrete effective tax rate method. The Company’s effective tax rate (“ETR”) for the three months ended March 31, 2025 and 2024 was 20.4% and 18.2%, respectively. The ETR of 20.4% for the three months ended March 31, 2025 was lower than the U.S. statutory rate of 21.0%, primarily due to the Company’s deductible stock-based compensation, mostly offset by non-deductible expenses, state tax, and tax on foreign operations."
                        },
                        "255": {
                          "text": "As of March 31, 2025, the Company had a net deferred tax asset balance of $995.5 million, compared to $941.3 million as of December 31, 2024. As of each reporting date, management considers new evidence, both positive and negative, that could affect its view of the future realization of deferred tax assets. Management determined that there is sufficient positive evidence to conclude that it is more likely than not that the Company’s net deferred tax asset will be fully realized."
                        }
                      }
                    }
                  }
                },
                "256": {
                  "title": "20",
                  "class": "predicted header",
                  "contents": {
                    "257": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "258": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "259": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "260": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "261": {
                  "title": "15.        NET INCOME PER SHARE",
                  "class": "predicted header",
                  "contents": {
                    "262": {
                      "text": "The computation of Net income per share, including the weighted-average shares outstanding (“WASO”) used in the computation, is as follows (in thousands, except per share amounts):"
                    },
                    "263": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Numerators",
                          "",
                          ""
                        ],
                        [
                          "Net income",
                          "$65,608",
                          "$1,176,245"
                        ],
                        [
                          "Less: Net income allocated to participating shares",
                          "—",
                          "(766)"
                        ],
                        [
                          "Net income attributable to common stockholders, basic",
                          "$65,608",
                          "$1,175,479"
                        ],
                        [
                          "Net income",
                          "$65,608",
                          "$1,176,245"
                        ],
                        [
                          "Add: Interest on convertible notes, net of tax",
                          "—",
                          "2,531"
                        ],
                        [
                          "Less: Net income allocated to participating shares",
                          "—",
                          "(697)"
                        ],
                        [
                          "Net income attributable to common stockholders, diluted",
                          "$65,608",
                          "$1,178,079"
                        ],
                        [
                          "Denominators",
                          "",
                          ""
                        ],
                        [
                          "WASO - basic",
                          "253,878",
                          "242,793"
                        ],
                        [
                          "Weighted-average effect of potentially dilutive shares:",
                          "",
                          ""
                        ],
                        [
                          "Stock options",
                          "15,823",
                          "18,534"
                        ],
                        [
                          "Restricted stock units",
                          "949",
                          "1,828"
                        ],
                        [
                          "Performance restricted stock units",
                          "380",
                          "336"
                        ],
                        [
                          "Restricted stock",
                          "221",
                          "309"
                        ],
                        [
                          "Convertible notes",
                          "—",
                          "4,145"
                        ],
                        [
                          "WASO - diluted",
                          "271,251",
                          "267,945"
                        ],
                        [
                          "Net income per share attributable to common stockholders:",
                          "",
                          ""
                        ],
                        [
                          "Basic",
                          "$0.26",
                          "$4.84"
                        ],
                        [
                          "Diluted",
                          "$0.24",
                          "$4.40"
                        ]
                      ]
                    },
                    "264": {
                      "text": "The rights, including the liquidation and dividend rights, of the holders of Class A common stock and Class B common stock are identical, except with respect to voting. As a result, the undistributed earnings are allocated on a proportionate basis and the resulting income or loss per share will, therefore, be the same for both Class A common stock and Class B common stock on an individual or combined basis."
                    },
                    "265": {
                      "text": "The following potentially dilutive shares were not included in the calculation of diluted shares outstanding as the effect would have been anti-dilutive (in thousands):"
                    },
                    "266": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2024"
                        ],
                        [
                          "Stock-based compensation awards(1)",
                          "8,088",
                          "8,260"
                        ],
                        [
                          "Convertible notes",
                          "7,229",
                          "—"
                        ],
                        [
                          "Total",
                          "15,317",
                          "8,260"
                        ]
                      ]
                    },
                    "267": {
                      "textsmall": "__________________"
                    },
                    "268": {
                      "textsmall": "(1)Includes shares under the ESPP."
                    }
                  }
                },
                "269": {
                  "title": "16.        COMMITMENTS AND CONTINGENCIES",
                  "class": "predicted header"
                },
                "270": {
                  "title": "Crypto assets and USDC on platform",
                  "class": "predicted header",
                  "contents": {
                    "271": {
                      "text": "The Company is obligated to securely store all crypto assets and USDC that it holds in custodial products on behalf of customers. As such, the Company may be liable to its users for losses arising from"
                    }
                  }
                },
                "272": {
                  "title": "21",
                  "class": "predicted header",
                  "contents": {
                    "273": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "274": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "275": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "276": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "277": {
                  "text": "the Company’s failure to secure these assets from theft or loss. The Company has not incurred any losses related to such obligations and therefore has not accrued any liabilities as of each March 31, 2025 and December 31, 2024. The Company holds crypto assets and USDC in custodial products on its platform on behalf of its customers totaling $327.5 billion and $404.0 billion at fair value at March 31, 2025 and December 31, 2024, respectively. These assets are not recognized in the Condensed Consolidated Balance Sheets. Similarly, as the Company has an obligation to securely store all of these assets, it has a corresponding unrecognized liability of $327.5 billion and $404.0 billion at March 31, 2025 and December 31, 2024, respectively. Since the risk of loss is remote, the Company did not recognize a contingent liability at March 31, 2025 or December 31, 2024. The Company has no reason to believe it will incur any expense associated with such potential liability because (i) it has no known or historical experience of claims to use as a basis of measurement, (ii) it accounts for and continually verifies the amount of crypto assets within its control, and (iii) it has established security around custodial product private keys to minimize the risk of theft or loss."
                },
                "278": {
                  "title": "Indemnifications",
                  "class": "predicted header",
                  "contents": {
                    "279": {
                      "text": "In the event any registrable securities are included in a registration statement, the Company’s Amended and Restated Investors’ Rights Agreement (the “IRA”) entered into with certain of the Company’s stockholders provides indemnity to each stockholder, their partners, members, officers, directors, and stockholders and certain of their advisors; each underwriter, if any; and each person who controls each stockholder or underwriter, against any damages incurred in connection with investigating or defending any claim or proceeding arising as a result of such registration from which damages may result. The Company will reimburse each such party for any legal and any other expenses reasonably incurred, provided that the Company will not be liable in any such case to the extent the damages arise out of or are based upon any actions or omissions made in reliance upon and in conformity with written information furnished by or on behalf of such stockholder or underwriter and stated to be specifically for use therein."
                    },
                    "280": {
                      "text": "The Company also has indemnity agreements with certain officers and directors of the Company pursuant to which the Company must indemnify the officer or director against all expenses, judgments, fines, and amounts paid in settlement reasonably incurred in connection with a third party proceeding, if the indemnitee acted in good faith and in a manner reasonably believed to be in or not opposed to the best interests of the Company, and in the case of a criminal proceeding, had no reasonable cause to believe the indemnitee’s conduct was unlawful."
                    },
                    "281": {
                      "text": "It is not possible to determine the maximum potential exposure under these indemnification agreements: (i) because the facts and circumstances involved in each claim are unique and the Company cannot predict the number or nature of claims that may be made; (ii) due to the unique facts and circumstances involved in each particular agreement; and (iii) due to the requirement for a registration of the Company’s securities before any of the indemnification obligations contemplated in the IRA become effective."
                    },
                    "282": {
                      "text": "The Company has also provided indemnities or similar commitments on standard commercial terms in the ordinary course of business."
                    }
                  }
                },
                "283": {
                  "title": "Legal and regulatory proceedings",
                  "class": "predicted header",
                  "contents": {
                    "284": {
                      "text": "The Company is subject to various litigation, regulatory investigations, and other legal proceedings that arise in the ordinary course of its business. The Company is also subject to regulatory oversight by numerous regulatory and other governmental agencies, including at the federal and state levels and internationally. The Company reviews its lawsuits, regulatory investigations, and other legal proceedings on an ongoing basis and provides disclosure and recognizes loss contingencies in accordance with the loss contingencies accounting guidance. In accordance with such guidance, the Company establishes accruals for such matters when potential losses become probable and can be reasonably estimated. If the"
                    }
                  }
                },
                "285": {
                  "title": "22",
                  "class": "predicted header",
                  "contents": {
                    "286": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "287": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "288": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "289": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "290": {
                  "text": "Company determines that a loss is reasonably possible and the loss or range of loss can be estimated, the Company discloses the possible loss in the Condensed Consolidated Financial Statements."
                },
                "291": {
                  "text": "In July and August 2021, three purported securities class actions were filed in the U.S. District Court for the Northern District of California against the Company, its directors, certain of its officers and employees, and certain venture capital and investment firms. The complaints alleged violations of Sections 11, 12(a)(2) and 15 of the Securities Act, in connection with the registration statement and prospectus filed in connection with the Direct Listing. In November 2021, these actions were consolidated and recaptioned as In re Coinbase Global Securities Litigation, and an amended complaint was filed. The plaintiff sought, among other relief, unspecified compensatory damages, attorneys’ fees, and costs. The Company disputed the claims and vigorously defended against them. In March 2025, the plaintiff voluntarily dismissed this action and the court entered an order closing the case. The resolution of this action did not have a material impact on the Company’s business and financial statements. The Company has subsequently received, and expects to receive in the future, similar shareholder claims."
                },
                "292": {
                  "text": "In October 2021, a purported class action captioned Underwood et al. v. Coinbase Global, Inc., was filed in the U.S. District Court for the Southern District of New York (the “District Court”) against the Company alleging claims under Sections 5, 15(a)(1) and 29(b) of the Exchange Act, and violations of certain California and Florida state statutes. On March 11, 2022, plaintiffs filed an amended complaint adding Coinbase, Inc. and Brian Armstrong as defendants and adding causes of action, including alleging claims under Sections 5, 12(a)(1) and 15 of the Securities Act and violations of certain New Jersey state statutes. Among other relief requested, the plaintiffs sought injunctive relief, unspecified damages, attorneys’ fees and costs. On February 1, 2023, the District Court dismissed all federal claims (with prejudice) and state law claims (without prejudice) against Coinbase Global, Inc., Coinbase, Inc. and Brian Armstrong. Subsequently, on February 9, 2023, the plaintiffs appealed that ruling to the U.S. Court of Appeals for the Second Circuit (the “Court of Appeals”), and the parties completed briefing the appeal on September 13, 2023. Oral argument took place on February 1, 2024 and on April 5, 2024, the Court of Appeals issued a Summary Order affirming the District Court’s dismissal order with respect to the claims alleging violations of the Exchange Act, and reversing the District Court’s dismissal order with respect to the claims alleging violations of the Securities Act and violations of the state statutes. On June 27, 2024, defendants filed an answer to the amended complaint, and on July 29, 2024, the defendants filed a Motion for Judgment on the Pleadings requesting the District Court dismiss the remaining claims. On February 7, 2025, the District Court denied defendants’ Motion for Judgement on the Pleadings and allowed the case to proceed to bifurcated discovery, followed by summary judgment motions. The defendants continue to dispute the claims in this case and intend to vigorously defend against them. Based on the nature of the proceedings in this case, the outcome of this matter remains uncertain and the Company cannot estimate the potential impact, if any, on its business or financial statements at this time. The Company has subsequently received, and expects to receive in the future, similar class action claims."
                },
                "293": {
                  "text": "In December 2021, a shareholder derivative suit captioned Shin v. Coinbase Global, Inc., was filed in New York state court against the Company and its directors, alleging breach of fiduciary duties, unjust enrichment, abuse of control, gross mismanagement, and waste of corporate assets, and seeking unspecified damages and injunctive relief. The Company has subsequently received, and expects to receive in the future, similar derivative claims. The Company disputes the claims in these cases and intends to vigorously defend against them. Based on the preliminary nature of the proceedings in these cases, the outcome of these matters remain uncertain and the Company cannot estimate the potential impact, if any, on its business or financial statements at this time."
                },
                "294": {
                  "text": "In June 2023, the SEC filed a complaint in the District Court against the Company and Coinbase, Inc. alleging that Coinbase, Inc. acted as an unregistered securities exchange, broker, and clearing agency in violation of Sections 5, 15(a) and 17A(b) of the Exchange Act and that, through its staking program, Coinbase, Inc. offered and sold securities without registering its offers and sales in violation of Sections 5(a) and 5(c) of the Securities Act. The SEC also alleged that the Company is liable for the alleged violations as an alleged control person of Coinbase, Inc. The case was captioned SEC v. Coinbase, Inc. "
                },
                "295": {
                  "title": "23",
                  "class": "predicted header",
                  "contents": {
                    "296": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "297": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "298": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "299": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "300": {
                  "title": "et al. The SEC sought, among other relief, injunctive relief, disgorgement and civil money penalties. The Company and Coinbase, Inc. filed an answer to the SEC complaint in June 2023, disputed the claims in the case, and vigorously defended against them. On August 4, 2023, the Company and Coinbase, Inc. filed a motion for judgment on the pleadings. The SEC filed its response on October 3, 2023 and the Company and Coinbase, Inc. filed their reply on October 24, 2023. Oral argument took place on January 17, 2024. On March 27, 2024, the District Court denied in part the Company and Coinbase, Inc.’s motion for judgment on the pleadings with respect to the SEC’s claims that Coinbase, Inc. operated as an unregistered securities exchange, broker, and clearing agency and engaged in an unregistered offer and sale of securities through the Company’s staking program. The District Court dismissed the SEC’s claim that Coinbase, Inc. acted as an unregistered broker through its wallet service. On April 12, 2024, the Company and Coinbase, Inc. filed a motion with the District Court seeking certification of an interlocutory appeal to the Court of Appeals. The District Court granted that motion on January 7, 2025 and stayed proceedings in the District Court. On January 17, 2025, the Company and Coinbase, Inc. filed a petition for permission to appeal to the Court of Appeals. On February 28, 2025, the SEC and the Company and Coinbase, Inc. jointly stipulated to dismissal of SEC v. Coinbase, Inc. et al.",
                  "class": "predicted header",
                  "contents": {
                    "301": {
                      "text": " with prejudice. The case is now concluded. The resolution of the SEC’s lawsuit did not have a material impact on the Company’s business and financial statements."
                    },
                    "302": {
                      "text": "In June 2023, the Company and Coinbase, Inc. were issued notices, show-cause orders, and cease-and-desist letters, and became the subject of various legal actions initiated by U.S. state securities regulators in the states of Alabama, California, Illinois, Kentucky, Maryland, New Jersey, South Carolina, Vermont, Washington and Wisconsin alleging violations of state securities laws with respect to staking services provided by Coinbase, Inc. In July 2023, the Company and Coinbase, Inc. entered into agreements with state securities regulators in California, New Jersey, South Carolina and Wisconsin, pursuant to which customers in those states will no longer be able to stake new funds, in each case pending final adjudication of the matters. In October 2023, the Company and Coinbase, Inc. entered into a similar agreement with the Maryland state securities regulator. In March and April 2025, the Alabama, Kentucky, Illinois, South Carolina, and Vermont state securities regulators dismissed, vacated, rescinded, and/or withdrew their legal actions. The Company and Coinbase, Inc. dispute the claims of the state securities regulators and intend to vigorously defend against them. Based on the preliminary nature of these actions, the final outcome of these matters remains uncertain and the Company cannot estimate the potential impact on its business or financial statements at this time. An adverse resolution in these state matters could have a material impact on the Company’s business and financial statements."
                    },
                    "303": {
                      "text": "The Company has, from time to time, received investigative subpoenas and requests from regulators for documents and information, including about certain customer programs, operations, and existing and intended future products, including the Company’s processes for listing assets, the classification of certain listed assets, its staking programs, and its stablecoin and yield-generating products."
                    },
                    "304": {
                      "text": "Except as otherwise disclosed, the Company believes the ultimate resolution of existing legal and regulatory investigation matters will not have a material adverse effect on the financial condition, results of operations, or cash flows of the Company. However, in light of the uncertainties inherent in these matters, it is possible that the ultimate resolution of one or more of these matters may have a material adverse effect on the Company’s results of operations for a particular period, and future changes in circumstances or additional information could result in additional accruals or resolution in excess of established accruals, which could adversely affect the Company’s results of operations, potentially materially."
                    }
                  }
                },
                "305": {
                  "title": "Tax regulation",
                  "class": "predicted header",
                  "contents": {
                    "306": {
                      "text": "Current tax rules related to crypto assets are evolving and require significant judgments to be made in interpretation of the law, including but not limited to the areas of income tax, information reporting, value added taxes, digital services tax, transaction level taxes and the withholding of tax at source. Further, it is possible that additional legislation or guidance may be issued by U.S. and non-U.S. governing bodies that may differ significantly from the Company's practices or interpretation of the law, which could have unforeseen effects on the Company’s financial condition and results of operations, and accordingly, the"
                    }
                  }
                },
                "307": {
                  "title": "24",
                  "class": "predicted header",
                  "contents": {
                    "308": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "309": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header"
            },
            "310": {
              "title": "Notes to Condensed Consolidated Financial Statements",
              "class": "predicted header"
            },
            "311": {
              "title": "(unaudited)",
              "class": "predicted header",
              "contents": {
                "312": {
                  "text": "Company is unable to determine an estimate of the possible loss or range of loss beyond amounts already accrued. As a result, the Company may have exposure to additional tax liabilities that could have an adverse effect on the Company’s operating results and financial condition."
                },
                "313": {
                  "title": "17.        RELATED PARTY TRANSACTIONS",
                  "class": "predicted header"
                },
                "314": {
                  "title": "Revenue and Accounts receivable, net",
                  "class": "predicted header",
                  "contents": {
                    "315": {
                      "text": "Certain of the Company’s directors, executive officers, and principal owners, including immediate family members, are users of the Company’s platform. The Company recognized revenue from related party customers of $3.6 million and $6.9 million during the three months ended March 31, 2025 and 2024, respectively. As of March 31, 2025 and December 31, 2024, Accounts receivable, net from related party customers were $1.4 million and $2.7 million, respectively."
                    }
                  }
                },
                "316": {
                  "title": "Customer custodial funds and liabilities",
                  "class": "predicted header",
                  "contents": {
                    "317": {
                      "text": "Customer custodial funds and Customer custodial fund liabilities for related parties were $7.0 million and $44.0 million as of March 31, 2025 and December 31, 2024, respectively."
                    },
                    "318": {
                      "title": "Other assets",
                      "class": "predicted header",
                      "contents": {
                        "319": {
                          "text": "The Company made strategic investments of an aggregate of $3.1 million and an immaterial amount during the three months ended March 31, 2025 and 2024, respectively, in investees in which certain related parties of the Company held an interest over 10%."
                        }
                      }
                    }
                  }
                },
                "320": {
                  "title": "Expenses and Accounts payable",
                  "class": "predicted header",
                  "contents": {
                    "321": {
                      "text": "There were immaterial professional and consulting services provided by entities affiliated with related parties during the three months ended March 31, 2025, compared to $1.1 million during the same period in 2024. As of March 31, 2025 and December 31, 2024, there were no Accounts payable to related parties."
                    },
                    "322": {
                      "title": "18.        SUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION",
                      "class": "predicted header",
                      "contents": {
                        "323": {
                          "text": "Changes in operating assets and liabilities affecting cash were as follows (in thousands):"
                        },
                        "324": {
                          "table": [
                            [
                              "",
                              "Three Months Ended March 31,",
                              "Three Months Ended March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "USDC",
                              "$(1,035,421)",
                              "$(299,507)"
                            ],
                            [
                              "Accounts receivable, net",
                              "(10,443)",
                              "(108,802)"
                            ],
                            [
                              "Customer custodial funds in transit",
                              "(41,862)",
                              "(21,260)"
                            ],
                            [
                              "Income taxes, net",
                              "29,163",
                              "41,613"
                            ],
                            [
                              "Other current and non-current assets",
                              "(55,554)",
                              "(3,856)"
                            ],
                            [
                              "Other current and non-current liabilities",
                              "(12,385)",
                              "(82,190)"
                            ],
                            [
                              "Net changes in operating assets and liabilities",
                              "$(1,126,502)",
                              "$(474,002)"
                            ]
                          ]
                        },
                        "325": {
                          "text": "The following is a reconciliation of cash, cash equivalents, and restricted cash and cash equivalents (in thousands):"
                        },
                        "326": {
                          "table": [
                            [
                              "",
                              "March 31,",
                              "March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "Cash and cash equivalents",
                              "$8,051,169",
                              "$6,711,400"
                            ],
                            [
                              "Restricted cash and cash equivalents",
                              "55,672",
                              "33,499"
                            ],
                            [
                              "Customer custodial cash and cash equivalents",
                              "5,197,074",
                              "5,002,888"
                            ],
                            [
                              "Total cash, cash equivalents, and restricted cash and cash equivalents",
                              "$13,303,915",
                              "$11,747,787"
                            ]
                          ]
                        },
                        "327": {
                          "table": [
                            [
                              "",
                              "Three Months Ended March 31,",
                              "Three Months Ended March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "Crypto assets received as collateral",
                              "$779,893",
                              "$590,690"
                            ],
                            [
                              "Crypto assets received as collateral returned",
                              "797,722",
                              "495,237"
                            ],
                            [
                              "Crypto asset loan receivables originated",
                              "730,895",
                              "424,248"
                            ],
                            [
                              "Crypto asset loan receivables repaid",
                              "766,183",
                              "286,475"
                            ],
                            [
                              "Crypto assets borrowed",
                              "465,262",
                              "191,436"
                            ],
                            [
                              "Crypto assets borrowed repaid",
                              "440,796",
                              "77,451"
                            ],
                            [
                              "Additions of crypto asset investments",
                              "171,542",
                              "3,051"
                            ],
                            [
                              "Cumulative-effect adjustment due to the adoption of ASU 2023-08",
                              "—",
                              "561,489"
                            ]
                          ]
                        },
                        "328": {
                          "table": [
                            [
                              "",
                              "Three Months Ended March 31,",
                              "Three Months Ended March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "Cash paid during the period for income taxes, net of refunds",
                              "$36,092",
                              "$—"
                            ],
                            [
                              "Cash paid during the period for income taxes (prior to ASU No. 2023-09, Improvements to Income Tax Disclosures)",
                              "—",
                              "5,528"
                            ]
                          ]
                        }
                      }
                    },
                    "329": {
                      "title": "19.        SUBSEQUENT EVENT",
                      "class": "predicted header",
                      "contents": {
                        "330": {
                          "text": "On May 8, 2025, the Company signed a definitive agreement to acquire Sentillia B.V. (“Deribit”) for an aggregate purchase price of approximately $2.9 billion based on the closing price of the Company’s Class A common stock on May 7, 2025, consisting of cash and shares of the Company’s Class A common stock. Deribit is a crypto derivatives exchange, and this strategic acquisition will enable the Company to grow its global presence within crypto derivatives trading. The acquisition is subject to customary closing conditions, including regulatory approvals, and is expected to close by December 31, 2025."
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "331": {
          "title": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS",
          "standardized_title": "item2",
          "class": "item",
          "contents": {
            "332": {
              "title": "The following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Condensed Consolidated Financial Statements and the accompanying notes thereto included elsewhere in this Quarterly Report on Form 10-Q and our Annual Report on Form 10-K for the year ended December 31, 2024 (the “Annual Report”). The following discussion and analysis contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they never materialize or prove incorrect, could cause our results to differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to these differences include, but are not limited to, those identified below and those discussed in the section titled Risk Factors in Part II, Item 1A of this Quarterly Report on Form 10-Q. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “our,” “us,” “the Company,” and “Coinbase” refer to Coinbase Global, Inc. and its consolidated subsidiaries. For all narrative provided in this Item 2, two numbers presented consecutively represent figures for the three months ended March 31, 2025 as compared to the corresponding period in 2024, respectively, unless otherwise noted.",
              "class": "predicted header",
              "contents": {
                "333": {
                  "title": "Executive Overview",
                  "class": "predicted header"
                }
              }
            },
            "334": {
              "title": "This executive overview of Management’s Discussion and Analysis of Financial Condition and Results of Operations highlights selected information and does not contain all of the information that is important to readers of this Quarterly Report on Form 10-Q.",
              "class": "predicted header",
              "contents": {
                "335": {
                  "title": "26",
                  "class": "predicted header",
                  "contents": {
                    "336": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "337": {
                          "text": "During the first quarter of 2025, we continued to make progress against our mission by launching advanced trading tools, scaling derivatives globally, and growing our institutional and consumer user base. We also expanded access to financial services and implemented key infrastructure updates by upgrading Base to support the next generation of onchain apps and driving stablecoin adoption at scale, both of which are key to expanding global crypto usage."
                        },
                        "338": {
                          "text": "For the three months ended March 31, 2025, our net revenue was $2.0 billion, including $1.3 billion in transaction revenue and $0.7 billion in subscription and services revenue. For the three months ended March 31, 2024, our net revenue was $1.6 billion, including $1.1 billion in transaction revenue and $0.5 billion in subscription and services revenue."
                        },
                        "339": {
                          "text": "For the three months ended March 31, 2025, our net income was $65.6 million and Adjusted EBITDA was $0.9 billion. For the three months ended March 31, 2024, our net income was $1.2 billion and Adjusted EBITDA was $1.0 billion."
                        },
                        "340": {
                          "text": "Despite multiple Federal Funds Rate decreases in late 2024, future interest rate decreases are not certain. If interest rates continue to decline, they may materially impact our subscription and services and other revenue. We plan to dynamically adjust our expense base in order to be responsive to market conditions and revenue opportunities, increasing or decreasing it as needed, especially with respect to certain variable expenses. In the second quarter of 2025, we expect technology and development and general and administrative expenses to decline as compared to the first quarter of 2025, driven by lower variable customer support expenses and seasonally lower payroll taxes. Additionally, we expect sales and marketing expenses to grow modestly, as compared to the first quarter of 2025, primarily due to expected higher USDC rewards expense and brand marketing spend seasonality."
                        }
                      }
                    }
                  }
                },
                "341": {
                  "title": "Key Business Metrics",
                  "class": "predicted header",
                  "contents": {
                    "342": {
                      "text": "In addition to the measures presented in our Condensed Consolidated Financial Statements, we use the key business metrics listed below to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions:"
                    },
                    "343": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Change"
                        ],
                        [
                          "",
                          "2025",
                          "2024",
                          "2024%%%",
                          ""
                        ],
                        [
                          "MTUs(1) (in millions)",
                          "9.7",
                          "8.0",
                          "",
                          "21"
                        ],
                        [
                          "Assets on Platform(2) (in billions)",
                          "$328",
                          "$323",
                          "",
                          "1"
                        ],
                        [
                          "Trading Volume (in billions)",
                          "$393",
                          "$312",
                          "",
                          "26"
                        ],
                        [
                          "Net income (in millions)",
                          "$66",
                          "$1,176",
                          "",
                          "(94)"
                        ],
                        [
                          "Adjusted EBITDA(3) (in millions)",
                          "$930",
                          "$1,014",
                          "",
                          "(8)"
                        ]
                      ]
                    },
                    "344": {
                      "textsmall": "_____________"
                    },
                    "345": {
                      "textsmall": "nm - not meaningful"
                    },
                    "346": {
                      "textsmall": "(1)Represents quarterly MTUs, which are derived from the average of each month’s MTUs in each respective quarter."
                    },
                    "347": {
                      "textsmall": "(2)Represents Assets on Platform as of March 31, 2025 and 2024."
                    },
                    "348": {
                      "textsmall": "(3)See the section titled “Non-GAAP Financial Measure” below for a reconciliation of net income to Adjusted EBITDA and an explanation for why we consider Adjusted EBITDA to be a helpful metric for investors."
                    },
                    "349": {
                      "title": "Monthly Transacting Users",
                      "class": "predicted header",
                      "contents": {
                        "350": {
                          "text": "We define a Monthly Transacting User (“MTU”) as a consumer who actively or passively transacts in one or more products on our platform at least once during the rolling 28-day period ending on the date of measurement. MTUs engage in transactions that generate both transaction revenue and subscription and services revenue. Revenue-generating transactions include active transactions, such as buying or selling crypto assets or passive transactions such as earning staking rewards and USDC rewards. MTUs also engage in transactions that are non-revenue generating, such as consumers sending and receiving crypto assets between wallets and off-platform accounts on a non-expedited basis. MTUs may overstate the number of unique consumers due to differences in product architecture or user behavior."
                        }
                      }
                    },
                    "351": {
                      "title": "27",
                      "class": "predicted header",
                      "contents": {
                        "352": {
                          "title": "Table of Contents",
                          "class": "predicted header",
                          "contents": {
                            "353": {
                              "title": "MTUs increased for the three months ended March 31, 2025 as compared to 2024, primarily due to an increase in trading users, influenced by overall crypto market sentiment and activity, including higher average prices for certain crypto assets.",
                              "class": "predicted header"
                            },
                            "354": {
                              "title": "Assets on Platform",
                              "class": "predicted header",
                              "contents": {
                                "355": {
                                  "text": "We define Assets on Platform (“AOP”) as the total United States (“U.S.”) dollar equivalent value of USDC and crypto assets held or managed on behalf of customers in digital wallets on our platform, including our custody services but excluding assets for which the customer holds full or partial keys, calculated based on the market price on the date of measurement. AOP demonstrates the scale of balances held across our suite of products and services, the trust customers place in us to securely store their assets, and the underlying growth of the cryptoeconomy. AOP also represents a monetization opportunity through our products and services, including from trading and the adoption and use of USDC, staking, custody, and Prime Financing, when customers use these assets to engage with these products and services."
                                },
                                "356": {
                                  "text": "The following table sets forth the value of AOP by asset (in thousands, except percentages):"
                                },
                                "357": {
                                  "table": [
                                    [
                                      "",
                                      "March 31, 2025",
                                      "March 31, 2024",
                                      "Change %"
                                    ],
                                    [
                                      "Bitcoin",
                                      "$219,076,329",
                                      "$156,528,307",
                                      "40"
                                    ],
                                    [
                                      "Ethereum",
                                      "28,811,726",
                                      "61,311,867",
                                      "(53)"
                                    ],
                                    [
                                      "XRP",
                                      "17,775,950",
                                      "3,184,375",
                                      "458"
                                    ],
                                    [
                                      "Solana",
                                      "13,811,430",
                                      "24,304,478",
                                      "(43)"
                                    ],
                                    [
                                      "USDC",
                                      "7,839,131",
                                      "4,925,086",
                                      "59"
                                    ],
                                    [
                                      "Other crypto assets(1)",
                                      "40,195,126",
                                      "73,223,316",
                                      "(45)"
                                    ],
                                    [
                                      "Total",
                                      "$327,509,692",
                                      "$323,477,429",
                                      "1"
                                    ]
                                  ]
                                },
                                "358": {
                                  "textsmall": "__________________"
                                },
                                "359": {
                                  "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 5% of total AOP."
                                },
                                "360": {
                                  "text": "AOP at March 31, 2025 remained relatively flat as compared to March 31, 2024, reflecting increases of $37.9 billion due to higher Bitcoin units on platform and $24.7 billion due to increases in the price of Bitcoin, largely offset by the impact of net decreases in the prices of Ethereum and other crypto assets. Separately, we attribute the growth in USDC AOP primarily to our USDC rewards program, combined with deeper integration of USDC across our products."
                                }
                              }
                            },
                            "361": {
                              "title": "Trading Volume",
                              "class": "predicted header",
                              "contents": {
                                "362": {
                                  "text": "We define Trading Volume as the total U.S. dollar equivalent value of spot matched trades transacted between a buyer and seller through our platform during the period of measurement. Trading Volume does not include derivatives volume on our platform or trades executed on third-party venues. Trading Volume represents the product of the quantity of assets transacted and the trade price at the time the transaction was executed. As trading activity directly impacts transaction revenue, we believe this measure is a reflection of liquidity on our order books, trading health, and the underlying growth of the cryptoeconomy. Institutions incur lower fees per transaction than consumers and, as a result, the impact of changes in consumer Trading Volume on transaction revenue is more pronounced than the impact of changes in institutional Trading Volume."
                                },
                                "363": {
                                  "text": "Generally, Trading Volume on our platform is primarily influenced by overall market dynamics, namely the price of crypto assets, crypto asset volatility, and macroeconomic conditions, and by our share of total crypto market spot trading volume. In periods of high crypto asset prices and crypto asset volatility, we have experienced correspondingly high levels of Trading Volume."
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "364": {
                      "title": "28",
                      "class": "predicted header",
                      "contents": {
                        "365": {
                          "title": "Table of Contents",
                          "class": "predicted header",
                          "contents": {
                            "366": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change"
                                ],
                                [
                                  "",
                                  "2025",
                                  "2025",
                                  "2025",
                                  "2024",
                                  "2024",
                                  "2024%%%",
                                  ""
                                ],
                                [
                                  "Trading Volume (in billions)",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "",
                                  ""
                                ],
                                [
                                  "Consumer",
                                  "",
                                  "$78",
                                  "78",
                                  "",
                                  "$56",
                                  "56",
                                  "39"
                                ],
                                [
                                  "Institutional",
                                  "315",
                                  "315",
                                  "315",
                                  "256",
                                  "256",
                                  "256",
                                  "23"
                                ],
                                [
                                  "Total Trading Volume",
                                  "",
                                  "$393",
                                  "393",
                                  "",
                                  "$312",
                                  "312",
                                  "26"
                                ],
                                [
                                  "Trading Volume by crypto asset",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "",
                                  ""
                                ],
                                [
                                  "Bitcoin",
                                  "27",
                                  "27%",
                                  "",
                                  "33",
                                  "33%",
                                  "",
                                  "(18)"
                                ],
                                [
                                  "USDT",
                                  "13",
                                  "13",
                                  "",
                                  "11",
                                  "11",
                                  "",
                                  "18"
                                ],
                                [
                                  "Ethereum",
                                  "11",
                                  "11",
                                  "",
                                  "13",
                                  "13",
                                  "",
                                  "(15)"
                                ],
                                [
                                  "XRP",
                                  "11",
                                  "11",
                                  "",
                                  "nm",
                                  "nm",
                                  "nm",
                                  "nm"
                                ],
                                [
                                  "Other crypto assets(1)",
                                  "38",
                                  "38",
                                  "",
                                  "43",
                                  "43",
                                  "",
                                  "(12)"
                                ],
                                [
                                  "Total",
                                  "100%",
                                  "100%",
                                  "100%",
                                  "100%",
                                  "100%",
                                  "100%",
                                  ""
                                ]
                              ]
                            },
                            "367": {
                              "textsmall": "____________________________________"
                            },
                            "368": {
                              "textsmall": "nm - not meaningful"
                            },
                            "369": {
                              "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 10% of our total Trading Volume."
                            },
                            "370": {
                              "text": "For the three months ended March 31, 2025 as compared to 2024, Trading Volume increased reflecting an increase in both the total market and our market share in the U.S., where our business is concentrated:"
                            },
                            "371": {
                              "text": "•Total market — Crypto Asset Volatility1 increased 15% and average total crypto market capitalization increased 56%. These two macro inputs have historically been highly correlated with Trading Volume and are typically influenced by overall crypto market sentiment, activity in the crypto market, and changes in average crypto asset prices; and"
                            },
                            "372": {
                              "text": "•Market share — Trading Volume growth outpaced the 17% growth in overall U.S. spot market trading volume, as we were able to capture a larger portion of the trading activity due to our competitive position and product strategy."
                            },
                            "373": {
                              "textsmall": "1 Crypto Asset Volatility represents our internal measure of crypto asset volatility in the market relative to prior periods. The volatility is based on intraday returns of a volume-weighted basket of all assets listed on our trading platform. These returns are used to compute the basket’s intraday volatility which is then scaled to a daily window. These daily volatility values are then averaged over the applicable time period as needed."
                            }
                          }
                        }
                      }
                    },
                    "374": {
                      "title": "29",
                      "class": "predicted header",
                      "contents": {
                        "375": {
                          "title": "Table of Contents",
                          "class": "predicted header"
                        }
                      }
                    }
                  }
                },
                "376": {
                  "title": "Results of Operations",
                  "class": "predicted header",
                  "contents": {
                    "377": {
                      "text": "The following table presents the Condensed Consolidated Statements of Operations (in thousands), as well as each component as a percentage of total revenue:"
                    },
                    "378": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,"
                        ],
                        [
                          "",
                          "2025",
                          "2025",
                          "2025",
                          "2024",
                          "2024",
                          "2024"
                        ],
                        [
                          "",
                          "",
                          "$$$%(1)",
                          "%(1)",
                          "",
                          "$$$%(1)",
                          "%(1)"
                        ],
                        [
                          "Revenue:",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Net revenue",
                          "$1,960,319",
                          "96",
                          "96",
                          "$1,587,677",
                          "97",
                          "97"
                        ],
                        [
                          "Other revenue",
                          "73,976",
                          "4",
                          "4",
                          "49,893",
                          "3",
                          "3"
                        ],
                        [
                          "Total revenue",
                          "2,034,295",
                          "100",
                          "100",
                          "1,637,570",
                          "100",
                          "100"
                        ],
                        [
                          "Operating expenses:",
                          "",
                          "",
                          "",
                          "",
                          "",
                          ""
                        ],
                        [
                          "Transaction expense",
                          "303,026",
                          "15",
                          "15",
                          "217,407",
                          "13",
                          "13"
                        ],
                        [
                          "Technology and development",
                          "355,368",
                          "17",
                          "17",
                          "357,863",
                          "22",
                          "22"
                        ],
                        [
                          "Sales and marketing",
                          "247,283",
                          "12",
                          "12",
                          "98,585",
                          "6",
                          "6"
                        ],
                        [
                          "General and administrative",
                          "394,346",
                          "19",
                          "19",
                          "287,236",
                          "18",
                          "18"
                        ],
                        [
                          "Losses (gains) on crypto assets held for operations, net",
                          "34,365",
                          "2",
                          "2",
                          "(86,358)",
                          "(5)",
                          "(5)"
                        ],
                        [
                          "Other operating (income) expense, net",
                          "(5,899)",
                          "—",
                          "—",
                          "2,376",
                          "—",
                          "—"
                        ],
                        [
                          "Total operating expenses",
                          "1,328,489",
                          "65",
                          "65",
                          "877,109",
                          "54",
                          "54"
                        ],
                        [
                          "Operating income",
                          "705,806",
                          "35",
                          "35",
                          "760,461",
                          "46",
                          "46"
                        ],
                        [
                          "Interest expense",
                          "20,511",
                          "1",
                          "1",
                          "19,071",
                          "1",
                          "1"
                        ],
                        [
                          "Losses (gains) on crypto assets held for investment, net",
                          "596,651",
                          "29",
                          "29",
                          "(650,429)",
                          "(40)",
                          "(40)"
                        ],
                        [
                          "Other expense (income), net",
                          "6,188",
                          "—",
                          "—",
                          "(45,605)",
                          "(3)",
                          "(3)"
                        ],
                        [
                          "Income before income taxes",
                          "82,456",
                          "4",
                          "4",
                          "1,437,424",
                          "88",
                          "88"
                        ],
                        [
                          "Provision for income taxes",
                          "16,848",
                          "1",
                          "1",
                          "261,179",
                          "16",
                          "16"
                        ],
                        [
                          "Net income",
                          "$65,608",
                          "3",
                          "3",
                          "$1,176,245",
                          "72",
                          "72"
                        ]
                      ]
                    },
                    "379": {
                      "textsmall": "__________________"
                    },
                    "380": {
                      "textsmall": "(1)Figures presented above may not sum precisely due to rounding."
                    },
                    "381": {
                      "title": "Comparison of the three months ended March 31, 2025 and 2024",
                      "class": "predicted header",
                      "contents": {
                        "382": {
                          "title": "Revenue",
                          "class": "predicted header",
                          "contents": {
                            "383": {
                              "text": "For the three months ended March 31, 2025 and 2024 we generated 84% and 83%, respectively, of total revenue in the U.S. No other country accounted for more than 10% of total revenue during the periods presented. International revenue comprised mainly transaction revenue in both periods presented."
                            },
                            "384": {
                              "title": "Transaction revenue",
                              "class": "predicted header",
                              "contents": {
                                "385": {
                                  "table": [
                                    [
                                      "",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Change",
                                      "Change"
                                    ],
                                    [
                                      "(in thousands, except %)",
                                      "2025",
                                      "2024",
                                      "2024%%%",
                                      "$",
                                      ""
                                    ],
                                    [
                                      "Consumer, net",
                                      "$1,095,506",
                                      "$935,212",
                                      "",
                                      "$160,294",
                                      "17"
                                    ],
                                    [
                                      "Institutional, net",
                                      "98,888",
                                      "85,392",
                                      "",
                                      "13,496",
                                      "16"
                                    ],
                                    [
                                      "Other transaction revenue, net",
                                      "67,814",
                                      "56,137",
                                      "",
                                      "11,677",
                                      "21"
                                    ],
                                    [
                                      "Total transaction revenue",
                                      "$1,262,208",
                                      "$1,076,741",
                                      "",
                                      "$185,467",
                                      "17"
                                    ]
                                  ]
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "386": {
                      "title": "30",
                      "class": "predicted header",
                      "contents": {
                        "387": {
                          "title": "Table of Contents",
                          "class": "predicted header",
                          "contents": {
                            "388": {
                              "text": "Transaction revenue increased for the three months ended March 31, 2025 as compared to 2024, due to:"
                            },
                            "389": {
                              "text": "•an increase in consumer transaction revenue of $366.5 million due to a 39% increase in consumer Trading Volume. This increase was offset in part by a decrease of $206.2 million attributed to a lower average blended fee rate, primarily due to changes in the mix of Trading Volume from Simple to Advanced trading, as well as growth in Trading Volume from Coinbase One users."
                            },
                            "390": {
                              "text": "•an increase in institutional transaction revenue primarily driven by growth in derivatives trading volume on our international exchange. Separately, the impact of a 23% increase in institutional Trading Volume was offset by a lower average blended fee rate resulting primarily from reduced fees at higher volumes; and"
                            },
                            "391": {
                              "text": "•an increase in other transaction revenue primarily driven by higher revenue from instant transfer withdrawals."
                            },
                            "392": {
                              "text": "The percentage of transaction revenue from trading on our platform broken down by crypto asset was as follows:"
                            },
                            "393": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change"
                                ],
                                [
                                  "",
                                  "2025",
                                  "2025",
                                  "2024",
                                  "2024",
                                  "2024%%%",
                                  ""
                                ],
                                [
                                  "Bitcoin",
                                  "26",
                                  "26%",
                                  "30",
                                  "30%",
                                  "",
                                  "(13)"
                                ],
                                [
                                  "XRP",
                                  "18",
                                  "18",
                                  "nm",
                                  "nm",
                                  "nm",
                                  "nm"
                                ],
                                [
                                  "Ethereum",
                                  "10",
                                  "10",
                                  "15",
                                  "15",
                                  "15",
                                  "(33)"
                                ],
                                [
                                  "Solana",
                                  "10",
                                  "10",
                                  "nm",
                                  "nm",
                                  "nm",
                                  "nm"
                                ],
                                [
                                  "Other crypto assets(1)",
                                  "36",
                                  "36",
                                  "55",
                                  "55",
                                  "",
                                  "(35)"
                                ],
                                [
                                  "Total",
                                  "100",
                                  "100%",
                                  "100",
                                  "100%",
                                  "",
                                  ""
                                ]
                              ]
                            },
                            "394": {
                              "textsmall": "____________________________________"
                            },
                            "395": {
                              "textsmall": "nm - not meaningful"
                            },
                            "396": {
                              "textsmall": "(1)Includes various other crypto asset balances, none of which individually represented more than 10% of our total transaction revenue."
                            },
                            "397": {
                              "title": "Subscription and services revenue",
                              "class": "predicted header",
                              "contents": {
                                "398": {
                                  "table": [
                                    [
                                      "",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Change",
                                      "Change"
                                    ],
                                    [
                                      "(in thousands, except %)",
                                      "2025",
                                      "2024",
                                      "2024%%%",
                                      "$",
                                      ""
                                    ],
                                    [
                                      "Stablecoin revenue",
                                      "$297,535",
                                      "$197,317",
                                      "",
                                      "$100,218",
                                      "51"
                                    ],
                                    [
                                      "Blockchain rewards",
                                      "196,592",
                                      "150,929",
                                      "",
                                      "45,663",
                                      "30"
                                    ],
                                    [
                                      "Interest and finance fee income",
                                      "63,086",
                                      "66,663",
                                      "",
                                      "(3,577)",
                                      "(5)"
                                    ],
                                    [
                                      "Other subscription and services revenue",
                                      "140,898",
                                      "96,027",
                                      "",
                                      "44,871",
                                      "47"
                                    ],
                                    [
                                      "Total subscription and services revenue",
                                      "$698,111",
                                      "$510,936",
                                      "",
                                      "$187,175",
                                      "37"
                                    ]
                                  ]
                                },
                                "399": {
                                  "text": "Subscription and services revenue increased for the three months ended March 31, 2025 as compared to 2024, primarily due to:"
                                },
                                "400": {
                                  "text": "•increases in stablecoin revenue of $105.1 million due to higher average USDC balances held in Coinbase products2, on which we earn the vast majority of the interest on the associated reserves, and $67.9 million due to higher average USDC off-platform balances, on which we earn varying percentages depending on where the USDC is held. This revenue growth was partially offset by a decrease of $68.5 million due to lower average interest rates, which declined 96 basis points;"
                                },
                                "401": {
                                  "textsmall": "2 Includes corporate USDC balances and USDC held on behalf of customers in eligible Coinbase products."
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "402": {
                      "title": "31",
                      "class": "predicted header",
                      "contents": {
                        "403": {
                          "title": "Table of Contents",
                          "class": "predicted header",
                          "contents": {
                            "404": {
                              "text": "•an increase in blockchain rewards of $20.5 million due to changes in average crypto asset prices, and $13.9 million due to changes in reward rates primarily for Solana and Ethereum; and"
                            },
                            "405": {
                              "text": "•an increase in other subscription and services revenue, primarily due to growth of Coinbase One, reflecting a higher number of paid subscribers."
                            },
                            "406": {
                              "text": "There were no material changes to note within interest and finance fee income."
                            },
                            "407": {
                              "title": "Other revenue",
                              "class": "predicted header",
                              "contents": {
                                "408": {
                                  "table": [
                                    [
                                      "",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Three Months Ended March 31,",
                                      "Change",
                                      "Change"
                                    ],
                                    [
                                      "(in thousands, except %)",
                                      "2025",
                                      "2024",
                                      "2024%%%",
                                      "$",
                                      ""
                                    ],
                                    [
                                      "Corporate interest and other income",
                                      "$73,976",
                                      "$49,893",
                                      "",
                                      "$24,083",
                                      "48"
                                    ],
                                    [
                                      "Total other revenue",
                                      "$73,976",
                                      "$49,893",
                                      "",
                                      "$24,083",
                                      "48"
                                    ]
                                  ]
                                },
                                "409": {
                                  "text": "Other revenue increased for the three months ended March 31, 2025 as compared to 2024, primarily reflecting an increase of $35.2 million due to higher average cash and cash equivalents balances, partially offset by lower average interest rates earned on these balances, which declined 77 basis points."
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "410": {
              "title": "Operating expenses",
              "class": "predicted header",
              "contents": {
                "411": {
                  "text": "Certain prior period amounts have been reclassified to conform to the current period presentation."
                },
                "412": {
                  "title": "Transaction expense",
                  "class": "predicted header",
                  "contents": {
                    "413": {
                      "table": [
                        [
                          "",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Three Months Ended March 31,",
                          "Change",
                          "Change"
                        ],
                        [
                          "(in thousands, except %)",
                          "2025",
                          "2024",
                          "2024%%%",
                          "$",
                          ""
                        ],
                        [
                          "Blockchain rewards fees",
                          "$120,021",
                          "$105,454",
                          "",
                          "$14,567",
                          "14"
                        ],
                        [
                          "Payment processing and account verification",
                          "64,645",
                          "33,109",
                          "",
                          "31,536",
                          "95"
                        ],
                        [
                          "Transaction rebates and commissions",
                          "59,585",
                          "14,991",
                          "",
                          "44,594",
                          "297"
                        ],
                        [
                          "Transaction reversal losses",
                          "46,844",
                          "19,974",
                          "",
                          "26,870",
                          "135"
                        ],
                        [
                          "Blockchain transaction fees",
                          "7,954",
                          "42,488",
                          "",
                          "(34,534)",
                          "(81)"
                        ],
                        [
                          "Other",
                          "3,977",
                          "1,391",
                          "",
                          "2,586",
                          "186"
                        ],
                        [
                          "Total transaction expense",
                          "$303,026",
                          "$217,407",
                          "",
                          "$85,619",
                          "39"
                        ]
                      ]
                    },
                    "414": {
                      "text": "Transaction expense increased for the three months ended March 31, 2025 as compared to 2024, primarily due to:"
                    },
                    "415": {
                      "text": "•higher blockchain rewards fees, which rose with blockchain rewards revenue, partially offset by the impact of adjustments to our fee structures;"
                    },
                    "416": {
                      "text": "•an increase in payment processing fees of $18.7 million, due to 26% Trading Volume growth and expanding international payment methods. Account verification fees also rose with more new users verified;"
                    },
                    "417": {
                      "text": "•higher transaction rebates and commissions, primarily reflecting an increase in rebates earned by institutional customers providing liquidity on our international exchange, driven by growth in volume; and"
                    },
                    "418": {
                      "text": "•an increase in transaction reversal losses primarily driven by higher transaction volume; offset in part by"
                    },
                    "419": {
                      "text": "•a decrease in blockchain transaction fees primarily due to lower average gas and asset prices for Ethereum."
                    },
                    "420": {
                      "text": "There were no material changes to note within other."
                    }
                  }
                },
                "421": {
                  "title": "32",
                  "class": "predicted header",
                  "contents": {
                    "422": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "423": {
                          "title": "Technology and development",
                          "class": "predicted header",
                          "contents": {
                            "424": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change",
                                  "Change"
                                ],
                                [
                                  "(in thousands, except %)",
                                  "2025",
                                  "2024",
                                  "2024%%%",
                                  "$",
                                  ""
                                ],
                                [
                                  "Personnel-related",
                                  "$232,586",
                                  "$266,581",
                                  "",
                                  "$(33,995)",
                                  "(13)"
                                ],
                                [
                                  "Website hosting and infrastructure",
                                  "67,247",
                                  "49,873",
                                  "",
                                  "17,374",
                                  "35"
                                ],
                                [
                                  "Amortization, depreciation, and impairment",
                                  "32,012",
                                  "25,850",
                                  "",
                                  "6,162",
                                  "24"
                                ],
                                [
                                  "Other",
                                  "23,523",
                                  "15,559",
                                  "",
                                  "7,964",
                                  "51"
                                ],
                                [
                                  "Total technology and development",
                                  "$355,368",
                                  "$357,863",
                                  "",
                                  "$(2,495)",
                                  "(1)"
                                ]
                              ]
                            },
                            "425": {
                              "text": "Technology and development expenses decreased for the three months ended March 31, 2025 as compared to 2024, primarily due to:"
                            },
                            "426": {
                              "text": "•a decrease in personnel-related expenses reflecting:"
                            },
                            "427": {
                              "text": "◦$20.5 million lower stock-based compensation expense attributed to the roll-off of non-recurring multi-year stock-based compensation awards;"
                            },
                            "428": {
                              "text": "◦$17.3 million higher capitalization of costs of internally developed technology; and"
                            },
                            "429": {
                              "text": "◦a $10.3 million decrease due to updates made in late 2024 to our vesting schedule for new awards to achieve linear expense recognition; offset in part by"
                            },
                            "430": {
                              "text": "◦$15.6 million higher personnel-related expenses due to higher average headcount."
                            },
                            "431": {
                              "text": "•an increase in website hosting and infrastructure expenses driven by increased activity on our platform."
                            },
                            "432": {
                              "text": "There were no material changes to note within amortization, depreciation, and impairment or other."
                            }
                          }
                        },
                        "433": {
                          "title": "Sales and marketing",
                          "class": "predicted header",
                          "contents": {
                            "434": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change",
                                  "Change"
                                ],
                                [
                                  "(in thousands, except %)",
                                  "2025",
                                  "2024",
                                  "2024%%%",
                                  "$",
                                  ""
                                ],
                                [
                                  "Marketing programs",
                                  "$104,970",
                                  "$30,459",
                                  "",
                                  "$74,511",
                                  "245"
                                ],
                                [
                                  "USDC rewards",
                                  "100,034",
                                  "26,562",
                                  "",
                                  "73,472",
                                  "277"
                                ],
                                [
                                  "Personnel-related",
                                  "33,456",
                                  "35,492",
                                  "",
                                  "(2,036)",
                                  "(6)"
                                ],
                                [
                                  "Other",
                                  "8,823",
                                  "6,072",
                                  "",
                                  "2,751",
                                  "45"
                                ],
                                [
                                  "Total sales and marketing",
                                  "$247,283",
                                  "$98,585",
                                  "",
                                  "$148,698",
                                  "151"
                                ]
                              ]
                            },
                            "435": {
                              "text": "Sales and marketing expenses increased for the three months ended March 31, 2025 as compared to 2024, primarily due to:"
                            },
                            "436": {
                              "text": "•an increase in marketing program expenses due to higher digital advertising spend as we capitalized on market momentum during the quarter; and"
                            },
                            "437": {
                              "text": "•an increase in USDC rewards payouts of $53.2 million primarily due to growth in average customer USDC balances held in Coinbase products3, with the remainder primarily due to higher reward rates offered to customers in an effort to enhance customer acquisition, retention, and platform engagement."
                            },
                            "438": {
                              "text": "There were no material changes to note within personnel-related or other."
                            },
                            "439": {
                              "textsmall": "3 Comprises USDC held on behalf of customers in eligible Coinbase products."
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "440": {
                  "title": "33",
                  "class": "predicted header",
                  "contents": {
                    "441": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "442": {
                          "title": "General and administrative",
                          "class": "predicted header",
                          "contents": {
                            "443": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change",
                                  "Change"
                                ],
                                [
                                  "(in thousands, except %)",
                                  "2025",
                                  "2024",
                                  "2024%%%",
                                  "$",
                                  ""
                                ],
                                [
                                  "Personnel-related",
                                  "$166,159",
                                  "$156,313",
                                  "",
                                  "$9,846",
                                  "6"
                                ],
                                [
                                  "Customer support(1)",
                                  "70,455",
                                  "18,720",
                                  "",
                                  "51,735",
                                  "276"
                                ],
                                [
                                  "Professional services",
                                  "58,176",
                                  "43,158",
                                  "",
                                  "15,018",
                                  "35"
                                ],
                                [
                                  "Other",
                                  "99,556",
                                  "69,045",
                                  "",
                                  "30,511",
                                  "44"
                                ],
                                [
                                  "Total general and administrative",
                                  "$394,346",
                                  "$287,236",
                                  "",
                                  "$107,110",
                                  "37"
                                ]
                              ]
                            },
                            "444": {
                              "textsmall": "____________________________________"
                            },
                            "445": {
                              "textsmall": "(1)Excludes personnel-related and professional services expenses."
                            },
                            "446": {
                              "text": "General and administrative expenses increased for the three months ended March 31, 2025 as compared to 2024, primarily due to:"
                            },
                            "447": {
                              "text": "•an increase in customer support costs as a result of increased capacity needs. Our capacity needs typically increase in periods following higher Trading Volumes;"
                            },
                            "448": {
                              "text": "•an increase in professional services primarily due to higher costs of legal advisory services; and"
                            },
                            "449": {
                              "text": "•a $27.8 million increase in policy spend within other as we increased our crypto advocacy efforts, offset in part by a decrease of $20.1 million in legal costs. The remaining variance in other was due to increases across various expenses, with no material changes to note."
                            },
                            "450": {
                              "text": "There were no material changes to note within personnel-related."
                            }
                          }
                        },
                        "451": {
                          "title": "Losses (gains) on crypto assets held for operations, net",
                          "class": "predicted header",
                          "contents": {
                            "452": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change",
                                  "Change"
                                ],
                                [
                                  "(in thousands, except %)",
                                  "2025",
                                  "2024",
                                  "2024%%%",
                                  "$",
                                  ""
                                ],
                                [
                                  "Losses (gains) on crypto assets held for operations, net",
                                  "$34,365",
                                  "$(86,358)",
                                  "",
                                  "$120,723",
                                  "(140)"
                                ]
                              ]
                            },
                            "453": {
                              "text": "Changes in losses (gains) on crypto assets held for operations, net resulted primarily from holding these assets during a period of declining crypto asset prices in 2025 as compared to a period of rising crypto asset prices in 2024. Though gross inflows and outflows of these assets were both $0.3 billion during each of the three months ended March 31, 2025 and 2024, respectively, losses and gains on changes in the fair value of the assets were limited as these assets are converted to cash or used for expenses nearly immediately after receipt."
                            }
                          }
                        },
                        "454": {
                          "title": "Other operating (income) expense, net",
                          "class": "predicted header",
                          "contents": {
                            "455": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,",
                                  "Change",
                                  "Change"
                                ],
                                [
                                  "(in thousands, except %)",
                                  "2025",
                                  "2024",
                                  "2024%%%",
                                  "$",
                                  ""
                                ],
                                [
                                  "Platform-related incidents",
                                  "$720",
                                  "$195",
                                  "",
                                  "$525",
                                  "269"
                                ],
                                [
                                  "Other",
                                  "(6,619)",
                                  "2,181",
                                  "",
                                  "(8,800)",
                                  "(403)"
                                ],
                                [
                                  "Total other operating (income) expense, net",
                                  "$(5,899)",
                                  "$2,376",
                                  "",
                                  "$(8,275)",
                                  "(348)"
                                ]
                              ]
                            },
                            "456": {
                              "text": "There were no material changes to note within Other operating (income) expense, net."
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "457": {
              "title": "Interest expense",
              "class": "predicted header",
              "contents": {
                "458": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Change",
                      "Change"
                    ],
                    [
                      "(in thousands, except %)",
                      "2025",
                      "2024",
                      "2024%%%",
                      "$",
                      ""
                    ],
                    [
                      "Interest expense",
                      "$20,511",
                      "$19,071",
                      "",
                      "$1,440",
                      "8"
                    ]
                  ]
                },
                "459": {
                  "title": "34",
                  "class": "predicted header",
                  "contents": {
                    "460": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "461": {
                          "text": "There were no material changes to note within Interest expense."
                        }
                      }
                    }
                  }
                }
              }
            },
            "462": {
              "title": "Losses (gains) on crypto assets held for investment, net",
              "class": "predicted header",
              "contents": {
                "463": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Change",
                      "Change"
                    ],
                    [
                      "(in thousands, except %)",
                      "2025",
                      "2024",
                      "2024%%%",
                      "$",
                      ""
                    ],
                    [
                      "Losses (gains) on crypto assets held for investment, net",
                      "$596,651",
                      "$(650,429)",
                      "",
                      "$1,247,080",
                      "(192)"
                    ]
                  ]
                },
                "464": {
                  "text": "Losses on crypto assets held for investment, net during the three months ended March 31, 2025 were primarily due to fair value remeasurement of these assets, mainly Bitcoin and Ethereum, as asset prices decreased, offset in part by increased investment purchases during the period. Gains on crypto assets held for investment, net during the three months ended March 31, 2024 were primarily due to fair value remeasurement of these assets, mainly Bitcoin and Ethereum, during a period when the asset prices increased."
                }
              }
            },
            "465": {
              "title": "Other expense (income), net",
              "class": "predicted header",
              "contents": {
                "466": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Change",
                      "Change"
                    ],
                    [
                      "(in thousands, except %)",
                      "2025",
                      "2024",
                      "2024%%%",
                      "$",
                      ""
                    ],
                    [
                      "Losses (gains) on other financial instruments, net",
                      "$21,683",
                      "$(13,186)",
                      "",
                      "$34,869",
                      "(264)"
                    ],
                    [
                      "Losses (gains) on crypto asset loan receivables, net",
                      "2,853",
                      "(25,526)",
                      "",
                      "28,379",
                      "(111)"
                    ],
                    [
                      "Other",
                      "(18,348)",
                      "(6,893)",
                      "",
                      "(11,455)",
                      "166"
                    ],
                    [
                      "Total other expense (income), net",
                      "$6,188",
                      "$(45,605)",
                      "",
                      "$51,793",
                      "(114)"
                    ]
                  ]
                },
                "467": {
                  "text": "Other expense (income), net changed for the three months ended March 31, 2025 as compared to 2024, primarily reflecting changes in the prices of crypto assets underlying certain of our investments, as prices increased in 2024 and decreased in 2025. There were no material changes to note within other."
                }
              }
            },
            "468": {
              "title": "Provision for income taxes",
              "class": "predicted header",
              "contents": {
                "469": {
                  "table": [
                    [
                      "",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Three Months Ended March 31,",
                      "Change",
                      "Change"
                    ],
                    [
                      "(in thousands, except %)",
                      "2025",
                      "2024",
                      "2024%%%",
                      "$",
                      ""
                    ],
                    [
                      "Provision for income taxes",
                      "$16,848",
                      "$261,179",
                      "",
                      "$(244,331)",
                      "(94)"
                    ]
                  ]
                },
                "470": {
                  "text": "For the three months ended March 31, 2025 as compared to 2024, the decrease in provision for income taxes was primarily due to lower pretax income, partially offset by lower tax benefits from stock-based compensation."
                },
                "471": {
                  "title": "Non-GAAP Financial Measure",
                  "class": "predicted header",
                  "contents": {
                    "472": {
                      "text": "In addition to our results determined in accordance with GAAP, we believe Adjusted EBITDA, a non-GAAP financial performance measure, is useful information to help investors evaluate our operating performance because it: enables investors to compare this measure and component adjustments to similar information provided by peer companies and our past financial performance; provides additional company-specific adjustments for certain items that may be included in income from operations but that we do not consider to be normal, recurring, operating expenses (or income) necessary to operate our business given our operations, revenue generating activities, business strategy, industry, and regulatory environment; and provides investors with visibility to a measure management uses to evaluate our ongoing operations and for internal planning and forecasting purposes. For example:"
                    },
                    "473": {
                      "text": "•We believe it is useful to exclude certain non-cash expenses, such as depreciation and amortization and stock-based compensation, from Adjusted EBITDA because the amounts of such expenses can vary significantly from period to period and may not directly correlate to the underlying performance of our business operations."
                    }
                  }
                },
                "474": {
                  "title": "35",
                  "class": "predicted header",
                  "contents": {
                    "475": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "476": {
                          "text": "•We believe it is useful to exclude certain items that we do not consider to be normal, recurring, cash operating expenses and therefore, not reflective of our ongoing business operations. For example, we exclude: (i) other (income) expense, net, as the income and expenses recognized in this line item are not part of our core operating activities and are considered non-operating activities under GAAP and (ii) gains and losses on crypto assets held for investment because such investments are considered primarily long-term holdings. We do not plan on engaging in regular trading of crypto assets, and, as an operating company, our investing activities in crypto are not part of our revenue generating activities, which are based on transactions on our platform and the sales of subscriptions and services."
                        },
                        "477": {
                          "text": "•We believe Adjusted EBITDA is useful to measure a company’s operating performance without regard to items such as stock-based compensation expense, depreciation and amortization expense, interest expense, other expense (income), net, and benefit from or provision for income taxes that can vary substantially from company to company depending upon their financing, capital structures, and the method by which assets were acquired."
                        },
                        "478": {
                          "title": "Limitations of Adjusted EBITDA",
                          "class": "predicted header",
                          "contents": {
                            "479": {
                              "text": "We believe that Adjusted EBITDA may be helpful to investors for the reasons noted above. However, Adjusted EBITDA is presented for supplemental informational purposes only, has limitations as an analytical tool, and should not be considered in isolation or as a substitute for financial information presented in accordance with GAAP. There are a number of limitations related to Adjusted EBITDA rather than net income (loss), which is the nearest GAAP equivalent of Adjusted EBITDA. Some of these limitations are that Adjusted EBITDA excludes:"
                            },
                            "480": {
                              "text": "•provision for income taxes;"
                            },
                            "481": {
                              "text": "•interest expense, or the cash requirements necessary to service interest or principal payments on our debt, which reduces cash available to us;"
                            },
                            "482": {
                              "text": "•depreciation and amortization expense and, although these are non-cash expenses, the assets being depreciated and amortized may have to be replaced in the future;"
                            },
                            "483": {
                              "text": "•stock-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense for our business and an important part of our compensation strategy;"
                            },
                            "484": {
                              "text": "•net gains or losses on our crypto assets held for investment; and"
                            },
                            "485": {
                              "text": "•other expense (income), net, which represents losses or gains on other financial instruments, and other non-operating income and expense activity."
                            },
                            "486": {
                              "text": "In addition, other companies, including companies in our industry, may calculate Adjusted EBITDA differently or may use other measures to evaluate their performance, all of which could reduce the usefulness of our disclosure of Adjusted EBITDA as a tool for comparison. A reconciliation is provided below for Adjusted EBITDA to net income, the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measure and the reconciliation of Adjusted EBITDA to net income, and not to rely on any single financial measure to evaluate our business."
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "487": {
                  "title": "36",
                  "class": "predicted header",
                  "contents": {
                    "488": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "489": {
                          "text": "The following table provides a reconciliation of net income to Adjusted EBITDA (in thousands):"
                        },
                        "490": {
                          "table": [
                            [
                              "",
                              "Three Months Ended March 31,",
                              "Three Months Ended March 31,"
                            ],
                            [
                              "",
                              "2025",
                              "2024"
                            ],
                            [
                              "Net income",
                              "$65,608",
                              "$1,176,245"
                            ],
                            [
                              "Adjusted to exclude the following:",
                              "",
                              ""
                            ],
                            [
                              "Provision for income taxes",
                              "16,848",
                              "261,179"
                            ],
                            [
                              "Interest expense",
                              "20,511",
                              "19,071"
                            ],
                            [
                              "Depreciation and amortization",
                              "33,333",
                              "29,327"
                            ],
                            [
                              "Stock-based compensation expense",
                              "190,729",
                              "224,504"
                            ],
                            [
                              "Losses (gains) on crypto assets held for investment, net",
                              "596,651",
                              "(650,429)"
                            ],
                            [
                              "Other expense (income), net(1)",
                              "6,188",
                              "(45,605)"
                            ],
                            [
                              "Adjusted EBITDA",
                              "$929,868",
                              "$1,014,292"
                            ]
                          ]
                        },
                        "491": {
                          "textsmall": "__________________"
                        },
                        "492": {
                          "textsmall": "(1)See Note 13. Other expense (income), net of the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details."
                        },
                        "493": {
                          "title": "Liquidity and Capital Resources",
                          "class": "predicted header",
                          "contents": {
                            "494": {
                              "text": "There have been no material changes to our liquidity and capital resources from those presented in the Annual Report, other than those described below."
                            },
                            "495": {
                              "text": "We continue to believe our existing cash and cash equivalents and USDC will be sufficient in both the short and long term to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements. Our ability to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements, will depend on many factors, including market acceptance of crypto assets and blockchain technology, our growth, our ability to attract and retain customers on our platform, the continuing market acceptance of our products and services, the introduction of new subscription products and services on our platform, expansion of sales and marketing activities, and overall economic conditions. We anticipate satisfying our short-term cash requirements with our existing cash and cash equivalents and USDC and with future cash flows from operations and may satisfy our long-term cash requirements additionally with proceeds from a future equity or debt financing. The sale of additional equity would result in additional dilution to our stockholders. The incurrence of additional debt financing would result in debt service obligations, and the instruments governing such debt could provide for operating and financing covenants that would restrict our operations."
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "496": {
                  "title": "37",
                  "class": "predicted header",
                  "contents": {
                    "497": {
                      "title": "Table of Contents",
                      "class": "predicted header",
                      "contents": {
                        "498": {
                          "title": "Cash and cash equivalents and USDC",
                          "class": "predicted header",
                          "contents": {
                            "499": {
                              "text": "Our cash and cash equivalents and USDC balances consisted of the following (in thousands):"
                            },
                            "500": {
                              "table": [
                                [
                                  "",
                                  "March 31,",
                                  "December 31,"
                                ],
                                [
                                  "",
                                  "2025",
                                  "2024"
                                ],
                                [
                                  "Cash and cash equivalents",
                                  "",
                                  ""
                                ],
                                [
                                  "Cash equivalents(1)",
                                  "$6,153,826",
                                  "$6,607,023"
                                ],
                                [
                                  "Cash held at financial institutions",
                                  "1,761,826",
                                  "1,848,700"
                                ],
                                [
                                  "Cash held at venues",
                                  "135,517",
                                  "88,180"
                                ],
                                [
                                  "Total cash and cash equivalents",
                                  "$8,051,169",
                                  "$8,543,903"
                                ],
                                [
                                  "USDC(2)",
                                  "",
                                  ""
                                ],
                                [
                                  "USDC not loaned or pledged as collateral",
                                  "1,861,425",
                                  "743,181"
                                ],
                                [
                                  "USDC pledged as collateral(3)",
                                  "300,897",
                                  "329,832"
                                ],
                                [
                                  "USDC loaned(3)",
                                  "62,732",
                                  "168,795"
                                ],
                                [
                                  "Total USDC",
                                  "$2,225,054",
                                  "$1,241,808"
                                ]
                              ]
                            },
                            "501": {
                              "table": [
                                [
                                  "",
                                  "Three Months Ended March 31,",
                                  "Three Months Ended March 31,"
                                ],
                                [
                                  "",
                                  "2025",
                                  "2024"
                                ],
                                [
                                  "Net cash (used in) provided by operating activities",
                                  "$(182,727)",
                                  "$411,485"
                                ],
                                [
                                  "Net cash used in investing activities",
                                  "(231,653)",
                                  "(125,681)"
                                ],
                                [
                                  "Net cash (used in) provided by financing activities",
                                  "(893,802)",
                                  "1,927,721"
                                ],
                                [
                                  "Net (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents",
                                  "$(1,308,182)",
                                  "$2,213,525"
                                ],
                                [
                                  "Change in customer custodial cash and cash equivalents",
                                  "$(830,946)",
                                  "$609,802"
                                ]
                              ]
                            },
                            "502": {
                              "table": [
                                [
                                  "",
                                  "",
                                  "Incorporated by Reference",
                                  "Incorporated by Reference",
                                  "Incorporated by Reference",
                                  "Incorporated by Reference",
                                  "Filed or Furnished Herewith"
                                ],
                                [
                                  "Exhibit\nNumber",
                                  "Description",
                                  "Form",
                                  "File No.",
                                  "Exhibit",
                                  "Filing Date",
                                  "Filed or Furnished Herewith"
                                ],
                                [
                                  "31.1",
                                  "Certification of Principal Executive Officer pursuant to Rules 13a-14(a) and 15d-14(a) under the Exchange Act, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "31.2",
                                  "Certification of Principal Financial Officer pursuant to Rules 13a-14(a) and 15d-14(a) under the Exchange Act, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "32.1*",
                                  "Certification of Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "32.2*",
                                  "Certification of Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.INS",
                                  "Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.SCH",
                                  "Inline XBRL Taxonomy Extension Schema Document",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.CAL",
                                  "Inline XBRL Taxonomy Extension Calculation Linkbase Document",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.DEF",
                                  "Inline XBRL Taxonomy Extension Definition Linkbase Document",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.LAB",
                                  "Inline XBRL Taxonomy Extension Label Linkbase Document",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "101.PRE",
                                  "Inline XBRL Taxonomy Extension Presentation Linkbase Document",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ],
                                [
                                  "104",
                                  "The cover page from the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2025, formatted as in iXBRL and contained in Exhibit 101",
                                  "",
                                  "",
                                  "",
                                  "",
                                  "X"
                                ]
                              ]
                            },
                            "503": {
                              "text": "* The certifications furnished in Exhibits 32.1 and 32.2 hereto are deemed to accompany this Quarterly Report on Form 10-Q and are not deemed “filed” for purposes of Section 18 of the Exchange Act, or otherwise subject to the liability of that section, nor shall they be deemed incorporated by reference into any filing under the Securities Act of the Exchange Act."
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "504": {
                  "title": "106",
                  "class": "predicted header",
                  "contents": {
                    "505": {
                      "title": "Table of Contents",
                      "class": "predicted header"
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "506": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "507": {
          "text": "Pursuant to the requirements of the Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized."
        },
        "508": {
          "table": [
            [
              "",
              "COINBASE GLOBAL, INC.",
              "COINBASE GLOBAL, INC."
            ],
            [
              "Date: May 8, 2025",
              "By:",
              "/s/ Brian Armstrong"
            ],
            [
              "",
              "",
              "Brian Armstrong\nChief Executive Officer and Director\n(Principal Executive Officer)"
            ],
            [
              "Date: May 8, 2025",
              "By:",
              "/s/ Alesia J. Haas"
            ],
            [
              "",
              "",
              "Alesia J. Haas\nChief Financial Officer \n(Principal Financial Officer)"
            ]
          ]
        },
        "509": {
          "title": "107",
          "class": "predicted header"
        }
      }
    }
  }
}