{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "table": []
        },
        "1": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "2": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "3": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header",
          "contents": {
            "4": {
              "table": []
            }
          }
        },
        "5": {
          "title": "FORM 8-K",
          "class": "predicted header",
          "contents": {
            "6": {
              "table": []
            }
          }
        },
        "7": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "8": {
              "title": "Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "9": {
              "title": "Date of Report (Date of earliest event reported): August 8, 2025",
              "class": "predicted header",
              "contents": {
                "10": {
                  "table": []
                }
              }
            },
            "11": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "12": {
                  "title": "(Exact name of registrant as specified in its charter)",
                  "class": "predicted header",
                  "contents": {
                    "13": {
                      "table": []
                    },
                    "14": {
                      "table": [
                        [
                          "Delaware",
                          "001-40289",
                          "46-4707224"
                        ],
                        [
                          "(State or other jurisdiction\nof incorporation)",
                          "(Commission\nFile Number)",
                          "(IRS Employer\nIdentification No.)"
                        ]
                      ]
                    },
                    "15": {
                      "table": [
                        [
                          "One Madison Avenue\nSuite 2400\nNew York, NY",
                          "10010"
                        ],
                        [
                          "(Address of principal executive offices)1",
                          "(Zip Code)1"
                        ]
                      ]
                    },
                    "16": {
                      "title": "Not Applicable",
                      "class": "predicted header"
                    }
                  }
                },
                "17": {
                  "title": "(Registrant’s telephone number, including area code)",
                  "class": "predicted header",
                  "contents": {
                    "18": {
                      "textsmall": "1"
                    }
                  }
                }
              }
            },
            "19": {
              "title": "Not Applicable",
              "class": "predicted header",
              "contents": {
                "20": {
                  "title": "(Former name or former address, if changed since last report)",
                  "class": "predicted header",
                  "contents": {
                    "21": {
                      "table": []
                    },
                    "22": {
                      "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instructions A.2. below):"
                    },
                    "23": {
                      "title": "☐ Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                      "class": "predicted header"
                    },
                    "24": {
                      "title": "☐ Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                      "class": "predicted header"
                    },
                    "25": {
                      "title": "☐ Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                      "class": "predicted header"
                    },
                    "26": {
                      "title": "☐ Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                      "class": "predicted header",
                      "contents": {
                        "27": {
                          "text": "Securities registered pursuant to Section 12(b) of the Act:"
                        },
                        "28": {
                          "table": [
                            [
                              "Title of each class",
                              "Trading Symbol(s)",
                              "Name of each exchange on which registered"
                            ],
                            [
                              "Class A common stock, $0.00001 par value",
                              "COIN",
                              "The Nasdaq Stock Market LLC"
                            ]
                          ]
                        },
                        "29": {
                          "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter)."
                        },
                        "30": {
                          "text": "Emerging growth company  ☐"
                        },
                        "31": {
                          "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                        },
                        "32": {
                          "textsmall": "1 We are a remote-first company. Accordingly, we do not maintain a headquarters. We are including this address solely for the purpose of satisfying the Securities and Exchange Commission’s request. Stockholder communications may also be sent to the email address: secretary@coinbase.com."
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "33": {
      "title": "Item 1.01 Entry into a Material Definitive Agreement.",
      "standardized_title": "item1.01",
      "class": "item",
      "contents": {
        "34": {
          "title": "Convertible Notes and the Indentures",
          "class": "predicted header",
          "contents": {
            "35": {
              "text": "On August 8, 2025, Coinbase Global, Inc. (the “Company”) completed its previously announced private offering of $1.5 billion aggregate principal amount of 0% Convertible Senior Notes due 2029 (the “2029 Notes”) and $1.5 billion aggregate principal amount of 0% Convertible Senior Notes due 2032 (the “2032 Notes” and, together with the 2029 Notes, the “Notes”), which includes the full exercise by the Initial Purchasers (as defined below) of their options to purchase up to an additional $200.0 million aggregate principal amount of the 2029 Notes and $200.0 million aggregate principal amount of the 2032 Notes. The Notes are senior unsecured obligations of the Company. Each series of Notes was issued pursuant to a separate indenture, each dated August 8, 2025 (each an “Indenture” and together, the “Indentures”), between the Company and U.S. Bank Trust Company, National Association, as trustee (the “Trustee”). The Indentures include customary covenants and set forth certain events of default upon which the relevant series of Notes may be declared immediately due and payable and set forth certain types of bankruptcy or insolvency events of default involving the Company upon which Notes of the relevant series become automatically due and payable."
            },
            "36": {
              "text": "The 2029 Notes will mature on October 1, 2029 and the 2032 Notes will mature on October 1, 2032, unless earlier converted, repurchased or, in the case of the 2032 Notes, redeemed. The Notes will not bear regular interest, and the principal amount of the Notes will not accrete. The Notes will be convertible at the option of the holders at any time prior to the close of business on the business day immediately preceding July 2, 2029, in the case of the 2029 Notes, and immediately preceding July 1, 2032, in the case of the 2032 Notes, only in the following circumstances: (1) during any calendar quarter commencing after the calendar quarter ending on December 31, 2025, if the last reported sale price per share of the Company’s Class A common stock, par value $0.00001 per share (the “Class A Common Stock”) exceeds 130% of the conversion price for the relevant series of Notes for each of at least 20 trading days during the 30 consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter; (2) during the five consecutive business days immediately after any ten consecutive trading day period (such ten consecutive trading day period, the “measurement period”) in which the trading price (as defined in the applicable Indenture) per $1,000 principal amount of the 2029 Notes or the 2032 Notes, as applicable, for each trading day of the measurement period was less than 98% of the product of the last reported sale price per share of the Class A Common Stock on each such trading day and the conversion rate for the relevant series of Notes on each such trading day; (3) upon the occurrence of certain corporate events or distributions on Class A Common Stock; and (4) in the case of the 2032 Notes, if the Company calls any such 2032 Note for redemption. Additionally, holders of the relevant series of Notes may convert all or a portion of their Notes of such series at any time from, and including, July 2, 2029, in the case of the 2029 Notes, and July 1, 2032, in the case of the 2032 Notes, until the close of business on the second scheduled trading day immediately before the relevant maturity date, in multiples of $1,000 principal amount, at the option of the relevant holder regardless of the foregoing circumstances. Upon conversion, the Company may satisfy its conversion obligation by paying or delivering, as applicable, cash, shares of Class A Common Stock or a combination of cash and shares of Class A Common Stock, at the Company’s election, in the manner and subject to the terms and conditions provided in the applicable Indenture."
            },
            "37": {
              "text": "The initial conversion rate for the 2029 Notes is 2.2005 shares of Class A Common Stock per $1,000 principal amount of the 2029 Notes, which represents an initial conversion price of approximately $454.44 per share of Class A Common Stock, and the initial conversion rate for the 2032 Notes is 2.5327 shares of Class A Common Stock per $1,000 principal amount of the 2032 Notes, which represents an initial conversion price of approximately $394.84 per share of Class A Common Stock. The initial conversion price of the 2029 Notes represents a premium of approximately 52.5% to the $297.99 per share last reported sale price of the Class A Common Stock on August 5, 2025, and the initial conversion price of the 2032 Notes represents a premium of approximately 32.5% to the $297.99 per share last reported sale price of the Class A Common Stock on August 5, 2025. The conversion rate for each series of Notes will be subject to customary adjustments under certain circumstances in accordance with the terms of the applicable Indenture. In addition, if certain corporate events that constitute a “Make-Whole Fundamental Change” (as defined in the Indentures) occur, then the Company will in certain circumstances increase the conversion rate for each series of Notes for a specified period of time."
            },
            "38": {
              "text": "The Company may not redeem the 2029 Notes prior to the maturity date of the 2029 Notes. The Company may redeem all or any portion of the 2032 Notes (subject to certain limitations), at its option at any time, and from time to time, on or after October 1, 2029, and on or before the 20th scheduled trading day immediately before the maturity date of the 2032 Notes, if the last reported sale price per share of Class A Common Stock exceeds 130% of the conversion price then in effect for the 2032 Notes on (1) each of at least 20 trading days (whether or not consecutive) during the 30 consecutive trading days ending on, and including, the trading day immediately before the date the Company sends the related redemption notice and (2) the trading day immediately before the date the Company sends such notice, at a redemption price equal to 100% of the principal amount of the 2032 Notes to be redeemed, plus any accrued and unpaid special interest and additional interest, if any, to, but excluding, the redemption date. No sinking fund is provided for the Notes, which means that the Company is not required to redeem or retire the Notes periodically."
            },
            "39": {
              "text": "Subject to a limited exception, holders of the relevant series of Notes will have the right to require the Company to repurchase for cash all or a portion of their Notes of such series upon the occurrence of a fundamental change (as defined in the applicable Indenture governing such series of Notes) at a purchase price equal to the principal amount of the Notes to be repurchased, plus accrued and unpaid special interest and additional interest, if any, to, but excluding, the fundamental change repurchase date."
            },
            "40": {
              "text": "The Notes will be the Company’s senior, unsecured obligations and will be equal in right of payment with the Company’s existing and future senior, unsecured indebtedness, including its outstanding 0.50% Convertible Senior Notes due 2026 (the “2026 Notes”), 3.375% Senior Notes due 2028 (the “2028 Notes”), 3.625% Senior Notes due 2031 (the “2031 Notes”) and 0.25% Convertible Senior Notes due 2030 (the “2030 Notes” and, together with the 2026 Notes, 2028 Notes and 2031 Notes, the “Outstanding Notes”), senior in right of payment to the Company’s existing and future indebtedness that is expressly subordinated to the Notes and effectively subordinated to the Company’s existing and future secured indebtedness, to the extent of the value of the collateral securing that indebtedness. The Notes will be structurally subordinated to all existing and future indebtedness (including the guarantees of the 2028 Notes and the 2031 Notes by Coinbase, Inc.) and other liabilities, including trade payables, and (to the extent we are not a holder thereof) preferred equity, if any, of the Company’s subsidiaries."
            },
            "41": {
              "text": "The following events are considered “events of default” with respect to the Notes under each Indenture, which may result in the acceleration of the maturity of Notes of such series:"
            },
            "42": {
              "text": "(1) a default by the Company in the payment when due (whether at maturity, upon redemption or repurchase upon fundamental change or otherwise) of the principal of, or the redemption price or fundamental change repurchase price for, any Note of such series;"
            },
            "43": {
              "text": "(2) a default by the Company for 30 days in the payment when due of any special interest or additional interest on any Note of such series;"
            },
            "44": {
              "text": "(3) failure by the Company to deliver, when required by the relevant Indenture, a fundamental change notice or a notice of specified corporate events with respect to the Notes of such series, in each case when due, and such failure continues for one business day after its occurrence;"
            },
            "45": {
              "text": "(4) a default by the Company in its obligation to convert a Note of such series in accordance with the relevant Indenture upon the exercise of the conversion right with respect thereto, if such default is not cured within three business days after its occurrence;"
            },
            "46": {
              "text": "(5) a default by the Company of any of its obligations with respect to consolidation, merger, sale, lease, and transfer, in one transaction or a series of transactions, of all or substantially all of the assets of the Company and its subsidiaries, taken as a whole;"
            },
            "47": {
              "text": "(6) a default by the Company in any of its obligations or agreements under the relevant Indenture or the relevant series of Notes (other than a default set forth in paragraphs (1), (2), (3), (4) or (5) above) where such default is not cured or waived within 60 days after notice to the Company by the Trustee, or to the Company and the Trustee by"
            },
            "48": {
              "text": "holders of at least 25% of the aggregate principal amount of the Notes of such series then outstanding, which notice must specify such default, demand that it be remedied and state that such notice is a “notice of default”;"
            },
            "49": {
              "text": "(7) a default by the Company or any of its significant subsidiaries (as defined in the Indentures) with respect to any one or more mortgages, agreements or other instruments under which there is outstanding, or by which there is secured or evidenced, any indebtedness for money borrowed (other than non-recourse indebtedness) of at least $200.0 million (or its foreign currency equivalent) in the aggregate of the Company or any of subsidiaries, whether such indebtedness exists as of the date the Company first issued the Notes or is thereafter created, where such default (i) constitutes a failure to pay the principal of, or premium or special interest or additional interest on, any of such indebtedness when due and payable at its stated maturity, upon required repurchase, upon declaration of acceleration or otherwise or (ii) results in such indebtedness becoming or being declared due and payable before its stated maturity; and in each case of either clause (i) or (ii) above, where such default is not cured or waived within 30 days after notice to the Company by the Trustee or to the Company and the Trustee by holders of at least 25% of the aggregate principal amount of the Notes of such series then outstanding; and"
            },
            "50": {
              "text": "(8) certain events of bankruptcy, insolvency and reorganization with respect to the Company or any significant subsidiary."
            },
            "51": {
              "text": "If an event of default described in paragraph (8) above occurs with respect to the Company (and not solely with respect to a significant subsidiary of the Company), then the principal amount of, and all accrued and unpaid special interest or additional interest, if any, on, all of the Notes of each series then outstanding will immediately become due and payable without any further action or notice by any person. If an event of default with respect to a series of Notes (other than an event of default described in paragraph (8) above with respect to the Company and not solely with respect to a significant subsidiary of the Company) occurs and is continuing, then, except with respect to situations involving special interest as the sole remedy for certain reporting defaults, the Trustee, by notice to the Company, or holders of at least 25% of the aggregate principal amount of Notes of such series then outstanding, by notice to the Company and the Trustee, may declare the principal amount of, and all accrued and unpaid special interest or additional interest, if any, on, all of the Notes of such series then outstanding to become due and payable immediately."
            },
            "52": {
              "text": "Copies of the Indentures, the form of 2029 Note and the form of 2032 Note are attached as Exhibits 4.1, 4.2, 4.3, and 4.4, respectively, to this Current Report on Form 8-K and are incorporated herein by reference. The foregoing description of the Indentures and the Notes do not purport to be complete and is qualified in its entirety by reference to the full text in such exhibits."
            },
            "53": {
              "text": "The net proceeds from this offering were approximately $2,957.1 million, including the exercise in full of the Initial Purchasers’ options to purchase an additional $200.0 million aggregate principal amount of the 2029 Notes and $200.0 million aggregate principal amount of the 2032 Notes, after deducting the Initial Purchasers’ discounts and commissions and the Company’s estimated offering expenses. The Company used approximately $224.3 million of the net proceeds from the offering to pay the cost of the Capped Call Transactions (as defined below). The Company intends to use the remainder of the net proceeds from the offering for general corporate purposes, which may include working capital, capital expenditures and investments in and acquisitions of other companies, products or technologies that it may identify from time to time, as well as to repurchase, repay at maturity, or repurchase or redeem prior to maturity, as applicable, from time to time and subject to market conditions, shares of Class A Common Stock and/or the Outstanding Notes."
            }
          }
        },
        "54": {
          "title": "Capped Call Transactions",
          "class": "predicted header",
          "contents": {
            "55": {
              "text": "On August 5, 2025, in connection with the pricing of the Notes, and on August 6, 2025, in connection with the full exercise by the Initial Purchasers of their option to purchase additional Notes pursuant to the Purchase Agreement (as defined below), the Company entered into privately negotiated capped call transactions relating to each series of Notes (the “Capped Call Transactions”) with certain financial institutions (the “Option Counterparties”). The Capped Call Transactions relating to the 2029 Notes have an initial strike price of approximately $454.44 per share, subject to adjustments, which corresponds to the approximate initial conversion price of the 2029 Notes, and the"
            },
            "56": {
              "text": "Capped Call Transactions relating to the 2032 Notes have an initial strike price of approximately $394.84 per share, subject to adjustments, which corresponds to the approximate initial conversion price of the 2032 Notes. The Capped Call Transactions relating to the 2029 Notes cover, subject to customary adjustments, the number of shares of Class A Common Stock that initially underlie the 2029 Notes, and the Capped Call Transactions relating to the 2032 Notes cover, subject to customary adjustments, the number of shares of Class A Common Stock that initially underlie the 2032 Notes. The Capped Call Transactions are expected generally to reduce the potential dilution to the Class A Common Stock upon any conversion of the relevant series of Notes and/or offset any potential cash payments the Company would be required to make in excess of the principal amount of converted Notes of such series, as the case may be, in the event that the market price of the Company’s Class A Common Stock, as measured under the terms of the Capped Call Transactions, is greater than the applicable strike price of the Capped Call Transactions, which initially corresponds to the conversion price of the applicable series of Notes and is subject to anti-dilution adjustments. If, however, the market price per share of Class A Common Stock, as measured under the terms of the Capped Call Transactions, exceeds the applicable cap price of the Capped Call Transactions, there would nevertheless be dilution and/or there would not be an offset of such potential cash payments, in each case, to the extent that the then-market price per share of the Class A Common Stock exceeds the cap price of the Capped Call Transactions. The cap price of the Capped Call Transactions is initially approximately $595.98 per share, which represents a premium of 100% over the last reported sale price of the Class A Common Stock of $297.99 per share on August 5, 2025, and is subject to certain adjustments under the terms of the Capped Call Transactions. The Capped Call Transactions are subject to either adjustment or termination upon the occurrence of specified extraordinary events affecting the Company, including a merger; a tender offer; and a nationalization, insolvency, or delisting involving the Company. In addition, the Capped Call Transactions are subject to certain specified additional disruption events that may give rise to a termination of the Capped Call Transactions, including changes in law; insolvency filings and hedging disruptions."
            },
            "57": {
              "text": "The Capped Call Transactions are separate transactions entered into by the Company with the Option Counterparties and are not part of the terms of the Notes and will not affect any holder’s rights under the Notes. Holders of the Notes will not have any rights with respect to the Capped Call Transactions."
            },
            "58": {
              "text": "A copy of the form of the Capped Call Transaction confirmation is attached as Exhibit 10.1 to this Current Report on Form 8-K and is incorporated herein by reference. The foregoing description of the Capped Call Transaction confirmation does not purport to be complete and is qualified in its entirety by reference to the full text in such exhibit."
            }
          }
        }
      }
    },
    "59": {
      "title": "Item 2.03 Creation of a Direct Financial Obligation or an Obligation under an Off-Balance Sheet Arrangement of a Registrant.",
      "standardized_title": "item2.03",
      "class": "item",
      "contents": {
        "60": {
          "text": "The information set forth under Item 1.01 of this Current Report on Form 8-K is incorporated herein by reference."
        }
      }
    },
    "61": {
      "title": "Item 3.02 Unregistered Sales of Equity Securities.",
      "standardized_title": "item3.02",
      "class": "item",
      "contents": {
        "62": {
          "text": "The information set forth under Items 1.01 and 8.01 of this Current Report on Form 8-K is incorporated herein by reference."
        },
        "63": {
          "text": "The Company offered and sold the Notes to the Initial Purchasers in reliance on the exemption from the registration requirements provided by Section 4(a)(2) of the Securities Act of 1933, as amended (the “Securities Act”), and for resale by the Initial Purchasers to persons reasonably believed to be “qualified institutional buyers,” as defined in and pursuant to the exemption from registration requirements provided by Rule 144A under the Securities Act. The Company relied on these exemptions from registration based in part on representations made by the Initial Purchasers in the Purchase Agreement pursuant to which the Company sold the Notes to the Initial Purchasers. The shares of Class A Common Stock issuable upon conversion of the Notes, if any, have not been registered under the Securities Act and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements."
        },
        "64": {
          "text": "Initially, (i) a maximum of 5,033,700 shares of Class A Common Stock may be issued upon conversion of the 2029 Notes, based on the initial maximum conversion rate of 3.3558 shares of Class A Common Stock per $1,000 principal amount of 2029 Notes, which is subject to customary anti-dilution adjustment provisions, and (ii) a maximum of 5,033,700 shares of Class A Common Stock may be issued upon conversion of the 2032 Notes, based on the initial maximum conversion rate of 3.3558 shares of Class A Common Stock per $1,000 principal amount of 2032 Notes, which is subject to customary anti-dilution adjustment provisions."
        },
        "65": {
          "text": "To the extent that any shares of Class A Common Stock are issued upon conversion of the Notes, they will be issued in transactions anticipated to be exempt from registration under the Securities Act by virtue of Section 3(a)(9) thereof, because no commission or other remuneration is expected to be paid in connection with conversion of the Notes and any resulting issuance of shares of Class A Common Stock."
        }
      }
    },
    "66": {
      "title": "Item 8.01 Other Events.",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "67": {
          "title": "Purchase Agreement",
          "class": "predicted header",
          "contents": {
            "68": {
              "text": "On August 5, 2025, the Company entered into a purchase agreement (the “Purchase Agreement”) with J.P. Morgan Securities LLC, as representative of the several initial purchasers named therein (collectively, the “Initial Purchasers”), to issue and sell the Notes. The Initial Purchasers exercised their options under the Purchase Agreement to purchase up to an additional $200.0 million aggregate principal amount of the 2029 Notes and $200.0 million aggregate principal amount of the 2032 Notes in full on August 6, 2025. The Purchase Agreement includes customary representations, warranties, and covenants by the Company and customary closing conditions. Under the terms of the Purchase Agreement, the Company has agreed to indemnify the Initial Purchasers against certain liabilities."
            }
          }
        }
      }
    },
    "69": {
      "title": "Item 9.01   Financial Statements and Exhibits.",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "70": {
          "title": "(d) Exhibits",
          "class": "predicted header",
          "contents": {
            "71": {
              "table": [
                [
                  "Exhibit No.",
                  "Description"
                ],
                [
                  "4.1",
                  "Indenture, dated as of August 8, 2025, between Coinbase Global, Inc. and U.S. Bank Trust Company, National Association, as trustee."
                ],
                [
                  "4.2",
                  "Form of 0% Convertible Senior Notes due 2029 (included in Exhibit 4.1)."
                ],
                [
                  "4.3",
                  "Indenture, dated as of August 8, 2025, between Coinbase Global, Inc. and U.S. Bank Trust Company, National Association, as trustee."
                ],
                [
                  "4.4",
                  "Form of 0% Convertible Senior Notes due 2032 (included in Exhibit 4.3)."
                ],
                [
                  "10.1",
                  "Form of Capped Call Transaction Confirmation."
                ],
                [
                  "104",
                  "The cover page from this Current Report on Form 8-K, formatted in Inline XBRL."
                ]
              ]
            }
          }
        }
      }
    },
    "72": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "73": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "74": {
          "table": [
            [
              "",
              "COINBASE GLOBAL, INC.",
              "COINBASE GLOBAL, INC."
            ],
            [
              "Dated: August 8, 2025",
              "By:",
              "/s/ Alesia J. Haas"
            ],
            [
              "",
              "",
              "Alesia J. Haas"
            ],
            [
              "",
              "",
              "Chief Financial Officer"
            ]
          ]
        }
      }
    }
  }
}