{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "table": []
        },
        "1": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "2": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "3": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header",
          "contents": {
            "4": {
              "table": []
            }
          }
        },
        "5": {
          "title": "FORM 8-K",
          "class": "predicted header",
          "contents": {
            "6": {
              "table": []
            }
          }
        },
        "7": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "8": {
              "title": "Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "9": {
              "title": "Date of Report (Date of earliest event reported): May 21, 2021",
              "class": "predicted header",
              "contents": {
                "10": {
                  "table": []
                }
              }
            },
            "11": {
              "title": "Coinbase Global, Inc.",
              "class": "predicted header",
              "contents": {
                "12": {
                  "title": "(Exact name of registrant as specified in its charter)",
                  "class": "predicted header",
                  "contents": {
                    "13": {
                      "table": []
                    },
                    "14": {
                      "table": [
                        [
                          "Delaware",
                          "001-40289",
                          "46-4707224"
                        ],
                        [
                          "(State or other jurisdiction\nof incorporation)",
                          "(Commission\nFile Number)",
                          "(IRS Employer\nIdentification No.)"
                        ]
                      ]
                    },
                    "15": {
                      "table": [
                        [
                          "Address Not Applicable",
                          "Address Not Applicable"
                        ],
                        [
                          "(Address of principal executive offices)",
                          "(Zip Code)"
                        ]
                      ]
                    },
                    "16": {
                      "title": "Not Applicable",
                      "class": "predicted header"
                    }
                  }
                },
                "17": {
                  "title": "(Registrant’s telephone number, including area code)",
                  "class": "predicted header"
                }
              }
            },
            "18": {
              "title": "Not Applicable",
              "class": "predicted header",
              "contents": {
                "19": {
                  "title": "(Former name or former address, if changed since last report)",
                  "class": "predicted header",
                  "contents": {
                    "20": {
                      "table": []
                    },
                    "21": {
                      "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instructions A.2. below):"
                    },
                    "22": {
                      "title": "☐ Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                      "class": "predicted header"
                    },
                    "23": {
                      "title": "☐ Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                      "class": "predicted header"
                    },
                    "24": {
                      "title": "☐ Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                      "class": "predicted header"
                    },
                    "25": {
                      "title": "☐ Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                      "class": "predicted header",
                      "contents": {
                        "26": {
                          "text": "Securities registered pursuant to Section 12(b) of the Act:"
                        },
                        "27": {
                          "table": [
                            [
                              "Title of each class",
                              "Trading Symbol(s)",
                              "Name of each exchange on which registered"
                            ],
                            [
                              "Class A common stock, $0.00001 par value",
                              "COIN",
                              "Nasdaq Global Select Market"
                            ]
                          ]
                        },
                        "28": {
                          "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter)."
                        },
                        "29": {
                          "text": "Emerging growth company  ☐"
                        },
                        "30": {
                          "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "31": {
      "title": "Item 5.01.    Change in Control of Registrant",
      "standardized_title": "item5.01",
      "class": "item",
      "contents": {
        "32": {
          "text": "On or about May 21, 2021, Brian Armstrong, the Chairman, Chief Executive Officer and Co-Founder of Coinbase Global, Inc. (the “Company”), became the beneficial owner of approximately [52.2]% of the total voting power of the Company’s outstanding capital stock as of May 21, 2021. Mr. Armstrong’s voting power increased to over 50% of the total voting power of the Company as a result of sales and/or transfers by other stockholders of the Company of Class B common stock, which pursuant to the terms of the Company’s Restated Certificate of Incorporation resulted in the conversion of their shares from Class B common stock (which is entitled to twenty votes per share) to Class A common stock (which is entitled to one vote per share), effectively decreasing the voting power percentages of such other stockholders relative to Mr. Armstrong. Such change was not the result of any purchase of the Company’s capital stock by Mr. Armstrong. As a result of future sales or issuances of capital stock by the Company, and/or exercises, settlements or conversions of options, warrants or restricted stock units, and additional conversions of Class B common stock into shares of Class A common stock, Mr. Armstrong’s voting power will fluctuate and may in the future decrease below, and then back above, 50% of the total voting power of the Company."
        },
        "33": {
          "text": "Pursuant to the Company’s Restated Certificate of Incorporation and Restated Bylaws, following the certification of Mr. Armstrong’s voting power by the Company upon the direction of the Company’s Board of Directors (the “Board”), (i) the Board will no longer be divided into three classes with staggered three-year terms and all directors will be elected for annual terms; (ii) a majority vote of all the directors then in office rather than the affirmative vote of all of the directors then in office will be required for the nomination of directors for election to the Board, or to fill vacancies or newly created directorships resulting from any increase in the authorized number of directors on the Board; (iii) the Company’s stockholders will be able to remove directors with or without cause by the affirmative vote of the holders of a majority of the voting power of all of the then-outstanding shares rather than only for cause and only by the affirmative vote of the holders of at least two-thirds of the voting power of all of the then-outstanding shares; (iv) the Company’s stockholders will be permitted to take action by written consent; (v) a majority vote of the total number of authorized directors rather than the affirmative vote of all of the directors then in office will be required to adopt, amend, or repeal a provision inconsistent with Section 1.12.1(a) or Section 1.12.3 of Article I of the Company’s Restated Bylaws; and (vi) the Company’s stockholders will be permitted to adopt, amend or repeal any provision of the Restated Bylaws by the affirmative vote of the holders of a majority of the voting power of all of the then-outstanding shares rather than either the affirmative vote of at least 66-2/3% of the voting power of all of the then-outstanding shares or, only in the event that such proposed adoption, amendment, or repeal of any provision has been approved by two-thirds of the total number of authorized directors, the affirmative vote of the holders of a majority of the voting power of all of the then-outstanding shares. The Company expects to certify Mr. Armstrong’s voting power upon the direction of the Board in the near term."
        },
        "34": {
          "text": "There are no arrangements known to the Company, the operation of which may, at a subsequent date, result in a change in control of the Company."
        }
      }
    },
    "35": {
      "title": "Item 8.01.    Other Events",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "36": {
          "text": "On May 26, 2021, pursuant to that certain purchase agreement, dated as of May 18, 2021 (the “Purchase Agreement”), with Goldman Sachs & Co. LLC and J.P. Morgan Securities LLC, as representative of the several initial purchasers named therein (collectively, the “Initial Purchasers”), pursuant to which the Company previously issued its 0.05% Convertible Senior Notes due 2026 (the “Notes”), the Initial Purchasers notified the Company of their exercise of their 30-day option to purchase an additional $187.5 million principal amount of Notes (the “Additional Notes”), as set forth in the Purchase Agreement, and on May 26, 2021, the Company issued and sold the Additional Notes to the Initial Purchasers."
        },
        "37": {
          "text": "In connection with the exercise by the Initial Purchasers of their option to purchase the Additional Notes, on May 26, 2021, the Company entered into privately negotiated capped call transactions (the “Additional Capped Call Transactions”) with each of Bank of America, N.A., Bank of Montreal, Citibank, N.A., JPMorgan Chase Bank, National Association, Goldman Sachs & Co. LLC and Mizuho Markets Americas LLC (the “Option Counterparties”). The Additional Capped Call Transactions were made on substantially identical terms as the private negotiated capped call transactions the Company entered into with the Option Counterparties on May 18, 2021, as described in the Company’s Current Report on Form 8-K dated as of May 21, 2021."
        },
        "38": {
          "text": "The Additional Capped Call Transactions are separate transactions entered into by the Company with the Option Counterparties, and are not part of the terms of the Notes and will not affect any holder’s rights under the Notes. Holders of the Notes will not have any rights with respect to the Additional Capped Call Transactions."
        },
        "39": {
          "text": "The foregoing descriptions of the Additional Capped Call Transactions are qualified in their entirety by the copy of the form of call option transaction confirmation relating to the Additional Capped Call Transactions, which is incorporated herein by reference. A copy of the form of call option transaction confirmation was filed as Exhibit 10.1 to the Company’s Current Report on Form 8-K dated as of May 21, 2021."
        }
      }
    },
    "40": {
      "title": "Item 9.01.Financial Statements and Exhibits.",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "41": {
          "title": "(d) Exhibits",
          "class": "predicted header",
          "contents": {
            "42": {
              "table": [
                [
                  "Exhibit",
                  "Description"
                ],
                [
                  "104",
                  "The cover page from this Current Report on Form 8-K, formatted in Inline XBRL."
                ]
              ]
            }
          }
        }
      }
    },
    "43": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "44": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized."
        },
        "45": {
          "table": [
            [
              "",
              "COINBASE GLOBAL, INC.",
              "COINBASE GLOBAL, INC."
            ],
            [
              "Date: May 26, 2021",
              "By:",
              "/s/ Alesia J. Haas"
            ],
            [
              "",
              "",
              "Alesia J. Haas"
            ],
            [
              "",
              "",
              "Chief Financial Officer"
            ]
          ]
        }
      }
    }
  }
}