{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported) April 7, 2020 (April 6, 2020)",
              "class": "predicted header"
            }
          }
        },
        "8": {
          "title": "AT&T INC.",
          "class": "predicted header",
          "contents": {
            "9": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "10": {
                  "table": [
                    [
                      "Delaware",
                      "001-08610",
                      "43-1301883"
                    ],
                    [
                      "(State or Other Jurisdiction\n of Incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "11": {
                  "table": [
                    [
                      "208 S. Akard St., Dallas, Texas",
                      "75202"
                    ],
                    [
                      "(Address of Principal Executive Offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "12": {
              "title": "Registrant’s telephone number, including area code (210) 821-4105",
              "class": "predicted header",
              "contents": {
                "13": {
                  "textsmall": "(Former Name or Former Address, if Changed Since Last Report)"
                },
                "14": {
                  "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instruction A.2. below):"
                },
                "15": {
                  "text": "☐Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)"
                },
                "16": {
                  "text": "☐Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)"
                },
                "17": {
                  "text": "☐Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240-14d-2(b))"
                },
                "18": {
                  "text": "☐Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))"
                }
              }
            },
            "19": {
              "title": "Securities Registered Pursuant to Section 12(b) of the Act",
              "class": "predicted header",
              "contents": {
                "20": {
                  "table": [
                    [
                      "Title of each class",
                      "Trading\n Symbol(s)",
                      "Name of each exchange\n on which registered"
                    ],
                    [
                      "Common Shares (Par Value $1.00 Per Share)",
                      "T",
                      "New York Stock Exchange"
                    ],
                    [
                      "Depositary Shares, each representing a 1/1000th interest in a share of 5.000% Perpetual Preferred Stock, Series A",
                      "T PRA",
                      "New York Stock Exchange"
                    ],
                    [
                      "Depositary Shares, each representing a 1/1000th interest in a share of 4.750% Perpetual Preferred Stock, Series C",
                      "T PRC",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. Floating Rate Global Notes due August 3, 2020",
                      "T 20C",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.875% Global Notes due December 4, 2020",
                      "T 20",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.650% Global Notes due December 17, 2021",
                      "T 21B",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.450% Global Notes due June 1, 2022",
                      "T 22B",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.500% Global Notes due March 15, 2023",
                      "T 23",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.750% Global Notes due May 19, 2023",
                      "T 23C",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. Floating Rate Global Notes due September 5, 2023",
                      "T 23D",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.050% Global Notes due September 5, 2023",
                      "T 23E",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.300% Global Notes due September 5, 2023",
                      "T 23A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.950% Global Notes due September 15, 2023",
                      "T 23F",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.400% Global Notes due March 15, 2024",
                      "T 24A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 3.500% Global Notes due December 17, 2025",
                      "T 25",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 0.250% Global Notes due March 4, 2026",
                      "T 26E",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.800% Global Notes due September 5, 2026",
                      "T 26D",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.900% Global Notes due December 4, 2026",
                      "T 26A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.350% Global Notes due September 5, 2029",
                      "T 29D",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 4.375% Global Notes due September 14, 2029",
                      "T 29B",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.600% Global Notes due December 17, 2029",
                      "T 29A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 0.800% Global Notes due March 4, 2030",
                      "T 30B",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 3.550% Global Notes due December 17, 2032",
                      "T 32",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 5.200% Global Notes due November 18, 2033",
                      "T 33",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 3.375% Global Notes due March 15, 2034",
                      "T 34",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 2.450% Global Notes due March 15, 2035",
                      "T 35",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 3.150% Global Notes due September 4, 2036",
                      "T 36A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 1.800% Global Notes due September 14, 2039",
                      "T 39B",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 7.000% Global Notes due April 30, 2040",
                      "T 40",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 4.250% Global Notes due June 1, 2043",
                      "T 43",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 4.875% Global Notes due June 1, 2044",
                      "T 44",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 4.000% Global Notes due June 1, 2049",
                      "T 49A",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 4.250% Global Notes due March 1, 2050",
                      "T 50",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 5.350% Global Notes due November 1, 2066",
                      "TBB",
                      "New York Stock Exchange"
                    ],
                    [
                      "AT&T Inc. 5.625% Global Notes due August 1, 2067",
                      "TBC",
                      "New York Stock Exchange"
                    ]
                  ]
                },
                "21": {
                  "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter)."
                },
                "22": {
                  "text": "Emerging growth company  ☐"
                },
                "23": {
                  "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                }
              }
            }
          }
        }
      }
    },
    "24": {
      "title": "ITEM 1.01",
      "standardized_title": "item1.01",
      "class": "item",
      "contents": {
        "25": {
          "title": "Entry into a Material Definitive Agreement.",
          "class": "predicted header",
          "contents": {
            "26": {
              "text": "On April 6, 2020, AT&T Inc. (the “Company”) entered into a $5.5 billion Term Loan Credit Agreement (the “Term Loan”) with Bank of America, N.A., as agent. The proceeds of the Term Loan will be used for general corporate purposes."
            },
            "27": {
              "text": "Advances will bear interest, at the Company’s option, either:"
            },
            "28": {
              "text": "•at a variable annual rate (“Base Rate”) equal to: (i) the highest of (but not less than zero) (a) the prime rate quoted by The Wall Street Journal, (b) 0.5% per annum above the federal funds rate, and (c) the London interbank offered rate (or the successor thereto) (“LIBOR”) applicable to dollars for a period of one month plus 1.00%, plus (ii) 0.50%; or"
            },
            "29": {
              "text": "•at a rate (“Eurodollar Rate”) equal to: (i) LIBOR (adjusted upwards to reflect any bank reserve costs) for a period of one, two, three or six months, as applicable, plus (ii) 1.50%."
            },
            "30": {
              "text": "The Term Loan is not subject to amortization and the entire principal amount of the Term Loan will be due and payable on December 31, 2020."
            },
            "31": {
              "text": "The Term Loan contains certain representations and warranties and covenants, including a limitation on liens covenant and, beginning in the first full fiscal quarter ending after the closing date (i.e., the fiscal quarter ending September 30, 2020), a net debt-to-EBITDA  financial ratio covenant that the Company will maintain, as of the last day of each fiscal quarter, a ratio of not more than 3.5 to 1 of:"
            },
            "32": {
              "text": "(A) all items that would be treated under accounting principles generally accepted in the United States (“GAAP”) as specified in the Term Loan as indebtedness on the Company’s consolidated balance sheet minus the amount by which the sum of (i) 100% of unrestricted cash and cash equivalents held by the Company and its subsidiaries in the United States, and funds available on demand by the Company and its subsidiaries in the United States (including but not limited to time deposits), and (ii) 65% of unrestricted cash and cash equivalents held by the Company and its subsidiaries outside of the United States, exceeds $2 billion in the aggregate (or the avoidance of doubt, any cash and cash equivalents held by the Company and its subsidiaries outside of the United States shall not be considered “restricted” solely as a result of the repatriation of such cash and cash equivalents being subject to any legal limitation or otherwise resulting in adverse tax consequences to the Company), to"
            },
            "33": {
              "text": "(B) the net income of the Company and its consolidated subsidiaries, determined on a consolidated basis for the four quarters then ended in accordance with GAAP, adjusted to exclude the effects of (a) gains or losses from discontinued operations, (b) any extraordinary or other non-recurring non-cash gains or losses (including non-cash restructuring charges), (c) accounting changes including any changes to Accounting Standards Codification 715 (or any subsequently adopted standards relating to pension and postretirement benefits) adopted by the Financial Accounting Standards Board after the date of the Term Loan, (d) interest expense, (e) income tax expense or benefit, (f) depreciation, amortization and other non-cash charges (including actuarial gains or losses from pension and postretirement plans), (g) interest income, (h) equity income and losses and (i) other non-operating income or expense. In the event the Company makes a Material Acquisition or a Material Disposition (each as defined in the Term Loan) during the relevant four quarter period, pro forma effect will be given to such material acquisition or material disposition, as if such material acquisition or material disposition occurred on the first day of such period."
            },
            "34": {
              "text": "Events of default under the Term Loan, which, if occurring after the advances are made, would result in the acceleration of or permit the lenders to accelerate, as applicable, required payment and which would increase the Base Rate and the Eurodollar Rate by 2.00% per annum, whether automatically or upon the request of the requisite lenders, as applicable, include the following:"
            },
            "35": {
              "text": "•Failure to pay principal or interest, fees or other amounts under the Term Loan beyond any applicable grace period;"
            },
            "36": {
              "text": "•Material breaches of representations and warranties in the Term Loan;"
            },
            "37": {
              "text": "•Failure to comply with the preservation of corporate existence, visitation rights or reporting requirements specified under the Term Loan;"
            },
            "38": {
              "text": "•Failure to comply with the negative covenants or the net debt-to-EBITDA ratio covenant described above;"
            },
            "39": {
              "text": "•Failure to comply with other covenants under the Term Loan for a specified period after notice;"
            },
            "40": {
              "text": "•Failure to pay when due other debt of $1 billion (or higher threshold amount under the Company’s existing $15 billion revolving credit agreements, but in no event higher than $2 billion) (the “Threshold Amount”) after any applicable grace period, (2) the occurrence of any other event or condition under any agreement or instrument related to such other debt (other than any required prepayment due to illegality or termination of enforceability of any export credit guarantee) if the effect is to accelerate the maturity of such other debt or (3) the declaration of any such other debt to be due and payable prior to the stated maturity thereof or required to be prepaid or redeemed, purchased or defeased or an offer to prepay, redeem, purchase or defease is required to be made prior to the stated maturity thereof (clauses (2) and (3) are commonly referred to as “cross-acceleration”), except that no debt of a person that is merged into or consolidated with the Company or any subsidiary of the Company or that becomes a subsidiary of the Company is covered by this cross-acceleration provision for a period of 90 days after the date that such other debt becomes debt of the Company or any of its subsidiaries, and cross-acceleration does not apply to any prepayment or similar event resulting from a voluntary notice of prepayment or similar action;"
            },
            "41": {
              "text": "•Commencement by a creditor of enforcement proceedings within a specified period after a money judgment in excess of the Threshold Amount has become final unless such claim is otherwise insured;"
            },
            "42": {
              "text": "•Acquisition by any person or group of beneficial ownership of more than 50% of the Company common shares or a change of more than a majority of the Company’s directors in any 24-month period other than as elected by the remaining directors;"
            },
            "43": {
              "text": "•Failure by the Company or certain affiliates to make certain minimum funding payments under the Employee Retirement Income Security Act of 1974, and such failure could reasonably be expected to subject the Company or any of its subsidiaries to liabilities in excess of the Threshold Amount; and"
            },
            "44": {
              "text": "•Specified events of bankruptcy or insolvency."
            },
            "45": {
              "text": "The description of the Term Loan contained in this Item 1.01 does not purport to be complete and is qualified in its entirety by reference to the Term Loan, which is attached hereto as Exhibit 10.1 and is incorporated herein by reference."
            }
          }
        }
      }
    },
    "46": {
      "title": "ITEM 2.03",
      "standardized_title": "item2.03",
      "class": "item",
      "contents": {
        "47": {
          "title": "Creation of a Direct Financial Obligation or an Obligation Under an Off-Balance Sheet Arrangement of a Registrant",
          "class": "predicted header",
          "contents": {
            "48": {
              "text": "The disclosure under Item 1.01 is incorporated by reference into this Item 2.03."
            }
          }
        }
      }
    },
    "49": {
      "title": "ITEM 9.01",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "50": {
          "title": "Financial Statements and Exhibits.",
          "class": "predicted header",
          "contents": {
            "51": {
              "text": "(d) Exhibits"
            },
            "52": {
              "table": [
                [
                  "10.1",
                  "U.S. $5,500,000,000 Term Loan Credit Agreement, dated as of April 6, 2020, among AT&T Inc., the lenders named therein and Bank of America, N.A., as agent."
                ],
                [
                  "104",
                  "The cover page from AT&T Inc.’s Current Report on Form 8-K, formatted in Inline XBRL"
                ]
              ]
            }
          }
        }
      }
    },
    "53": {
      "title": "Signature",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "54": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "55": {
          "table": [
            [
              "",
              "AT&T INC.",
              "AT&T INC."
            ],
            [
              "Date: April 7, 2020",
              "By:",
              "/s/ George B. Goeke"
            ],
            [
              "",
              "",
              "George B. Goeke"
            ],
            [
              "",
              "",
              "Senior Vice President and Treasurer"
            ]
          ]
        }
      }
    }
  }
}