{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, DC 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d) of the",
              "class": "predicted header"
            },
            "6": {
              "title": "Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): March 19, 2020",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "tmuslogoa31.jpg",
                    "alt": "tmuslogoa31.jpg"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter) ",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "Delaware",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction",
                      "(Commission File Number)",
                      "(I.R.S. Employer"
                    ],
                    [
                      "of incorporation or organization)",
                      "",
                      "Identification No.)"
                    ]
                  ]
                }
              }
            },
            "12": {
              "title": "12920 SE 38th Street",
              "class": "predicted header",
              "contents": {
                "13": {
                  "title": "Bellevue, Washington",
                  "class": "predicted header",
                  "contents": {
                    "14": {
                      "title": "(Address of principal executive offices)",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "15": {
              "title": "98006-1350",
              "class": "predicted header",
              "contents": {
                "16": {
                  "title": "(Zip Code)",
                  "class": "predicted header"
                },
                "17": {
                  "title": "Registrant’s telephone number, including area code: (425) 378-4000",
                  "class": "predicted header"
                },
                "18": {
                  "title": "(Former Name or Former Address, if Changed Since Last Report):",
                  "class": "predicted header",
                  "contents": {
                    "19": {
                      "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions: "
                    },
                    "20": {
                      "table": [
                        [
                          "☐",
                          "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)"
                        ],
                        [
                          "☐",
                          "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)"
                        ],
                        [
                          "☐",
                          "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))"
                        ],
                        [
                          "☐",
                          "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))"
                        ]
                      ]
                    },
                    "21": {
                      "text": "Securities registered pursuant to Section 12(b) of the Act:"
                    },
                    "22": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading Symbol",
                          "Name of each exchange on which registered"
                        ],
                        [
                          "Common Stock, par value $0.00001 per share",
                          "TMUS",
                          "The NASDAQ Stock Market LLC"
                        ]
                      ]
                    },
                    "23": {
                      "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (17 CFR 230.405) or Rule 12b-2 of the Securities Exchange Act of 1934 (17 CFR 240.12b-2)."
                    },
                    "24": {
                      "text": "Emerging growth company ☐"
                    },
                    "25": {
                      "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐"
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "26": {
      "title": "Item 5.02 — Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers",
      "standardized_title": "item5.02",
      "class": "item",
      "contents": {
        "27": {
          "text": "On March 19, 2020, the Section 16 Subcommittee (the “Subcommittee”) of the Compensation Committee (the “Compensation Committee”) of the Board of Directors of T-Mobile US, Inc. (“T-Mobile”) approved the grant of a special one-time award of performance-based restricted stock units with an aggregate grant-date value of approximately $15,000,000 to Neville Ray, T-Mobile’s President, Technology under T-Mobile’s 2013 Omnibus Incentive Plan (the “Ray Special PRSUs”)."
        },
        "28": {
          "text": "Five-sixths of the Ray Special PRSUs (the “Tranche I PRSUs”) are eligible to cliff-vest on the third anniversary of the date on which the closing of the transactions contemplated by the Business Combination Agreement between T-Mobile, Sprint Corporation and certain other parties, dated April 29, 2018 occurs (the “Closing Date”), based on T-Mobile’s annualized network synergy exit run rate relative to certain targets to be determined by the Compensation Committee or the Subcommittee (in either case, the “Committee”) within 120 days following the grant date, and subject to Mr. Ray’s continued employment through such date (except as otherwise provided in the PRSU award agreement evidencing such Ray Special PRSUs (the “Ray PRSU Award Agreement”)).  Unless otherwise determined by the Committee, the number of Tranche I PRSUs that become earned based on the attainment of the applicable run rate performance goals will be reduced by 25% if such goals are not attained within T-Mobile’s annualized capital expenditure budget over the applicable performance period."
        },
        "29": {
          "text": "The remaining one-sixth of the Ray Special PRSUs will cliff-vest on the fourth anniversary of the Closing Date if and only if T-Mobile receives Federal Communications Commission (“FCC”) certification with respect to all FCC testing of T-Mobile products completed during the three-year period commencing on the Closing Date and the FCC does not assess any material voluntary contributions against T-Mobile during the period commencing on the Closing Date and ending on the fourth anniversary thereof, subject to Mr. Ray’s continued employment through the third anniversary of the Closing Date (except as otherwise provided in the Ray PRSU Award Agreement)."
        },
        "30": {
          "text": "The foregoing description of the Ray Special PRSUs is qualified in its entirety by the full text of the Ray PRSU Award Agreement, a copy of which will subsequently be filed with the Securities and Exchange Commission."
        }
      }
    },
    "31": {
      "title": "Item 9.01 — Financial Statements and Exhibits",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "32": {
          "table": [
            [
              "Exhibit",
              "Description"
            ],
            [
              "104",
              "Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document."
            ]
          ]
        }
      }
    },
    "33": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "34": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "35": {
          "table": [
            [
              "",
              "T-MOBILE US, INC."
            ],
            [
              "March 25, 2020",
              "/s/ J. Braxton Carter"
            ],
            [
              "",
              "J. Braxton Carter\nExecutive Vice President and Chief Financial Officer"
            ]
          ]
        }
      }
    }
  }
}