{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 OR 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of The Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of Report (Date of earliest event reported): July 5, 2023",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g506777g0711080116960.jpg",
                    "alt": "LOGO"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact name of registrant as specified in its charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "DELAWARE",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "title": "Not Applicable",
                  "class": "predicted header",
                  "contents": {
                    "15": {
                      "textsmall": "(Former name or former address, if changed since last report)"
                    },
                    "16": {
                      "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions:",
                      "class": "predicted header"
                    },
                    "17": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "18": {
                      "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                      "class": "predicted header"
                    },
                    "19": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "20": {
                      "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                      "class": "predicted header"
                    },
                    "21": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "22": {
                      "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                      "class": "predicted header"
                    },
                    "23": {
                      "title": "☐",
                      "class": "predicted header"
                    },
                    "24": {
                      "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                      "class": "predicted header"
                    },
                    "25": {
                      "title": "Securities registered pursuant to Section 12(b) of the Act:",
                      "class": "predicted header",
                      "contents": {
                        "26": {
                          "table": [
                            [
                              "Title of each class",
                              "Trading\nSymbol",
                              "Name of each exchange\n on which registered"
                            ],
                            [
                              "Common Stock, $0.00001 par value per share",
                              "TMUS",
                              "The NASDAQ Stock Market LLC"
                            ]
                          ]
                        }
                      }
                    },
                    "27": {
                      "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).",
                      "class": "predicted header"
                    },
                    "28": {
                      "title": "Emerging growth company ☐",
                      "class": "predicted header"
                    },
                    "29": {
                      "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐",
                      "class": "predicted header"
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "30": {
      "title": "Item 5.02 — Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.",
      "standardized_title": "item5.02",
      "class": "item",
      "contents": {
        "31": {
          "title": "On July 5, 2023, the Section 16 Subcommittee (the “Subcommittee”) of the Compensation Committee (the “Compensation Committee”) of the Board of Directors of T-Mobile US, Inc. (the “Company”) approved the grant, effective as of July 5, 2023, of a target number of 75,586 cash-settled performance-based restricted stock units (the “PRSUs”) under the Company’s 2023 Incentive Award Plan (the “Plan”) to Peter Osvaldik, our Executive Vice President and Chief Financial Officer. The following is a brief description of the material terms and conditions of the PRSUs.",
          "class": "predicted header",
          "contents": {
            "32": {
              "title": "General",
              "class": "predicted header"
            }
          }
        },
        "33": {
          "title": ". Mr. Osvaldik is eligible to vest in a number of PRSUs ranging from 0% to 200% of the target number of PRSUs granted, based on the Company’s free cash flow during the three-year performance period commencing January 1, 2023 and ending December 31, 2025 (the “performance period”), subject to his continued employment with the Company and its affiliates through July 1, 2026 (the “vesting date”). Each vested PRSU represents the right to receive an amount in cash equal to the fair market value of one share of common stock of the Company. ",
          "class": "predicted header",
          "contents": {
            "34": {
              "title": "Vesting",
              "class": "predicted header"
            }
          }
        },
        "35": {
          "title": ". Up to 200% of the target number of PRSUs subject to the award will be eligible to vest based on the Company’s achievement of certain free cash flow targets during the performance period, as set forth in the Cash-Settled Performance-Vesting Restricted Stock Unit Grant Notice and Restricted Stock Unit Agreement evidencing the grant of the PRSUs (the “PRSU award agreement”).  ",
          "class": "predicted header"
        },
        "36": {
          "title": "Following the completion of the performance period, the Compensation Committee or the Subcommittee will certify the Company’s free cash flow and determine the number of PRSUs that have become earned with respect to the performance period (such PRSUs, the “performance-vested PRSUs”). The performance-vested PRSUs will become fully vested on July 1, 2026, subject to Mr. Osvaldik’s continued service through such date. Any PRSUs that do not become earned and vested will be forfeited without consideration therefor.",
          "class": "predicted header",
          "contents": {
            "37": {
              "title": "Certain Terminations of Employment",
              "class": "predicted header"
            }
          }
        },
        "38": {
          "title": ". If Mr. Osvaldik’s service terminates prior to the vesting date due to his death or disability (as defined in the Plan), any then-unvested PRSUs will vest at target performance as of the termination date. ",
          "class": "predicted header"
        },
        "39": {
          "title": "If Mr. Osvaldik incurs a termination of employment prior to the vesting date as a result of a workforce reduction or divestiture (each as defined in the PRSU award agreement), a pro-rated number of PRSUs (based on the number of days that he was employed during the period beginning on the grant date and ending on the vesting date) will vest based on actual performance upon completion of the performance period, and any remaining unearned PRSUs will be cancelled and forfeited upon completion of the performance period. Such vesting is subject to Mr. Osvaldik’s execution of a release of claims or other documents required by the Company or the terms of any applicable Company severance program.",
          "class": "predicted header"
        },
        "40": {
          "title": "In addition, if Mr. Osvaldik incurs a termination of employment prior to the vesting date (a) by the Company for any reason other than for cause (excluding death or disability) or (b) due to his resignation for good reason (each as defined in the PRSU award agreement), in either case, within one year following a change in control of the Company (as defined in the Plan), then the PRSUs will become earned and vested at the greater of target or actual performance (determined as if the performance period had ended as of the last trading day immediately preceding the change in control) upon his termination.",
          "class": "predicted header"
        },
        "41": {
          "title": "If Mr. Osvaldik’s employment terminates prior to the vesting date for any reason other than those described above, the PRSUs will be cancelled and forfeited as of the date of such termination.",
          "class": "predicted header",
          "contents": {
            "42": {
              "title": "Change of Control",
              "class": "predicted header"
            }
          }
        },
        "43": {
          "title": ". If a change of control of the Company occurs prior to the end of the performance period, the PRSUs are assumed, converted or replaced by the surviving entity in the change in control and Mr. Osvaldik remains in continued employment with the Company through the end of the performance period, the number of PRSUs that become earned with respect to the performance period will not be less than the target number of PRSUs granted. ",
          "class": "predicted header",
          "contents": {
            "44": {
              "title": "Payment",
              "class": "predicted header"
            }
          }
        },
        "45": {
          "title": ". Each PRSU that becomes vested will be paid to Mr. Osvaldik in cash in an amount equal to the fair market value of a share of Company common stock within ninety days after the PRSU vests (but no later than March 15th of the year following the year of vesting, in the case of a vesting that occurs prior to July 1, 2026). ",
          "class": "predicted header"
        },
        "46": {
          "title": "The foregoing summary is qualified in its entirety by reference to the full text of the form of Cash-Settled Performance-Vesting Restricted Stock Unit Grant Notice and Restricted Stock Unit Agreement under the Plan, a copy of which will subsequently be filed with the SEC.",
          "class": "predicted header"
        }
      }
    },
    "47": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "48": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "49": {
              "table": [
                [
                  "",
                  "T-MOBILE US, INC."
                ],
                [
                  "July 11, 2023",
                  "/s/ Mark W. Nelson"
                ],
                [
                  "",
                  "Mark W. Nelson\n Executive Vice President and General Counsel"
                ]
              ]
            }
          }
        }
      }
    }
  }
}