{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 OR 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of The Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): March 9, 2023",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g381908g91x21.jpg",
                    "alt": "LOGO"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact name of registrant as specified in its charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "DELAWARE",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\nFile Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "textsmall": "(Former name or former address, if changed since last report.)"
                },
                "15": {
                  "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instruction A.2. below):",
                  "class": "predicted header"
                },
                "16": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "17": {
                  "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                  "class": "predicted header"
                },
                "18": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "19": {
                  "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                  "class": "predicted header"
                },
                "20": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "21": {
                  "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                  "class": "predicted header"
                },
                "22": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "23": {
                  "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                  "class": "predicted header"
                },
                "24": {
                  "title": "Securities registered pursuant to Section 12(b) of the Act:",
                  "class": "predicted header",
                  "contents": {
                    "25": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading\nSymbol(s)",
                          "Name of each exchange\non which registered"
                        ],
                        [
                          "Common Stock, $0.00001 par value per share",
                          "TMUS",
                          "The Nasdaq Stock Market LLC"
                        ]
                      ]
                    }
                  }
                },
                "26": {
                  "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).",
                  "class": "predicted header"
                },
                "27": {
                  "title": "Emerging growth company ☐",
                  "class": "predicted header"
                },
                "28": {
                  "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐",
                  "class": "predicted header"
                }
              }
            }
          }
        }
      }
    },
    "29": {
      "title": "Item 5.02",
      "standardized_title": "item5.02",
      "class": "item",
      "contents": {
        "30": {
          "title": "Departure of Directors or Principal Officers; Election of Directors; Appointment of Principal Officers.",
          "class": "predicted header",
          "contents": {
            "31": {
              "title": "On March 9, 2023, T-Mobile US, Inc. (“T-Mobile” or the “Company”) entered into an amended and restated employment agreement (the “A&R Employment Agreement”) with G. Michael Sievert, its President and Chief Executive Officer, that extends the term for five years. The A&R Employment Agreement supersedes and replaces the prior employment agreement between T-Mobile and Mr. Sievert, dated as of November 15, 2019, as amended. The term of A&R Employment Agreement continues through April 1, 2028, subject to automatic one-year extensions thereafter unless at least ninety (90) days’ prior notice of non-renewal is given by either party.",
              "class": "predicted header"
            },
            "32": {
              "title": "Pursuant to the A&R Employment Agreement, Mr. Sievert is entitled to (i) an annual base salary initially equal to $1,750,000, effective as of January 1, 2023, which will automatically increase to (a) effective January 1, 2024, the greater of (x) $1,850,000 or (y) the then-current median annual base salary for chief executive officers in T-Mobile’s then-current compensation peer group (the “Peer Group”), (b) effective January 1, 2025, the greater of (x) $1,900,000 or (y) the then-current median annual base salary for chief executive officers in T-Mobile’s Peer Group, and (c) effective each of January 1, 2026 and January 1, 2027, the greater of (x) $2,000,000 or (y) the then-current median annual base salary for chief executive officers in T-Mobile’s Peer Group; (ii) commencing with calendar year 2023, an annual short-term cash incentive targeted at no less than 250% of his base salary (with a maximum award equal to 200% of target), payable based on the attainment of pre-established performance goals; and (iii) employee benefits to the same extent and on the same terms as such benefits are provided generally by T-Mobile to its senior executives.",
              "class": "predicted header"
            },
            "33": {
              "title": "In addition, pursuant to the A&R Employment Agreement, commencing with calendar year 2023, Mr. Sievert will be entitled to annual long-term incentive awards (“LTI awards”) with a target grant-date value (the “Annual LTI Target Value”) that is no less than $18,500,000, which will be allocated as follows: 50% of such value will be granted in the form of performance-based restricted stock units (“PRSUs”) and the remaining 50% of such value will be granted in the form of time-based restricted stock units (“RSUs”). Mr. Sievert’s Annual LTI Target Value will automatically increase to (i) for LTI awards granted during calendar year 2024, the greater of (a) $19,000,000, (b) the 60th percentile of the aggregate target grant-date value of annual equity incentive awards for chief executive officers in T-Mobile’s Peer Group, or (c) the Annual LTI Target Value for the immediately preceding calendar year; and (ii) for LTI grants made during calendar years 2025, 2026, 2027 and 2028, the greater of (a) $19,000,000, (b) the 65th percentile of the aggregate target grant-date value of annual equity incentive awards for chief executive officers in T-Mobile’s Peer Group, and (c) the Annual LTI Target Value in effect for the applicable prior calendar year. With respect to 60% of the total time-based RSUs granted to Mr. Sievert as annual LTI awards during each of calendar years 2023 through 2028 (i.e., 30% of the total Annual LTI Target Value for each such year), the total length of the vesting schedule of such RSUs will be no longer than the length of the median total length of the vesting schedules of annual time-based equity incentive awards for chief executive officers in T-Mobile’s Peer Group at the time of grant. In satisfaction of T-Mobile’s obligation under the A&R Employment Agreement to grant Mr. Sievert LTI awards with an Annual LTI Target Value of $18,500,000 for fiscal year 2023, on April 1, 2023, Mr. Sievert will be granted one-time awards of RSUs and PRSUs under the Company’s 2013 Omnibus Incentive Plan (as amended, the “Plan”), with respect to a total target number of shares of T-Mobile common stock equal to the quotient of $2,333,333 divided by the average closing price of T-Mobile common stock over the thirty calendar day period ending five days before February 15, 2023, rounded up to the nearest whole share (the “True-Up Awards”). The True-Up Awards will be subject to the same vesting schedules and other terms and conditions (including, with respect to the PRSUs, performance goals) applicable to the awards of RSUs and PRSUs granted to Mr. Sievert under the Plan on February 15, 2023.",
              "class": "predicted header"
            },
            "34": {
              "title": "The A&R Employment Agreement provides that, on April 1, 2023, Mr. Sievert will be granted a one-time award of PRSUs (the “Special PRSUs”) under the Plan, with respect to a target number of shares of T-Mobile common stock equal to the quotient of $10,000,000 divided by the average closing price of T-Mobile common stock over the thirty calendar day period ending five days before the grant date. The Special PRSUs will cliff-vest on the second anniversary of the grant date, based on T-Mobile’s total shareholder return relative to its Peer Group during the applicable performance period and subject to Mr. Sievert’s continued employment through such date (except as otherwise noted below and in the PRSU award agreement).",
              "class": "predicted header"
            },
            "35": {
              "title": "The A&R Employment Agreement provides that if Mr. Sievert’s employment is terminated by T-Mobile other than for “cause” (as defined in the A&R Employment Agreement), by Mr. Sievert for “good reason” (as defined in the A&R Employment Agreement), or due to T-Mobile’s non-renewal of the A&R Employment Agreement (each, a “qualifying termination”), then, subject to his timely execution and non-revocation of a release and continued compliance with applicable restrictive covenants, he will be entitled to receive:",
              "class": "predicted header"
            },
            "36": {
              "title": "•",
              "class": "predicted header"
            },
            "37": {
              "title": "a lump-sum payment equal to two times the sum of (i) his then-current base salary plus (ii) his then-current target short-term incentive;",
              "class": "predicted header"
            },
            "38": {
              "title": "•",
              "class": "predicted header"
            },
            "39": {
              "title": "any earned, unpaid short term incentive for the last completed fiscal year of T-Mobile preceding the termination date (a “Prior Year STI”);",
              "class": "predicted header"
            },
            "40": {
              "title": "•",
              "class": "predicted header"
            },
            "41": {
              "title": "a pro rata short-term incentive for the fiscal year in which the qualifying termination occurs (a “Pro-Rata STI”), based on actual performance results for such year;",
              "class": "predicted header"
            },
            "42": {
              "title": "•",
              "class": "predicted header"
            },
            "43": {
              "title": "with respect to Mr. Sievert’s then-outstanding LTI awards, and notwithstanding anything to the contrary in the applicable award agreement(s):",
              "class": "predicted header"
            },
            "44": {
              "title": "•",
              "class": "predicted header"
            },
            "45": {
              "title": "full vesting of time-based LTI awards (including any RSUs); and",
              "class": "predicted header"
            },
            "46": {
              "title": "•",
              "class": "predicted header"
            },
            "47": {
              "title": "with respect to performance-based LTI awards (including any PRSUs),",
              "class": "predicted header"
            },
            "48": {
              "title": "(i)",
              "class": "predicted header"
            },
            "49": {
              "title": "a portion of each performance-based LTI award, determined by multiplying (x) the total number of shares or units, as applicable, subject to such award by (y) a fraction, the numerator of which is the number of days between the commencement of the applicable performance period in effect as of Mr. Sievert’s termination of employment through the date of such termination, and the denominator of which is the number of days in the full performance period, will vest based on actual performance through the termination date; and",
              "class": "predicted header"
            },
            "50": {
              "title": "(ii)",
              "class": "predicted header"
            },
            "51": {
              "title": "a portion of each performance-based LTI award, determined by multiplying (x) the total number of shares or units, as applicable, subject to such award by (y) a fraction, the numerator of which is the number of days between the date of Mr. Sievert’s termination of employment and the end of the applicable performance period in effect as of such termination, and the denominator of which is the number of days in the full performance period, will vest at the greater of target or actual performance as of such termination date;",
              "class": "predicted header"
            },
            "52": {
              "title": "•",
              "class": "predicted header"
            },
            "53": {
              "title": "Company-paid health and dental benefit coverage (the “Continued Health Coverage”) for up to eighteen (18) months following such termination;",
              "class": "predicted header"
            },
            "54": {
              "title": "•",
              "class": "predicted header"
            },
            "55": {
              "title": "Company reimbursement for an exclusive office and exclusive executive assistant for up to eighteen (18) months following such termination (capped at $25,000 per month) (the “Continued Office/Assistant Benefits”); and",
              "class": "predicted header"
            },
            "56": {
              "title": "•",
              "class": "predicted header"
            },
            "57": {
              "title": "continued eligibility for T-Mobile’s employee mobile service discount program (the “Continued Mobile Discounts”).",
              "class": "predicted header"
            },
            "58": {
              "title": "Additionally, the A&R Employment Agreement provides that Mr. Sievert may retire on or after the end of the 5-year term, or April 1, 2028, by providing at least 12 months’ written notice to the Company of his “proposed retirement date” (as defined in the A&R Employment Agreement) and receive substantially the same compensation and benefits as he would receive in a qualifying termination. Mr. Sievert also has the option upon 12 months’ written",
              "class": "predicted header"
            },
            "59": {
              "title": "notice to retire on or after April 1, 2026, but he would receive only 60% of the retirement compensation if his proposed retirement date is on or after April 1, 2026 but before April 1, 2027, or 75% if his proposed retirement date is on or after April 1, 2027 but before April 1, 2028, respectively.",
              "class": "predicted header"
            },
            "60": {
              "title": "The A&R Employment Agreement further provides that if Mr. Sievert’s employment is terminated due to his death or disability, he will be entitled to receive the following:",
              "class": "predicted header"
            },
            "61": {
              "title": "•",
              "class": "predicted header"
            },
            "62": {
              "title": "any Prior Year STI;",
              "class": "predicted header"
            },
            "63": {
              "title": "•",
              "class": "predicted header"
            },
            "64": {
              "title": "a Pro-Rata STI, based on the greater of target or actual performance results for the fiscal year in which such termination occurs;",
              "class": "predicted header"
            },
            "65": {
              "title": "•",
              "class": "predicted header"
            },
            "66": {
              "title": "the vesting of any LTI award or other equity award granted by T-Mobile will be governed by the terms of the applicable equity incentive plan and the applicable award agreement, which terms shall be no less favorable than those applicable to all other executive-level employees of T-Mobile; and",
              "class": "predicted header"
            },
            "67": {
              "title": "•",
              "class": "predicted header"
            },
            "68": {
              "title": "the Continued Mobile Discounts.",
              "class": "predicted header"
            },
            "69": {
              "title": "In addition, to the extent that any payment or benefit received by Mr. Sievert pursuant to the A&R Employment Agreement or otherwise would be subject to an excise tax under Internal Revenue Code Section 4999, such payments and/or benefits will be subject to a “best pay cap” reduction if such reduction would result in a greater net after-tax benefit to Mr. Sievert than receiving the full amount of such payments.",
              "class": "predicted header"
            },
            "70": {
              "title": "The foregoing description of the A&R Employment Agreement with Mr. Sievert is qualified in its entirety by the full text of the A&R Employment Agreement, a copy of which will be subsequently filed with the Securities and Exchange Commission.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "71": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "72": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "73": {
              "table": [
                [
                  "Date: March 10, 2023",
                  "T-MOBILE US, INC.",
                  "T-MOBILE US, INC."
                ],
                [
                  "",
                  "By:",
                  "/s/ Peter Osvaldik"
                ],
                [
                  "",
                  "",
                  "Peter Osvaldik\n Executive Vice President & Chief Financial Officer"
                ]
              ]
            }
          }
        }
      }
    }
  }
}