{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): September 8, 2022",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g359205g0908060610122.jpg",
                    "alt": "LOGO"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "Delaware",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "textsmall": "(Former Name or Former Address, if Changed Since Last Report):"
                },
                "15": {
                  "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions:",
                  "class": "predicted header"
                },
                "16": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "17": {
                  "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                  "class": "predicted header"
                },
                "18": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "19": {
                  "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                  "class": "predicted header"
                },
                "20": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "21": {
                  "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d- 2(b))",
                  "class": "predicted header"
                },
                "22": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "23": {
                  "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e- 4(c))",
                  "class": "predicted header"
                },
                "24": {
                  "title": "Securities registered pursuant to Section 12(b) of the Act:",
                  "class": "predicted header",
                  "contents": {
                    "25": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading\n Symbol",
                          "Name of each exchange\n on which registered"
                        ],
                        [
                          "Common Stock, par value $0.00001 per share",
                          "TMUS",
                          "The NASDAQ Stock Market LLC"
                        ]
                      ]
                    }
                  }
                },
                "26": {
                  "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).",
                  "class": "predicted header"
                },
                "27": {
                  "title": "Emerging growth company  ☐",
                  "class": "predicted header"
                },
                "28": {
                  "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐",
                  "class": "predicted header"
                }
              }
            }
          }
        }
      }
    },
    "29": {
      "title": "Item 8.01.",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "30": {
          "title": "Other Events.",
          "class": "predicted header",
          "contents": {
            "31": {
              "title": "On September 8, 2022, T-Mobile US, Inc., a Delaware corporation (the “Company”), announced that its Board of Directors has authorized a stock repurchase program for up to $14.0 billion of the Company’s common stock, par value $0.00001 per share, through September 30, 2023. Repurchases are expected to be made from available cash on hand and proceeds of one or more debt issuances or other borrowings, based on the Company’s evaluation of market conditions and other factors.",
              "class": "predicted header"
            },
            "32": {
              "title": "Under the repurchase program, repurchases can be made from time to time using a variety of methods, which may include open market purchases, 10b5-1 plans, privately negotiated transactions or otherwise (but Deutsche Telekom AG, the Company’s controlling stockholder, has no present intention of selling common stock pursuant to the repurchase program), all in accordance with the rules of the Securities and Exchange Commission and other applicable legal requirements. The specific timing, price and size of repurchases will depend on prevailing stock prices, general economic and market conditions, and other considerations, and may include up to $3.0 billion through the remainder of 2022. The repurchase program does not obligate the Company to acquire any particular amount of common stock, and the repurchase program may be suspended or discontinued at any time at the Company’s discretion.",
              "class": "predicted header"
            }
          }
        },
        "33": {
          "title": "Cautionary Statement Regarding Forward-Looking Statements",
          "class": "predicted header",
          "contents": {
            "34": {
              "title": "This communication contains certain forward-looking statements concerning the Company’s expectations with respect to repurchases of common stock, including the timing and manner of any purchases under the Company’s repurchase program. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “expect,” “initiative,” “intend,” “may,” “present,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about T-Mobile’s objectives, expectations and intentions with respect to the repurchase program. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, changes in the market price of the common stock, general market conditions, access to credit or debt capital markets, applicable securities laws and alternative uses of capital, and other risks and uncertainties detailed in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K and Form 10-Q, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law. References to our and the SEC’s website are inactive textual references only. Information contained on our and the SEC’s website is not incorporated by reference in this Report and should not be considered to be a part of this Report.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "35": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "36": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "37": {
              "table": [
                [
                  "",
                  "T-MOBILE US, INC.",
                  "T-MOBILE US, INC."
                ],
                [
                  "September 8, 2022",
                  "/s/ Peter Osvaldik",
                  "/s/ Peter Osvaldik"
                ],
                [
                  "",
                  "Name:",
                  "Peter Osvaldik"
                ],
                [
                  "",
                  "Title:",
                  "Executive Vice President and\n Chief Financial Officer"
                ]
              ]
            }
          }
        }
      }
    }
  }
}