{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): February 20, 2020",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g886254g0221013707612.jpg",
                    "alt": "IMAGE"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "DELAWARE",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "textsmall": "(Former Name or Former Address, if Changed Since Last Report):"
                },
                "15": {
                  "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions (see General Instructions A.2. below):"
                },
                "16": {
                  "text": "☒Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)"
                },
                "17": {
                  "text": "☐Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)"
                },
                "18": {
                  "text": "☐Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))"
                },
                "19": {
                  "text": "☐Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))"
                },
                "20": {
                  "text": "Securities registered pursuant to Section 12(b) of the Act:"
                },
                "21": {
                  "table": [
                    [
                      "Title of each class",
                      "Trading\n symbol",
                      "Name of each exchange\n on which registered"
                    ],
                    [
                      "Common Stock, $0.00001 par value per share",
                      "TMUS",
                      "The NASDAQ Stock Market LLC"
                    ]
                  ]
                },
                "22": {
                  "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter)."
                },
                "23": {
                  "text": "Emerging growth company  ☐"
                },
                "24": {
                  "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                }
              }
            }
          }
        }
      }
    },
    "25": {
      "title": "Item 1.01",
      "standardized_title": "item1.01",
      "class": "item",
      "contents": {
        "26": {
          "title": "Entry into a Material Definitive Agreement.",
          "class": "predicted header",
          "contents": {
            "27": {
              "text": "On February 20, 2020, T-Mobile US, Inc. (“T-Mobile”), Sprint Corporation (“Sprint”) and the other parties to the Business Combination Agreement (as defined below) entered into Amendment No. 2 (the “Amendment”) to the Business Combination Agreement, dated as of April 29, 2018 (the “Business Combination Agreement”), by and among T-Mobile, Sprint, Huron Merger Sub LLC, Superior Merger Sub Corporation, Starburst I, Inc., Galaxy Investment Holdings, Inc., and for the limited purposes set forth therein, Deutsche Telekom AG (“Deutsche Telekom”), Deutsche Telekom Holding B.V. and SoftBank Group Corp. (“SoftBank”), as amended by Amendment No. 1 to the Business Combination Agreement, dated July 26, 2019. As previously disclosed, the Business Combination Agreement provides for T-Mobile and Sprint to combine their respective businesses, on the terms and subject to the conditions set forth in the Business Combination Agreement (the “Merger Transactions”)."
            },
            "28": {
              "text": "The Amendment extends the Outside Date (as defined in the Business Combination Agreement) to July 1, 2020, and further provides that the closing of the Merger Transactions will occur on the first business day of the first month (other than the third month of any calendar quarter) where such first business day is at least three business days following the satisfaction or waiver of all of the conditions to the closing of the Merger Transactions (such date, the “Closing Date”). In addition, the Amendment modifies the commitments of the parties with respect to actions that may be required to be taken in order to obtain any remaining governmental consents or avoid an action or proceeding by any governmental entity in connection with the Merger Transactions, subject to certain limitations."
            },
            "29": {
              "text": "Pursuant to the Amendment, SoftBank has also agreed to indemnify T-Mobile and its subsidiaries following the closing of the Merger Transactions against (i) any monetary losses arising out of or resulting from certain specified matters and (ii) the loss of value to T-Mobile and its subsidiaries arising out of or resulting from cessation of access to spectrum of Sprint or its subsidiaries (“Lost Spectrum”) under certain circumstances, subject to limitations and qualifications contained in the Amendment."
            },
            "30": {
              "text": "Concurrently with entry into the Amendment, T-Mobile, SoftBank and Deutsche Telekom entered into a letter agreement (the “Letter Agreement”). Pursuant to the Letter Agreement, SoftBank has agreed to cause its applicable affiliates to surrender to T-Mobile, for no additional consideration, an aggregate of 48,751,557 shares of T-Mobile Common Stock (such number of shares, the “SoftBank Specified Shares Amount”), effective immediately following the Effective Time (as defined in the Business Combination Agreement). Immediately following such surrender, Deutsche Telekom and SoftBank are expected to hold approximately 43% and 24%, respectively, of the fully diluted shares of T-Mobile Common Stock, with the remaining approximately 33% of the fully diluted shares of T-Mobile Common Stock held by public stockholders. The Letter Agreement further provides that if the trailing 45-day volume-weighted average price per share of T-Mobile Common Stock on the NASDAQ Global Select Market is equal to or greater than $150.00 at any time during the period commencing on the second anniversary of the Closing Date and ending on December 31, 2025 (or, if the Closing Date is on or after May 1, 2020 and SoftBank so elects no later than June 1, 2020, $150.00 at any time during the period commencing on the second anniversary of the Closing Date and ending on the fifth anniversary of the Closing Date or $160.00 at any time during the period following the fifth anniversary of the Closing Date and ending on the sixth anniversary of the Closing Date), T-Mobile will issue to SoftBank, for no additional consideration, a number of shares of T-Mobile Common Stock equal to the SoftBank Specified Shares Amount, subject to the terms and conditions set forth in the Letter Agreement."
            },
            "31": {
              "text": "In connection with the foregoing arrangements, the Amendment provides for certain modifications to the percentage thresholds applicable to SoftBank’s ownership with respect to its director representation rights in the Stockholders’ Agreement (as defined in the Business Combination Agreement) to be entered into in connection with the closing of the Merger Transactions (which modifications will no longer apply in the event that T-Mobile is obligated to issue the SoftBank Specified Shares Amount)."
            },
            "32": {
              "text": "The foregoing description of the Amendment (including the modifications to the form of the Stockholders’ Agreement) and the Letter Agreement is not complete and is qualified in its entirety by reference to the full text of the Amendment and the Letter Agreement, copies of which are filed as Exhibit 2.1 and Exhibit 10.1, respectively, hereto and are incorporated herein by reference."
            },
            "33": {
              "text": "The completion of the Merger Transactions remains subject to certain closing conditions pursuant to the Business Combination Agreement, as amended. T-Mobile and Sprint currently anticipate that the Merger Transactions will close as early as April 1, 2020."
            }
          }
        }
      }
    },
    "34": {
      "title": "Item 8.01",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "35": {
          "title": "Other Events.",
          "class": "predicted header",
          "contents": {
            "36": {
              "text": "On February 20, 2020, T-Mobile and Sprint issued a press release announcing the entry into the Amendment and the Letter Agreement. A copy of the press release is filed as Exhibit 99.1 hereto and is incorporated herein by reference."
            }
          }
        }
      }
    },
    "37": {
      "title": "Item 9.01",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "38": {
          "title": "Financial Statements and Exhibits.",
          "class": "predicted header"
        },
        "39": {
          "title": "(d) Exhibits.",
          "class": "predicted header",
          "contents": {
            "40": {
              "table": [
                [
                  "Exhibit \nNo.",
                  "Description"
                ],
                [
                  "2.1",
                  "Amendment No. 2, dated as of February 20, 2020, to the Business Combination Agreement, dated as of April 29, 2018, by and among T-Mobile US, Inc., Huron Merger Sub LLC, Superior Merger Sub Corporation, Sprint Corporation, Starburst I, Inc., Galaxy Investment Holdings, Inc., and for the limited purposes set forth therein, Deutsche Telekom AG, Deutsche Telekom Holding B.V., and SoftBank Group Corp., as amended.*"
                ],
                [
                  "10.1",
                  "Letter Agreement, dated as of February 20, 2020, by and among T-Mobile US, Inc., Deutsche Telekom AG and SoftBank Group Corp."
                ],
                [
                  "99.1",
                  "Press Release dated February 20, 2020."
                ],
                [
                  "104",
                  "Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document)."
                ]
              ]
            },
            "41": {
              "text": "*This filing excludes certain schedules pursuant to Item 601(a)(5) of Regulation S-K, which the registrant agrees to furnish supplementally to the Securities and Exchange Commission upon request by the Commission."
            }
          }
        },
        "42": {
          "title": "Important Additional Information",
          "class": "predicted header",
          "contents": {
            "43": {
              "text": "In connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile  may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091."
            }
          }
        },
        "44": {
          "title": "No Offer or Solicitation",
          "class": "predicted header",
          "contents": {
            "45": {
              "text": "This communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended."
            }
          }
        },
        "46": {
          "title": "Cautionary Statement Regarding Forward-Looking Statements",
          "class": "predicted header",
          "contents": {
            "47": {
              "text": "This communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include,"
            },
            "48": {
              "text": "but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the Business Combination Agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the Business Combination Agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law."
            }
          }
        }
      }
    },
    "49": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "50": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "51": {
          "table": [
            [
              "Date: February 20, 2020",
              "T-MOBILE US, INC.",
              "T-MOBILE US, INC."
            ],
            [
              "",
              "By:",
              "/s/ G. Michael Sievert"
            ],
            [
              "",
              "",
              "G. Michael Sievert"
            ],
            [
              "",
              "",
              "President and Chief Operating Officer"
            ]
          ]
        }
      }
    }
  }
}