{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, DC 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K/A",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d) of the",
              "class": "predicted header"
            },
            "6": {
              "title": "Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): April 1, 2020",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "tmus-20200401_g1.jpg",
                    "alt": "tmus-20200401_g1.jpg"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "Delaware",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction",
                      "(Commission File Number)",
                      "(I.R.S. Employer"
                    ],
                    [
                      "of incorporation or organization)",
                      "",
                      "Identification No.)"
                    ]
                  ]
                }
              }
            },
            "12": {
              "title": "12920 SE 38th Street",
              "class": "predicted header",
              "contents": {
                "13": {
                  "title": "Bellevue, Washington",
                  "class": "predicted header",
                  "contents": {
                    "14": {
                      "title": "(Address of principal executive offices)",
                      "class": "predicted header"
                    }
                  }
                }
              }
            },
            "15": {
              "title": "98006-1350",
              "class": "predicted header",
              "contents": {
                "16": {
                  "title": "(Zip Code)",
                  "class": "predicted header"
                },
                "17": {
                  "title": "Registrant’s telephone number, including area code: (425) 378-4000",
                  "class": "predicted header",
                  "contents": {
                    "18": {
                      "textsmall": "(Former Name or Former Address, if Changed Since Last Report):"
                    },
                    "19": {
                      "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions:"
                    },
                    "20": {
                      "table": [
                        [
                          "☐",
                          "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)"
                        ],
                        [
                          "☐",
                          "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)"
                        ],
                        [
                          "☐",
                          "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))"
                        ],
                        [
                          "☐",
                          "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))"
                        ]
                      ]
                    },
                    "21": {
                      "text": "Securities registered pursuant to Section 12(b) of the Act:"
                    },
                    "22": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading Symbol",
                          "Name of each exchange on which registered"
                        ],
                        [
                          "Common Stock, par value $0.00001 per share",
                          "TMUS",
                          "The NASDAQ Stock Market LLC"
                        ]
                      ]
                    },
                    "23": {
                      "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§ 230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§ 240.12b-2 of this chapter)."
                    },
                    "24": {
                      "text": "Emerging growth company ☐"
                    },
                    "25": {
                      "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ¨"
                    }
                  }
                }
              }
            }
          }
        },
        "26": {
          "title": "EXPLANATORY NOTE",
          "class": "predicted header",
          "contents": {
            "27": {
              "text": "On April 1, 2020, T-Mobile US, Inc. (the “Company”) filed with the Securities and Exchange Commission a Current Report on Form 8-K (the “Initial 8-K”) to disclose the completion on April 1, 2020 of the previously announced business combination between T-Mobile US, Inc., a Delaware corporation (“T-Mobile”), and Sprint Corporation, a Delaware corporation (“Sprint”), pursuant to the Business Combination Agreement, dated as of April 29, 2018 by and among T-Mobile, Sprint, Huron Merger Sub LLC, a Delaware limited liability company and a wholly owned subsidiary of T-Mobile (“Merger Company”), Superior Merger Sub Corporation, a Delaware corporation and a wholly owned subsidiary of Merger Company, Starburst I, Inc., a Delaware corporation, Galaxy Investment Holdings, Inc., a Delaware corporation, and for the limited purposes set forth therein, Deutsche Telekom AG, an Aktiengesellschaft organized and existing under the laws of the Federal Republic of Germany, Deutsche Telekom Holding B.V., a besloten vennootschap met beperkte aansprakelijkheid organized and existing under the laws of the Netherlands, and SoftBank Group Corp., a Japanese kabushiki kaisha."
            },
            "28": {
              "text": "This Form 8-K/A amends the Initial 8-K to include the historical audited and unaudited financial statements of Sprint and the unaudited pro forma combined financial information required by Items 9.01(a) and 9.01(b) of Form 8-K that were excluded from the Initial 8-K in reliance on the instructions to such items."
            },
            "29": {
              "text": "The pro forma financial information included in this Current Report on Form 8-K/A has been presented for informational purposes only, as required by Form 8-K. It does not purport to represent the actual results of operations that the Company and Sprint would have achieved had the companies been combined during the periods presented in the pro forma financial information and is not intended to project the future results of operations that the combined company may achieve after the business combination."
            }
          }
        }
      }
    },
    "30": {
      "title": "Item 9.01 — Financial Statements and Exhibits",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "31": {
          "text": "The following exhibits are furnished as part of this report:"
        },
        "32": {
          "text": "(a) Financial Statements of Businesses Acquired:"
        },
        "33": {
          "text": "The historical audited consolidated balance sheets of Sprint and subsidiaries as of March 31, 2019 and 2018, the related consolidated statements of operations, comprehensive (loss) income, cash flows, and changes in equity for each of the years in the three-year period ended March 31, 2019, and the related notes thereto, are filed herewith as Exhibit 99.1."
        },
        "34": {
          "text": "The historical unaudited balance sheet of Sprint as of December 31, 2019, and the related statements of comprehensive (loss) income, cash flows, and changes in equity for the nine months ended December 31, 2019, and the related notes thereto, are filed herewith as Exhibit 99.2."
        },
        "35": {
          "text": "(b) Pro Forma Financial Information:"
        },
        "36": {
          "text": "The unaudited pro forma condensed combined balance sheet of the Company as of December 31, 2019, the unaudited pro forma condensed combined statements of operations for the year ended December 31, 2019 and the notes to the unaudited pro forma condensed combined financial information, all giving effect to the acquisition by the Company of Sprint, are filed herewith as Exhibit 99.3."
        },
        "37": {
          "text": "(d) Exhibits:"
        },
        "38": {
          "table": [
            [
              "Exhibit",
              "Description"
            ],
            [
              "23.1",
              "Consent of Independent Registered Public Accounting Firm"
            ],
            [
              "99.1",
              "Historical audited consolidated balance sheets of Sprint as of March 31, 2019 and 2018, the related consolidated statements of operations, comprehensive (loss) income, cash flows, and changes in equity for each of the years in the three-year period ended March 31, 2019, and the related notes thereto."
            ],
            [
              "99.2",
              "Historical unaudited consolidated balance sheet of Sprint as of December 31, 2019, the related consolidated statements of comprehensive (loss) income, cash flows, and changes in equity for the nine months ended December 31, 2019, and the related notes thereto."
            ],
            [
              "99.3",
              "Unaudited pro forma condensed combined balance sheet of the Company as of December 31, 2019, the unaudited pro forma condensed combined statement of operations for the year ended December 31, 2019 and the notes thereto."
            ],
            [
              "104",
              "Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document)"
            ]
          ]
        }
      }
    },
    "39": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "40": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "41": {
          "table": [
            [
              "",
              "",
              "T-MOBILE US, INC."
            ],
            [
              "Date:",
              "April 17, 2020",
              "/s/ J. Braxton Carter"
            ],
            [
              "",
              "",
              "J. Braxton Carter\nExecutive Vice President and Chief Financial Officer"
            ]
          ]
        }
      }
    }
  }
}