{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, DC 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): September 19, 2025",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g916281g0904065448081.jpg",
                    "alt": "LOGO"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "Delaware",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(I.R.S. Employer\n Identification No.)"
                    ]
                  ]
                }
              }
            },
            "12": {
              "title": "12920 SE 38th Street",
              "class": "predicted header",
              "contents": {
                "13": {
                  "title": "Bellevue, Washington",
                  "class": "predicted header",
                  "contents": {
                    "14": {
                      "textsmall": "(Address of principal executive offices)"
                    }
                  }
                }
              }
            },
            "15": {
              "title": "98006-1350",
              "class": "predicted header",
              "contents": {
                "16": {
                  "textsmall": "(Zip Code)"
                }
              }
            },
            "17": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header"
            },
            "18": {
              "title": "(Former Name or Former Address, if Changed Since Last Report):",
              "class": "predicted header",
              "contents": {
                "19": {
                  "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions:",
                  "class": "predicted header"
                },
                "20": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "21": {
                  "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                  "class": "predicted header"
                },
                "22": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "23": {
                  "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                  "class": "predicted header"
                },
                "24": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "25": {
                  "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))",
                  "class": "predicted header"
                },
                "26": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "27": {
                  "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))",
                  "class": "predicted header"
                },
                "28": {
                  "title": "Securities registered pursuant to Section 12(b) of the Act:",
                  "class": "predicted header",
                  "contents": {
                    "29": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading\nSymbol(s)",
                          "Name of each exchange\non which registered"
                        ],
                        [
                          "Common Stock, par value $0.00001 per share",
                          "TMUS",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.550% Senior Notes due 2029",
                          "TMUS29",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.700% Senior Notes due 2032",
                          "TMUS32",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.150% Senior Notes due 2032",
                          "TMUS32A",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.850% Senior Notes due 2036",
                          "TMUS36",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.500% Senior Notes due 2037",
                          "TMUS37",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "3.800% Senior Notes due 2045",
                          "TMUS45",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "6.250% Senior Notes due 2069",
                          "TMUSL",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "5.500% Senior Notes due March 2070",
                          "TMUSZ",
                          "The NASDAQ Stock Market LLC"
                        ],
                        [
                          "5.500% Senior Notes due June 2070",
                          "TMUSI",
                          "The NASDAQ Stock Market LLC"
                        ]
                      ]
                    }
                  }
                },
                "30": {
                  "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§ 230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§ 240.12b-2 of this chapter).",
                  "class": "predicted header"
                },
                "31": {
                  "title": "Emerging growth company ☐",
                  "class": "predicted header"
                },
                "32": {
                  "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐",
                  "class": "predicted header"
                }
              }
            }
          }
        }
      }
    },
    "33": {
      "title": "Item 5.02",
      "standardized_title": "item5.02",
      "class": "item",
      "contents": {
        "34": {
          "title": "Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.",
          "class": "predicted header",
          "contents": {
            "35": {
              "title": "On September 19, 2025, the Board of Directors (the “Board”) of T-Mobile US, Inc. (“T-Mobile,” the “Company,” or “us”) appointed Srinivasan Gopalan as President and Chief Executive Officer (“CEO”) of T-Mobile and as a member of the Board, effective November 1, 2025 (the “Effective Date”). Following the Effective Date, G. Michael Sievert, our current President and CEO, will transition to a new executive role, Vice Chairman of the Company. He will also continue to serve as a member of the Board, holding the position of Vice Chairman. Mr. Sievert will be a designee of Deutsche Telekom AG (“DT”) pursuant to the Second Amended and Restated Stockholders’ Agreement, dated June 22, 2020, by and among the Company, DT, and SoftBank Group Corp.",
              "class": "predicted header"
            },
            "36": {
              "title": "Mr. Gopalan, age 55, has served as our Chief Operating Officer since March 2025, bringing extensive experience in technology, telecommunications and business operations, along with a proven track record of operational excellence in digital transformation and customer-centric strategies. From August 2022 to February 2025, he served as a member of the Board. From October 2020 to February 2025, he served as the Managing Director of Telekom Deutschland GmbH. From January 2017 to October 2020, he served as a member of the Board of Management of Deutsche Telekom, responsible for the Europe segment. Prior to Deutsche Telekom, Mr. Gopalan held top roles at Bharti Airtel, Capital One and Vodafone.",
              "class": "predicted header"
            },
            "37": {
              "title": "In connection with Mr. Gopalan’s appointment as President and CEO, on September 19, 2025, T-Mobile entered into a new employment agreement with Mr. Gopalan (the “Gopalan Employment Agreement”), which will become effective as of the Effective Date and will supersede and replace the prior terms of employment between T-Mobile and Mr. Gopalan, dated as of March 1, 2025 (the “Gopalan Terms of Employment”). In addition, in connection with Mr. Sievert’s continued service as an employee of the Company and as Vice Chairman of the Board, T-Mobile entered into an amendment to Mr. Sievert’s amended and restated employment agreement, dated as of March 9, 2023 (the “Sievert Amendment” and such amended and restated employment agreement, the “Sievert Employment Agreement”), which became effective as of September 19, 2025.",
              "class": "predicted header"
            },
            "38": {
              "title": "Also, on September 19, 2025, T-Mobile entered into (i) an amendment to the compensation term sheet, dated as of September 12, 2024, for Peter Osvaldik, our Executive Vice President and Chief Financial Officer (such amendment, the “Osvaldik Amendment” and such term sheet, the “Osvaldik Term Sheet”) and (ii) an amendment to the compensation term sheet, dated as of March 18, 2025, for Michael J. Katz, our President, Marketing, Strategy and Products (the “Katz Amendment”), each of which will become effective as of the Effective Date.",
              "class": "predicted header"
            },
            "39": {
              "title": "The material terms of the Gopalan Employment Agreement, the Sievert Amendment, the Osvaldik Amendment and the Katz Amendment are described below.",
              "class": "predicted header",
              "contents": {
                "40": {
                  "title": "Gopalan Employment Agreement",
                  "class": "predicted header"
                }
              }
            },
            "41": {
              "title": "The Gopalan Employment Agreement provides for an initial employment term that commences on the Effective Date and continues through November 1, 2030, unless T-Mobile and Mr. Gopalan mutually agree in writing to extend the term prior to the expiration thereof.",
              "class": "predicted header"
            },
            "42": {
              "title": "Pursuant to the Gopalan Employment Agreement, (i) Mr. Gopalan is entitled to an annual base salary initially equal to $1,400,000, effective as of the Effective Date; (ii) Mr. Gopalan is eligible for an annual short-term cash incentive targeted at (a) with respect to calendar year 2025, the sum of (x) $2,000,000, prorated for the period starting on January 1, 2025 and ending on the day immediately prior to the Effective Date and (y) $3,500,000, prorated for the period starting on the Effective Date and ending on",
              "class": "predicted header"
            },
            "43": {
              "title": "December 31, 2025 and (b) with respect to calendar year 2026 and subsequent calendar years, 250% of Mr. Gopalan’s base salary (in each case, with a maximum award equal to 200% of target), payable based on the attainment of pre-established performance goals; and (iii) commencing with calendar year 2026, Mr. Gopalan will be entitled to annual long-term incentive awards (“LTI awards”) with a target grant-date value (the “Annual LTI Target Value”) that is not less than $19,500,000.",
              "class": "predicted header"
            },
            "44": {
              "title": "The Gopalan Employment Agreement provides that Mr. Gopalan’s annual base salary and Annual LTI Target Value will be increased by the Compensation Committee of the Board or a subcommittee thereof in subsequent calendar years as set forth below, based on the then-current annual base salaries or target grant date value of annual equity awards (as applicable) for chief executive officers in T-Mobile’s then-current peer group utilized for executive compensation decisions (the “Peer Group” and such chief executive officers, the “Peer CEOs”); provided that the base salary and Annual LTI Target Value will not be lower than that in effect for the immediately preceding calendar year:",
              "class": "predicted header",
              "contents": {
                "45": {
                  "table": [
                    [
                      "Calendar\n Year",
                      "Base Salary",
                      "Annual LTI Target Value"
                    ],
                    [
                      "2026",
                      "40th percentile of then-current annual base salary for Peer CEOs",
                      "40th percentile of then-current target grant date value of annual equity incentive awards for Peer CEOs"
                    ],
                    [
                      "2027",
                      "45th percentile of the then-current annual base salary for Peer CEOs",
                      "45th percentile of then-current target grant date value of annual equity incentive awards for Peer CEOs"
                    ],
                    [
                      "2028",
                      "45th percentile of the then-current annual base salary for Peer CEOs",
                      "45th percentile of then-current target grant date value of annual equity incentive awards for Peer CEOs"
                    ],
                    [
                      "2029",
                      "50th percentile of the then-current annual base salary for Peer CEOs",
                      "50th percentile of then-current target grant date value of annual equity incentive awards for Peer CEOs"
                    ],
                    [
                      "2030",
                      "50th percentile of the then-current annual base salary for Peer CEOs",
                      "50th percentile of then-current target grant date value of annual equity incentive awards for Peer CEOs"
                    ]
                  ]
                }
              }
            },
            "46": {
              "title": "In connection with his commencement as President and CEO, Mr. Gopalan will be granted, under the T-Mobile 2023 Incentive Award Plan, (i) one-time LTI awards with an aggregate target grant-date value equal to $2,904,110 (such awards, the “True-Up LTI Awards”) and (ii) a one-time award of performance-based restricted stock units (“RSUs”) with an aggregate target grant-date value equal to $10,000,000 (the “Transformation Award”). The actual number of shares of T-Mobile common stock subject to the True-Up LTI Awards and the Transformation Award will be determined by dividing the applicable value by the average closing price of T-Mobile common stock over the 30-calendar day period ending five business days prior to the applicable grant date, rounded to the nearest whole share. The True-Up LTI Awards will be comprised of 50% of time-based RSUs and 50% of performance-based RSUs and will be subject to the same vesting schedules and other terms and conditions (including, without limitation, performance goals) applicable to the annual awards of time-based RSUs and performance-based RSUs granted to Mr. Gopalan on March 1, 2025. The Transformation Award will generally be subject to the same vesting schedule and other terms and conditions (including, without limitation, performance goals) applicable to the awards of performance-based RSUs granted to certain members of the Company’s senior leadership team on April 1, 2025.",
              "class": "predicted header"
            },
            "47": {
              "title": "The Gopalan Employment Agreement also provides that Mr. Gopalan is entitled to (i) employee benefits to the same extent and on the same terms as such benefits are provided generally by T-Mobile to",
              "class": "predicted header"
            },
            "48": {
              "title": "its senior executives; (ii) company-paid or reimbursed tax preparation and financial planning services (capped at $50,000 per calendar year); (iii) continued relocation assistance for costs associated with Mr. Gopalan’s relocation to the greater Bellevue, Washington area in accordance with the terms of T-Mobile’s Relocation Policy, subject to pro-rata repayment in the event that Mr. Gopalan’s employment is terminated by T-Mobile for “cause” or by Mr. Gopalan without “good reason” (each as defined in the Gopalan Employment Agreement) on or prior to March 1, 2026; and (iv) company-paid or reimbursed first-class round-trip airfare for Mr. Gopalan and his spouse and children until March 1, 2027 (capped at 32 round-trip flights in the aggregate, inclusive of any round-trip flights occurring prior to the Effective Date, and grossed up for applicable taxes).",
              "class": "predicted header"
            },
            "49": {
              "title": "Under the Gopalan Employment Agreement, Mr. Gopalan continues to be entitled to receive cash payments (each, a “Match Payment”) on or within 60 days following each of May 18, 2026, May 13, 2027 and May 18, 2028 (each, a “Match Date”). The amount of each Match Payment will equal (i) the average closing price of an ordinary share of DT over the 30 calendar-day period ending five business days before the applicable Match Date, multiplied by (ii) the number of ordinary shares of DT released to Mr. Gopalan on such Match Date, subject to Mr. Gopalan’s continued employment with T-Mobile through the applicable payment date (except as otherwise described below).",
              "class": "predicted header"
            },
            "50": {
              "title": "The Gopalan Employment Agreement provides that if Mr. Gopalan’s employment is terminated by T-Mobile other than for “cause” or by Mr. Gopalan for “good reason,” then, subject to his timely execution and non-revocation of a release and continued compliance with applicable restrictive covenants, he will be entitled to receive:",
              "class": "predicted header"
            },
            "51": {
              "title": "•",
              "class": "predicted header"
            },
            "52": {
              "title": "a lump-sum payment equal to two times the sum of (i) his then-current base salary plus (ii) his then-current target short-term incentive;",
              "class": "predicted header"
            },
            "53": {
              "title": "•",
              "class": "predicted header"
            },
            "54": {
              "title": "any earned, unpaid short-term incentive for the last completed fiscal year of T-Mobile preceding the termination date (a “Prior Year STI”);",
              "class": "predicted header"
            },
            "55": {
              "title": "•",
              "class": "predicted header"
            },
            "56": {
              "title": "a pro rata short-term incentive for the fiscal year in which the termination occurs (a “Pro-Rata STI”), based on actual performance results for such year;",
              "class": "predicted header"
            },
            "57": {
              "title": "•",
              "class": "predicted header"
            },
            "58": {
              "title": "with respect to Mr. Gopalan’s then-outstanding LTI awards, and notwithstanding anything to the contrary in the applicable award agreement(s):",
              "class": "predicted header"
            },
            "59": {
              "title": "•",
              "class": "predicted header"
            },
            "60": {
              "title": "full vesting of time-based LTI awards (including any RSUs) that were granted prior to the Effective Date; and",
              "class": "predicted header"
            },
            "61": {
              "title": "•",
              "class": "predicted header"
            },
            "62": {
              "title": "with respect to performance-based LTI awards (including any performance-based RSUs) that were granted prior to the Effective Date,",
              "class": "predicted header"
            },
            "63": {
              "title": "•",
              "class": "predicted header"
            },
            "64": {
              "title": "a portion of each performance-based LTI award, determined by multiplying (x) the total number of shares or units, as applicable, subject to such award by (y) a fraction, the numerator of which is the number of days between the commencement of the applicable performance period in effect as of Mr. Gopalan’s termination of employment through the date of such termination, and the denominator of which is the number of days in the full performance period, will vest based on actual performance through the termination date; and",
              "class": "predicted header"
            },
            "65": {
              "title": "•",
              "class": "predicted header"
            },
            "66": {
              "title": "a portion of each performance-based LTI award, determined by multiplying (x) the total number of shares or units, as applicable, subject to such award by (y) a fraction, the numerator of which is the number of days between the date of Mr. Gopalan’s termination of employment and the end of the applicable performance period in effect as of such termination, and the denominator of which is the number of days in the full performance period, will vest at the greater of target or actual performance as of such termination date;",
              "class": "predicted header"
            },
            "67": {
              "title": "•",
              "class": "predicted header"
            },
            "68": {
              "title": "continued vesting of time-based LTI awards granted on or after the Effective Date on the regularly-scheduled post-termination vesting and payment dates set forth in the applicable award agreement(s);",
              "class": "predicted header"
            },
            "69": {
              "title": "•",
              "class": "predicted header"
            },
            "70": {
              "title": "continued vesting and payment of performance-based LTI awards (including performance-based RSUs) granted on or after the Effective Date in accordance with the terms of the applicable award agreement(s), based on the actual level of actual performance during the performance period (determined as if Mr. Gopalan’s employment had not terminated prior to the conclusion of the performance period);",
              "class": "predicted header"
            },
            "71": {
              "title": "•",
              "class": "predicted header"
            },
            "72": {
              "title": "company-paid health and dental benefit coverage for up to 18 months following such termination;",
              "class": "predicted header"
            },
            "73": {
              "title": "•",
              "class": "predicted header"
            },
            "74": {
              "title": "any then-unpaid Match Payments, payable on the applicable post-termination Match Dates (as described above); and",
              "class": "predicted header"
            },
            "75": {
              "title": "•",
              "class": "predicted header"
            },
            "76": {
              "title": "continued eligibility for T-Mobile’s employee mobile service discount program (the “Continued Mobile Discounts”).",
              "class": "predicted header"
            },
            "77": {
              "title": "Additionally, the Gopalan Employment Agreement provides that Mr. Gopalan may retire at the end of the 5-year employment term (i.e., on November 1, 2030) by providing at least 12 months’ written notice to the Company and receive substantially the same compensation and benefits as he would receive on a termination by T-Mobile other than for “cause” or by Mr. Gopalan for “good reason”.",
              "class": "predicted header"
            },
            "78": {
              "title": "The Gopalan Employment Agreement further provides that if Mr. Gopalan’s employment is terminated due to his death or disability, he will be entitled to receive the following:",
              "class": "predicted header"
            },
            "79": {
              "title": "•",
              "class": "predicted header"
            },
            "80": {
              "title": "any Prior Year STI;",
              "class": "predicted header"
            },
            "81": {
              "title": "•",
              "class": "predicted header"
            },
            "82": {
              "title": "a Pro-Rata STI, based on the greater of target or actual performance results for the fiscal year in which such termination occurs;",
              "class": "predicted header"
            },
            "83": {
              "title": "•",
              "class": "predicted header"
            },
            "84": {
              "title": "any then-unpaid Match Payments, payable on the applicable post-termination Match Dates (as described above);",
              "class": "predicted header"
            },
            "85": {
              "title": "•",
              "class": "predicted header"
            },
            "86": {
              "title": "with respect to Mr. Gopalan’s then-outstanding LTI awards, and notwithstanding anything to the contrary in the applicable award agreement(s):",
              "class": "predicted header"
            },
            "87": {
              "title": "•",
              "class": "predicted header"
            },
            "88": {
              "title": "with respect to LTI awards (including any time-based and performance-based RSUs) granted prior to the Effective Date, the vesting of such LTI awards will be governed by the terms of the applicable award agreement;",
              "class": "predicted header"
            },
            "89": {
              "title": "•",
              "class": "predicted header"
            },
            "90": {
              "title": "continued vesting of time-based LTI awards granted on or after the Effective Date on the regularly-scheduled post-termination vesting and payment dates set forth in the applicable award agreement(s);",
              "class": "predicted header"
            },
            "91": {
              "title": "•",
              "class": "predicted header"
            },
            "92": {
              "title": "continued vesting and payment of performance-based LTI awards (including performance-based RSUs) granted on or after the Effective Date in accordance with the terms of the applicable award agreement(s), based on the actual level of actual performance during the performance period (determined as if Mr. Gopalan’s employment had not terminated prior to the conclusion of the performance period); and",
              "class": "predicted header"
            },
            "93": {
              "title": "•",
              "class": "predicted header"
            },
            "94": {
              "title": "if such termination of employment is due to Mr. Gopalan’s disability, the Continued Mobile Discounts.",
              "class": "predicted header"
            },
            "95": {
              "title": "In addition, if Mr. Gopalan’s employment is terminated due to his resignation without “good reason,” subject to his timely execution and non-revocation of a release and continued compliance with applicable restrictive covenants, he will continue to be paid any then-unpaid Match Payments on the applicable post-termination Match Dates (as described above).",
              "class": "predicted header"
            },
            "96": {
              "title": "The incentive compensation provided to Mr. Gopalan under the Gopalan Employment Agreement is subject to recovery by T-Mobile in accordance with T-Mobile’s Amended and Restated Executive Incentive Compensation Recoupment Policy or any other T-Mobile clawback or recoupment policy. Additionally, to the extent that any payment or benefit received by Mr. Gopalan pursuant to the Gopalan Employment Agreement or otherwise would be subject to an excise tax under Internal Revenue Code Section 4999, such payments and/or benefits will be subject to a “best pay cap” reduction if such reduction would result in a greater net after-tax benefit to Mr. Gopalan than receiving the full amount of such payments.",
              "class": "predicted header"
            },
            "97": {
              "title": "The Gopalan Employment Agreement also provides that T-Mobile will reimburse Mr. Gopalan for up to $50,000 in legal fees incurred by him in connection with the Gopalan Employment Agreement.",
              "class": "predicted header"
            },
            "98": {
              "title": "The foregoing description of the Gopalan Employment Agreement is qualified in its entirety by the full text of the Gopalan Employment Agreement, a copy of which will be subsequently filed with the Securities and Exchange Commission (the “SEC”).",
              "class": "predicted header",
              "contents": {
                "99": {
                  "title": "Sievert Amendment",
                  "class": "predicted header"
                }
              }
            },
            "100": {
              "title": "Pursuant to the Sievert Amendment, effective as of the Effective Date, Mr. Sievert will cease to serve as President and CEO of the Company and, thereafter, will be employed as Vice Chairman of T-Mobile and serve as Vice Chairman of the Board. Mr. Sievert’s term as Vice Chairman of T-Mobile and Vice Chairman of the Board will initially terminate on November 1, 2026, and may be extended by mutual written agreement between Mr. Sievert and T-Mobile.",
              "class": "predicted header"
            },
            "101": {
              "title": "The Sievert Amendment provides that Mr. Sievert will (i) receive an annual base salary of $7,000,000, effective as of the Effective Date, and (ii) continue to be eligible to participate in employee benefit plans maintained by the Company, in each case, in accordance with the terms and conditions of his existing employment agreement. Except as otherwise determined by T-Mobile, Mr. Sievert will not be eligible to receive annual short-term incentive awards or grants of LTI awards on or after the Effective Date.",
              "class": "predicted header"
            },
            "102": {
              "title": "Pursuant to the Sievert Amendment, subject to Mr. Sievert’s continued employment through the Effective Date, and provided that Mr. Sievert timely executes and does not revoke a release of claims, Mr. Sievert will receive the cash severance payments and time-based and performance-based LTI award",
              "class": "predicted header"
            },
            "103": {
              "title": "accelerated vesting that he would have received under the Sievert Employment Agreement if his employment had been terminated on the Effective Date by the Company other than for “cause” or by him for “good reason,” except that, with respect to any performance-based LTI awards that are subject to vesting based on the Company’s relative total shareholder return (“R-TSR Performance Awards”) and are held by Mr. Sievert as of the Effective Date, the level of actual performance will be determined as if the applicable performance period ended as of September 19, 2025. If Mr. Sievert becomes entitled to receive the foregoing payments and accelerated vesting, he will not be entitled to any further separation payments or benefits upon his subsequent termination of employment with T-Mobile, except as described below.",
              "class": "predicted header"
            },
            "104": {
              "title": "The Sievert Amendment also provides that, upon a termination of Mr. Sievert’s employment following the Effective Date by the Company other than for “cause,” by Mr. Sievert with “good reason” (each as defined in the Sievert Employment Agreement, as amended by the Sievert Amendment), due to Mr. Sievert’s death or disability or due to the expiration of the term of his employment as Vice Chairman of T-Mobile and Vice Chairman of the Board, subject to his timely execution and non-revocation of a release, he will be entitled to receive:",
              "class": "predicted header"
            },
            "105": {
              "title": "•",
              "class": "predicted header"
            },
            "106": {
              "title": "a lump-sum cash payment equal to (x) 12 months of his then-current base salary minus (y) the aggregate base salary earned during the period commencing on the Effective Date and ending on (and including) the applicable termination date; and",
              "class": "predicted header"
            },
            "107": {
              "title": "•",
              "class": "predicted header"
            },
            "108": {
              "title": "the continued health and dental benefits and Continued Mobile Discounts that he is eligible to receive under the Sievert Employment Agreement upon a termination of his employment by the Company without “cause” or by him for “good reason.”",
              "class": "predicted header"
            },
            "109": {
              "title": "A description of the material terms of the severance payments and benefits that Mr. Sievert would be entitled to receive upon a termination of his employment by the Company other than for “cause” or by him for “good reason” under the Sievert Employment Agreement was included in the Company’s Current Report on Form 8-K filed with the SEC on March 10, 2023, and such description is incorporated herein by reference. The foregoing description of the Sievert Amendment is qualified in its entirety by the full text of the Sievert Amendment, a copy of which will subsequently be filed with the SEC.",
              "class": "predicted header",
              "contents": {
                "110": {
                  "title": "Osvaldik Amendment",
                  "class": "predicted header"
                }
              }
            },
            "111": {
              "title": "The Osvaldik Amendment amends the Osvaldik Term Sheet to extend the term of Mr. Osvaldik’s employment thereunder through July 1, 2027.",
              "class": "predicted header"
            },
            "112": {
              "title": "Pursuant to the Osvaldik Amendment, upon a termination of Mr. Osvaldik’s employment by T-Mobile without “cause” or by Mr. Osvaldik for “good reason” (each as defined in the Osvaldik Term Sheet) (each, a “qualifying termination”), in either case, prior to July 1, 2027, Mr. Osvaldik will continue to be eligible to receive the severance payments and benefits described in the Osvaldik Term Sheet. In addition, in the event that Mr. Osvaldik’s qualifying termination occurs during the 180-day period (x) immediately prior to February 15, 2027 or (y) immediately prior to February 15th of any subsequent calendar year then, subject to his timely execution and non-revocation of a release of claims and continued compliance with applicable restrictive covenants, Mr. Osvaldik will be entitled to receive:",
              "class": "predicted header"
            },
            "113": {
              "title": "•",
              "class": "predicted header"
            },
            "114": {
              "title": "a pro rata short-term incentive for the calendar year in which such termination occurs, based on actual performance results for the calendar year in which such termination occurs; and",
              "class": "predicted header"
            },
            "115": {
              "title": "•",
              "class": "predicted header"
            },
            "116": {
              "title": "with respect to Mr. Osvaldik’s then-outstanding LTI awards (excluding, for clarity, the 2023 Special PRSU Award (as defined below)) that are scheduled to vest on the next February 15th",
              "class": "predicted header"
            },
            "117": {
              "title": "following the date of such termination (the “Vesting LTI Awards”), and notwithstanding anything to the contrary in the applicable award agreement(s):",
              "class": "predicted header"
            },
            "118": {
              "title": "•",
              "class": "predicted header"
            },
            "119": {
              "title": "with respect to time-based Vesting LTI Awards, vesting of a number of shares or units, as applicable, subject to such awards that would otherwise vest on the next-scheduled vesting date to occur following the termination date; and",
              "class": "predicted header"
            },
            "120": {
              "title": "•",
              "class": "predicted header"
            },
            "121": {
              "title": "with respect to performance-based Vesting LTI Awards, vesting of a portion of such award, determined by multiplying (x) the total number of shares or units, as applicable, subject to such awards by (y) a fraction, the numerator of which is the number of days between the applicable grant date and the termination date, and the denominator of which is the number of days from the grant date to the applicable vesting date, based on actual performance through the conclusion of the applicable performance period.",
              "class": "predicted header"
            },
            "122": {
              "title": "The Osvaldik Amendment also provides that, (i) commencing on the Effective Date, the Expiration Date Payment (as defined in the Osvaldik Term Sheet) will equal (x) 3.3x the target grant-date value of Mr. Osvaldik’s performance-based LTI award that was granted to him on July 5, 2023 (the “2023 Special PRSU Award”), as disclosed in the Company’s annual Proxy Statement filed with the SEC on April 26, 2024, minus (y) the aggregate dollar value of the portion of the 2023 Special PRSU Award that vests as of July 1, 2026 (determined based on the Company’s closing stock price on such vesting date); provided, that in no event will such payment exceed $10,000,000; and (ii) if Mr. Osvaldik’s qualifying termination occurs on or after July 2, 2026, the Expiration Date Payment that is payable as part of Mr. Osvaldik’s severance payments and benefits will not be pro-rated.",
              "class": "predicted header"
            },
            "123": {
              "title": "The foregoing description of the Osvaldik Amendment is qualified in its entirety by the full text of the Osvaldik Amendment, a copy of which will subsequently be filed with the SEC.",
              "class": "predicted header",
              "contents": {
                "124": {
                  "title": "Katz Amendment",
                  "class": "predicted header"
                }
              }
            },
            "125": {
              "title": "The Katz Amendment provides that Mr. Katz will receive (i) an annual base salary of no less than $975,000, effective as of the Effective Date; and (ii) for each calendar year commencing after the Effective Date during Mr. Katz’s employment term, annual LTI awards with an Annual LTI Target Value of no less than $8,575,000. The Katz Amendment provides that Mr. Katz’s annual base salary and Annual LTI Target Value will be increased by the Compensation Committee of the Board or a subcommittee thereof in subsequent calendar years as set forth below, based on the then-current annual base salaries or target grant date value of annual equity awards (as applicable) for the most highly compensated executive officer role (excluding chief executive officers, chief financial officers and, if applicable, executive chairs) (such most highly compensated executive officer roles, “Peer Officers”) in T-Mobile’s Peer Group; provided that the base salary and Annual LTI Target Value will not be lower than that in effect for the immediately preceding calendar year:",
              "class": "predicted header",
              "contents": {
                "126": {
                  "table": [
                    [
                      "Calendar\n Year",
                      "Base Salary",
                      "Annual LTI Target Value"
                    ],
                    [
                      "2026",
                      "50th percentile of then-current annual base salary for Peer Officers",
                      "50th percentile of then-current target grant date value of annual equity incentive awards for Peer Officers"
                    ],
                    [
                      "2027",
                      "50th percentile of the then-current annual base salary for Peer Officers",
                      "50th percentile of then-current target grant date value of annual equity incentive awards for Peer Officers"
                    ],
                    [
                      "2028 and subsequent years",
                      "60th percentile of the then-current annual base salary for Peer Officers",
                      "60th percentile of then-current target grant date value of annual equity incentive awards for Peer Officers"
                    ]
                  ]
                }
              }
            },
            "127": {
              "title": "Additionally, the Katz Amendment provides that Mr. Katz may retire on the fifth anniversary of the Effective Date (i.e., on November 1, 2030) by providing at least 12 months’ written notice to the Company and receive the same compensation and benefits as he would receive on a termination by T-Mobile without “cause” or by Mr. Katz for “good reason,” as described in Mr. Katz’s existing compensation term sheet, except that (i) the accelerated vesting of Mr. Katz’s LTI awards described in his existing compensation term sheet will only apply to LTI awards granted to him prior to the Effective Date and (ii) any LTI awards granted to Mr. Katz on or after the Effective Date will instead continue to vest and be paid to Mr. Katz in accordance with the terms of the applicable award agreement(s).",
              "class": "predicted header"
            },
            "128": {
              "title": "The foregoing description of the Katz Amendment is qualified in its entirety by the full text of the Katz Amendment, a copy of which will subsequently be filed with the SEC.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "129": {
      "title": "Item 7.01",
      "standardized_title": "item7.01",
      "class": "item",
      "contents": {
        "130": {
          "title": "Regulation FD Disclosure.",
          "class": "predicted header",
          "contents": {
            "131": {
              "title": "On September 22, 2025, T-Mobile issued a press release announcing Mr. Gopalan’s appointment as President and CEO of the Company. A copy of the press release is attached hereto as Exhibit 99.1 and is incorporated herein by reference.",
              "class": "predicted header"
            },
            "132": {
              "title": "The information contained in Item 7.01, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "133": {
      "title": "Item 9.01",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "134": {
          "title": "Financial Statements and Exhibits.",
          "class": "predicted header",
          "contents": {
            "135": {
              "title": "(d) Exhibits:",
              "class": "predicted header",
              "contents": {
                "136": {
                  "table": [
                    [
                      "Exhibit\n No.",
                      "Description"
                    ],
                    [
                      "99.1",
                      "Press Release, dated September 22, 2025."
                    ],
                    [
                      "104",
                      "Cover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)."
                    ]
                  ]
                }
              }
            }
          }
        }
      }
    },
    "137": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "138": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "139": {
              "table": [
                [
                  "",
                  "T-MOBILE US, INC."
                ],
                [
                  "September 22, 2025",
                  "/s/ Peter Osvaldik"
                ],
                [
                  "",
                  "Peter Osvaldik \nExecutive Vice President and Chief Financial Officer"
                ]
              ]
            }
          }
        }
      }
    }
  }
}