{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, DC 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): February 11, 2020",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g879296g0211063628914.jpg",
                    "alt": "IMAGE"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "DELAWARE",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction\n of incorporation)",
                      "(Commission\n File Number)",
                      "(IRS Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "textsmall": "(Former Name or Former Address, if Changed Since Last Report):"
                },
                "15": {
                  "text": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the Registrant under any of the following provisions (see General Instructions A.2. below):"
                },
                "16": {
                  "text": "☒Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)"
                },
                "17": {
                  "text": "☐Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)"
                },
                "18": {
                  "text": "☐Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b))"
                },
                "19": {
                  "text": "☐Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))"
                },
                "20": {
                  "text": "Securities registered pursuant to Section 12(b) of the Act:"
                },
                "21": {
                  "table": [
                    [
                      "Title of each class",
                      "Trading\n symbol",
                      "Name of each exchange\n on which registered"
                    ],
                    [
                      "Common Stock, $0.00001 par value per share",
                      "TMUS",
                      "The NASDAQ Stock Market LLC"
                    ]
                  ]
                },
                "22": {
                  "text": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter)."
                },
                "23": {
                  "text": "Emerging growth company  ☐"
                },
                "24": {
                  "text": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐"
                }
              }
            }
          }
        }
      }
    },
    "25": {
      "title": "Item 8.01",
      "standardized_title": "item8.01",
      "class": "item",
      "contents": {
        "26": {
          "title": "Other Events.",
          "class": "predicted header",
          "contents": {
            "27": {
              "text": "On February 11, 2020, T-Mobile US, Inc. (the “Company”) and Sprint Corporation (“Sprint”) issued a press release announcing that the U.S. District Court for the Southern District of New York issued a ruling in favor of the Company, Sprint, and the other defendants in the lawsuit commenced by certain state attorneys general relating to the Company’s previously announced business combination with Sprint, declining to enjoin the transaction. The text of the press release is filed as Exhibit 99.1 and incorporated herein by reference."
            }
          }
        }
      }
    },
    "28": {
      "title": "Item 9.01",
      "standardized_title": "item9.01",
      "class": "item",
      "contents": {
        "29": {
          "title": "Financial Statements and Exhibits.",
          "class": "predicted header"
        },
        "30": {
          "title": "(d) Exhibits.",
          "class": "predicted header",
          "contents": {
            "31": {
              "table": [
                [
                  "Exhibit \nNo.",
                  "Description"
                ],
                [
                  "99.1",
                  "Press Release issued by the Company and Sprint on February 11, 2020"
                ],
                [
                  "104",
                  "Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document)."
                ]
              ]
            }
          }
        },
        "32": {
          "title": "Important Additional Information",
          "class": "predicted header",
          "contents": {
            "33": {
              "text": "In connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile  may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091."
            }
          }
        },
        "34": {
          "title": "No Offer or Solicitation",
          "class": "predicted header",
          "contents": {
            "35": {
              "text": "This communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended."
            }
          }
        },
        "36": {
          "title": "Cautionary Statement Regarding Forward-Looking Statements",
          "class": "predicted header",
          "contents": {
            "37": {
              "text": "This communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially"
            },
            "38": {
              "text": "from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law."
            }
          }
        }
      }
    },
    "39": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "40": {
          "text": "Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized."
        },
        "41": {
          "table": [
            [
              "Date: February 11, 2020",
              "T-MOBILE US, INC.",
              "T-MOBILE US, INC."
            ],
            [
              "",
              "By:",
              "/s/ David A. Miller"
            ],
            [
              "",
              "",
              "David A. Miller"
            ],
            [
              "",
              "",
              "Executive Vice President, General Counsel and Secretary"
            ]
          ]
        }
      }
    }
  }
}