{
  "metadata": {
    "parser": "doc2dict",
    "github": "https://github.com/john-friedman/doc2dict",
    "version": "0.4.9"
  },
  "document": {
    "-1": {
      "title": "introduction",
      "class": "introduction",
      "contents": {
        "0": {
          "title": "UNITED STATES",
          "class": "predicted header"
        },
        "1": {
          "title": "SECURITIES AND EXCHANGE COMMISSION",
          "class": "predicted header"
        },
        "2": {
          "title": "WASHINGTON, D.C. 20549",
          "class": "predicted header"
        },
        "3": {
          "title": "FORM 8-K",
          "class": "predicted header"
        },
        "4": {
          "title": "CURRENT REPORT",
          "class": "predicted header",
          "contents": {
            "5": {
              "title": "Pursuant to Section 13 or 15(d)",
              "class": "predicted header"
            },
            "6": {
              "title": "of the Securities Exchange Act of 1934",
              "class": "predicted header"
            },
            "7": {
              "title": "Date of report (Date of earliest event reported): August 24, 2020",
              "class": "predicted header",
              "contents": {
                "8": {
                  "image": {
                    "src": "g75923g98b53.jpg",
                    "alt": "LOGO"
                  }
                }
              }
            }
          }
        },
        "9": {
          "title": "T-MOBILE US, INC.",
          "class": "predicted header",
          "contents": {
            "10": {
              "title": "(Exact Name of Registrant as Specified in Charter)",
              "class": "predicted header",
              "contents": {
                "11": {
                  "table": [
                    [
                      "Delaware",
                      "1-33409",
                      "20-0836269"
                    ],
                    [
                      "(State or other jurisdiction of\n incorporation or organization)",
                      "(Commission\n File Number)",
                      "(I.R.S. Employer\n Identification No.)"
                    ]
                  ]
                },
                "12": {
                  "table": [
                    [
                      "12920 SE 38th Street\n Bellevue, Washington",
                      "98006-1350"
                    ],
                    [
                      "(Address of principal executive offices)",
                      "(Zip Code)"
                    ]
                  ]
                }
              }
            },
            "13": {
              "title": "Registrant’s telephone number, including area code: (425) 378-4000",
              "class": "predicted header",
              "contents": {
                "14": {
                  "textsmall": "(Former Name or Former Address, if Changed Since Last Report):"
                },
                "15": {
                  "title": "Check the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the following provisions:",
                  "class": "predicted header"
                },
                "16": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "17": {
                  "title": "Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)",
                  "class": "predicted header"
                },
                "18": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "19": {
                  "title": "Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)",
                  "class": "predicted header"
                },
                "20": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "21": {
                  "title": "Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR 240.14d- 2(b))",
                  "class": "predicted header"
                },
                "22": {
                  "title": "☐",
                  "class": "predicted header"
                },
                "23": {
                  "title": "Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e- 4(c))",
                  "class": "predicted header"
                },
                "24": {
                  "title": "Securities registered pursuant to Section 12(b) of the Act:",
                  "class": "predicted header",
                  "contents": {
                    "25": {
                      "table": [
                        [
                          "Title of each class",
                          "Trading\n Symbol",
                          "Name of each exchange\n on which registered"
                        ],
                        [
                          "Common Stock, par value $0.00001 per share",
                          "TMUS",
                          "The NASDAQ Stock Market LLC"
                        ]
                      ]
                    }
                  }
                },
                "26": {
                  "title": "Indicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).",
                  "class": "predicted header"
                },
                "27": {
                  "title": "Emerging growth company  ☐",
                  "class": "predicted header"
                },
                "28": {
                  "title": "If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act.  ☐",
                  "class": "predicted header"
                }
              }
            }
          }
        }
      }
    },
    "29": {
      "title": "Item 7.01.",
      "standardized_title": "item7.01",
      "class": "item",
      "contents": {
        "30": {
          "title": "Regulation FD Disclosure.",
          "class": "predicted header",
          "contents": {
            "31": {
              "title": "Exercise of Purchase Option for Shentel wireless telecommunications assets",
              "class": "predicted header"
            },
            "32": {
              "title": "As previously disclosed, Sprint PCS (specifically Sprint Spectrum L.P.) is party to a variety of publicly filed agreements with Shenandoah Personal Communications Company (“Shentel”), pursuant to which Shentel is the exclusive provider of Sprint PCS’s wireless mobility communications network products in certain parts of Virginia, West Virginia, Kentucky, Ohio, and Pennsylvania that are home to approximately 1.1 million subscribers, as reported by Shentel as of June 30, 2020. Pursuant to one such agreement, the Sprint PCS Management Agreement, dated November 5, 1999 (as amended, supplemented and modified from time to time, the “Management Agreement”), Sprint PCS was granted an option to purchase Shentel’s wireless telecommunications assets. On August 26, 2020, Sprint Corporation, an indirect subsidiary of T-Mobile US, Inc. (“T-Mobile”), on behalf of and as the direct or indirect owner of Sprint PCS, exercised its option by delivering a binding notice of exercise to Shentel.",
              "class": "predicted header"
            },
            "33": {
              "title": "The purchase price for the Shentel wireless telecommunications assets to be purchased by Sprint will be determined through the appraisal process prescribed in the Management Agreement.",
              "class": "predicted header",
              "contents": {
                "34": {
                  "title": "Dispute with Shentel",
                  "class": "predicted header"
                }
              }
            },
            "35": {
              "title": "Prior to Sprint exercising the call option described above, Shentel and T-Mobile had been in discussions regarding the appraisal framework through which the purchase price for Shentel’s wireless telecommunications assets would be determined if Sprint were to exercise its option. The parties were not able to agree on certain terms for an effective appraisal of Shentel’s wireless telecommunications assets. On August 24, 2020, Shentel delivered to T-Mobile a “Notice of Dispute” relating to the appraisal framework items discussed by the parties and other contractual terms related to Sprint’s acquisition of Shentel’s wireless telecommunications assets. Issuance of the Notice of Dispute by Shentel triggers a dispute resolution process set out in the Management Agreement that may lead the parties to extend or otherwise adjust the timeline for the appraisal process and purchase of Shentel’s wireless telecommunications assets. Should the parties fail to resolve a dispute within 60 days following delivery of the Notice of Dispute, either party may pursue other remedies, as permitted by the Management Agreement. The appraisal process could be subject to various other legal challenges that may also extend or affect the timeline contained in the Management Agreement.",
              "class": "predicted header"
            },
            "36": {
              "title": "The information contained in Item 7.01 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.",
              "class": "predicted header"
            }
          }
        }
      }
    },
    "37": {
      "title": "SIGNATURES",
      "standardized_title": "signatures",
      "class": "signatures",
      "contents": {
        "38": {
          "title": "Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.",
          "class": "predicted header",
          "contents": {
            "39": {
              "table": [
                [
                  "",
                  "",
                  "T-MOBILE US, INC."
                ],
                [
                  "August 27, 2020",
                  "By:",
                  "/s/ Peter Osvaldik"
                ],
                [
                  "",
                  "Name:",
                  "Peter Osvaldik"
                ],
                [
                  "",
                  "Title:",
                  "Executive Vice President and Chief Financial Officer"
                ]
              ]
            }
          }
        }
      }
    }
  }
}